```json
{
  "tad": "that",
  "yatha": "as",
  "iha": "here",
  "karmajito": "by action, acquired",
  "lokaḥ": "world",
  "kṣīyata": "is destroyed",
  "evam": "thus",
  "eva": "indeed",
  "amutra": "there",
  "puṇyajito": "by merit, acquired",
  "lokaḥ": "world",
  "kṣīyata": "is destroyed",
  "tad": "that",
  "ya": "who",
  "iha": "here",
  "ātmāna": "Self",
  "anuvidya": "knowing",
  "vrajanti": "go",
  "etāśca": "these also",
  "satyānkāmāḥ": "with true desires",
  "teṣā": "their",
  "sarveṣu": "in all",
  "lokeṣu": "worlds",
  "kāmacāro": "as they please",
  "bhavati": "become",
  "atha": "but",
  "ya": "who",
  "iha": "here",
  "ātmāna": "Self",
  "anivudya": "not knowing",
  "vrajanti": "go",
  "etāśca": "these also",
  "satyān": "true",
  "kāmāḥ": "desires",
  "teṣā": "their",
  "sarveṣu": "in all",
  "lokeṣu": "worlds",
  "kāmacāro": "as they please",
  "bhavati": "become"
}
```

**Overall Meaning:**

"That, as here, the world acquired by action is destroyed, thus indeed, there, the world acquired by merit is destroyed. That, who here, knowing the Self, go, these also, with true desires, their, in all worlds, become as they please. But, who here, not knowing the Self, go, these also, with true desires, their, in all worlds, become as they please."

**Explanation:**

This verse contrasts two paths: one based on actions and merit, and another based on the true knowledge of the Self. It highlights the impermanence of both the worldly realms gained through actions and merit. 

The verse emphasizes the importance of Self-knowledge, suggesting that those who truly understand the Self transcend the limitations of these cycles. They attain liberation from the constraints of actions and desires, achieving true freedom and fulfillment in all realms. 

The verse highlights the consequences of both paths, demonstrating how those who pursue worldly achievements are ultimately bound by the cycle of impermanence, while those who seek Self-knowledge experience liberation and true freedom. 


