{
    "verse_no": "१-३-३",
    "verse": "आत्मानं रथिनं विद्धि शरीरं रथमेव तु।\nबुद्धिं तु सारथिं विद्धि मनः प्रग्रहमेव च ॥",
    "terms": {
        "आत्मानं": "the Self",
        "रथिनं": "as the charioteer",
        "विद्धि": "understand",
        "शरीरं": "the body",
        "रथमेव": "as the chariot",
        "तु": "but",
        "बुद्धिं": "the intellect",
        "सारथिं": "as the charioteer",
        "मनः": "the mind",
        "प्रग्रहम्": "as the reins",
        "एव": "indeed",
        "च": "and"
    },
    "wisdomlib": {
        "meaning": "Know the atman as the lord of the chariot, the body as only the chariot, know also intelligence as the driver; know the minds as the reins.",
        "shankara-comm": "Here a chariot is imagined for the atman, conditioned in Samsara, entitled to acquire knowledge and perform Karma for attaining emancipation and for travelling in Samsara, as a means to reach both. Know the atman, who is the enjoyer of the fruits of Karma and is in the bondage of Samsara, to be the lord of the chariot. Know the body to be verily the chariot, because like a chariot the body is drawn by the senses occupying the place of horses. Know also the intelligence to be the driver, furnished with the capacity for determination, because the body is mainly guided by the intelligence, as the chariot is mainly guided by the driver; for, everything done by the body is generally done by the intelligence. Know the mind with its characteristics of volition, doubt, etc., to be the reins; for, the senses, such as the ear, perform their functions when grasped by the mind as horses by the reins."
    },
    "meaning": "आत्मानं रथिनं विद्धि शरीरं रथमेव तु।बुद्धिं तु सारथिं विद्धि मनः प्रग्रहमेव च ॥Meaning:Understand the Self to be like the charioteer and the body to be like the chariot. But know the intellect to be the charioteer and the mind as the reins.Explanation:This verse is taken from the Bhagavad Gita and metaphorically compares the human experience to a chariot. The Self, which represents the eternal consciousness or soul, is compared to the charioteer who guides the chariot. The body is compared to the chariot itself, as it is the physical instrument through which the Self experiences the world.However, it is emphasized that it is the intellect (buddhi) that should act as the charioteer, guiding the desires and actions of the individual. The mind (manas) is compared to the reins, as it is responsible for controlling and directing the senses and emotions.",
    "upanishad-org": {
        "meaning": "Know the body for a chariot and the soul for the master of the chariot: know Reason for the charioteer and the mind for the reins only."
    }
}