{
    "verse_no": "१-३-४",
    "verse": "इन्द्रियाणि हयानाहुर्विषयांस्तेषु गोचरान्‌।\nआत्मेन्द्रियमनोयुक्तं भोक्तेत्याहुर्मनीषिणः ॥",
    "terms": {
        "इन्द्रियाणि": "the senses",
        "हयानाहुः": "are said to be like horses",
        "विषयांस्तेषु गोचरान्‌": "they move towards their respective objects",
        "आत्मेन्द्रियमनोयुक्तं": "the intellect, mind, and senses joined together",
        "भोक्तेत्याहुः मनीषिणः": "the wise say that the one who experiences through them is the enjoyer"
    },
    "wisdomlib": {
        "meaning": "The senses, they say, are the horses; the objects which they perceive, the way; the atman, the senses and the mind combined, the intelligent call the enjoyer",
        "shankara-comm": "Those who are versed in the construction of chariots call the senses, such as the eye and the rest, horses, from the similitude of their drawing the body. Know the objects (such as form, etc.), of these senses, regarded as horses, to be the roads. The intelligent call the atman combined with the body, the senses and the mind, the enjoyer, i.e., one in Samsara; for, the pure atman cannot be the enjoyer. Its enjoyment is only the product of its conditions such as intelligence, etc.; accordingly also, other srutis declare that the pure atman is certainly not the enjoyer. ‘It seems to think and to move’; only if this is so, in working out the analogy of the chariot to be described, it will be appropriate to understand. ‘The Vishnu Pada’ as the pure atman but not otherwise; for, there can be no going beyond Samsara in the case of the pure atman."
    },
    "meaning": "Meaning:This verse explains the relationship between the senses and the experiencer. The senses are compared to horses that move towards their respective objects of perception. When the intellect, mind, and senses act in harmony, the wise say that the experiencer, known as the \"bhokta\", experiences through them. In other words, the senses are tools through which the experiencer gains experiences.",
    "upanishad-org": {
        "meaning": "The senses they speak of as the steeds and the objects of sense as the paths in which they move; and One yoked with self and the mind and the senses, as the enjoyer, say the thinkers."
    }
}