```json
{
  "यत्र": "where",
  "सुप्ता": "sleeping",
  "जना": "people",
  "नित्यम्": "always",
  "प्रबुद्धः": "awake",
  "तत्र": "there",
  "संयमी": "controlled, self-disciplined",
  "प्रबुद्धा": "awake",
  "यत्र": "where",
  "ते": "those",
  "विद्वान्": "the wise one",
  "सुप्तिम्": "sleep",
  "याति": "goes",
  "योगिराट्": "the king of yogis"
}
```

**Overall meaning:**

"Where ordinary people are always asleep, the self-controlled one is awake. Where the wise ones are awake, the king of yogis enters into sleep."

**Explanation:**

This verse from the Upanishads describes the contrasting states of consciousness between ordinary people, the self-disciplined, and the enlightened yogi:

* **"Ordinary people asleep":** This refers to those who are constantly caught up in the distractions and desires of the material world, their minds clouded by ignorance and attachments.
* **"Self-controlled one awake":** The self-disciplined individual has gained a degree of awareness and control over their senses and thoughts, remaining vigilant and mindful even amidst worldly distractions.
* **"Wise ones awake":** The wise ones, who have attained a deeper understanding of reality, remain awake to the true nature of existence, free from illusions and attachments.
* **"King of yogis enters into sleep":** This refers to the enlightened yogi, who has transcended the limitations of ordinary consciousness. Their state of "sleep" is not a state of unconsciousness, but rather a state of profound awareness and unity with the divine. 

The verse implies that the path to enlightenment involves a journey of awakening, progressing from a state of ignorance to one of self-awareness and ultimately to a state of union with the divine. The yogi, having achieved this union, experiences a state of profound peace and unity, which transcends the limitations of ordinary consciousness.

This verse highlights the concept of different levels of awareness and consciousness, emphasizing that the pursuit of enlightenment involves a continuous process of awakening and liberation from the limitations of the ordinary mind. 
