{
    "verse_no": "१-३-१७",
    "verse": "इतरपरामर्शात्स इति चेन्नासम्भवात् ॥",
    "theme": "dahar vidya - अगर ये कहा जाए की दहर आकाश जीव है तो ऐसा नहीं है ये असंभव है - छान्दो ८-१-३ में दहर आकाश की तुलना प्राकृत आकाश से की गई है जोकि सर्वव्यापक है किंतु जीव एकदेश व्यापक है इसलिए ये असंभव है",
    "wisdomlib": {
        "terms": {
            "itara-parāmarśat": "Because of the reference to the other (i.e. the individual soul)",
            "saḥ": "he (the individual soul)",
            "iti cet": "if it be said",
            "na": "no",
            "asambhavāt": "on account of impossibility"
        },
        "meaning": "Because of the reference to the other (i.e. the individual soul in a complementary passage) if it be said that he (the individual soul) (and not Brahman is meant by the ‘small Akasa’), (we say)' no, on account of the impossibility (of such an assumption)",
        "shankara-comm": "“Now that being, the individual soul (Jiva) in deep sleep, which having risen above this earthly body” etc. (Chh. 8. 3. 4).\n\nSince in this complementary passage the individual soul is referred to, one may say that the ‘small Akasa’ of Chh. 8. 1. 1 is also the individual soul. It cannot be; for a comparison is made in Chh. 8. 1. 3 between the ‘small Akasa’ and the ether, which would be absurd if by ‘small Akasa’ Jiva were meant, because there can be no comparison between a thing that is limited like the individual soul and the all-pervading ether. The attributes like ‘free from evil’ of this Akasa, referred to in the passage under discussion, cannot be true of the individual soul. So Brahman is meant in that passage."
    },
    "terms": {
        "इतरपरामर्शात्": "इतरः परः आमर्शः अर्थात्, ज्ञान की प्राप्ति करने वाले कारण से।",
        "स इति चेत्": "स इति चेत् अर्थात्, सोऽयम् वा नेति भावे चेत्। यदि ऐसा होता है तो।",
        "नासम्भवात्": "नासम्भवात् अर्थात्, असंभव होने से।"
    },

    "meaning": "अनुवाद: ज्ञान की प्राप्ति करने वाले किसी और कारण से होने पर नहीं, यदि ऐसा होता है तो असंभव होने के कारण।व्याख्या: यह श्लोक ब्रह्मसूत्र के द्वितीया अध्याय के प्रथम पाद की द्वितीय सूत्र की टिप्पणी को समझाता है। इस सूत्र में यह सिद्धान्त दिया गया है कि ब्रह्म का प्रकट होना ईश्वर के अनुभव से होता है, और यदि ईश्वर के अनुभव के अलावा इसका कोई और भी कारण होता है, तो वह असंभव होता है। इस सूत्र में एक विरोध युक्ति के रूप में प्रयुक्त हो रही है, जिससे साबित होता है कि ब्रह्म के प्रकट होने का केवल ईश्वर के अनुभव ही कारण होता है। अन्य कारणों के द्वारा ब्रह्म का प्रकट होना असंभव है।"
}