{
    "verse_no": "१-३-१४",
    "verse": "गतिशब्दाभ्यां तथा हि दृष्टं लिङ्गं च ॥",
    "theme": "dahar vidya - जीव की ब्रह्म में गति की बात श्रुतियों में कही गई है - एतं ब्रह्मलोकं न विन्दन्त्यनृतेन हि प्रत्यूढाः(छान्दो. ८-३-२), सति संपद्य न विदुः सति संपद्यामह इति(छान्दो. ६-९-२), सत आगम्य न विदुः सत आगच्छामह(छान्दो. ६-१०-२)",
    "wisdomlib": {
        "terms": {
            "gatiśabdābhyām": "From going and the word",
            "tathā hi": "likewise",
            "dṛṣṭaṃ": "it is seen",
            "liṅgam": "indicatory",
            "ca": "and"
        },
        "meaning": "The small Akasa (is Brahman) on account of going (into Brahman) and of the word (Brahmaloka); it (i.e. the individual soul’s going into Brahman) is likewise seen (from other Sruti texts); and (the daily going) is an indicatory sign (by which we can interpret the word Brahmaloka).",
        "shankara-comm": "This Sutra gives further reasons that the ‘small Akasa’ is Brahman.\n\n“All these creatures day after day go into this Brahmaloka (i.e. they are merged in Brahman while fast asleep) and yet do not discover it” etc. (Chh. 8. 3. 2).\n\nThis text shows that in deep sleep all Jivas go daily into the ‘small Akasa’, called here Brahmaloka (the world of Brahman), thus showing that the ‘small Akasa’ is Brahman. In other Sruti texts also we find that this going of the individual soul into Brahman in deep sleep is mentioned : “He becomes united with the Real (Sat), he is merged in his own self” (Chh. 0. 8. 1). The word ‘Brahmaloka’ is to be interpreted as Brahman Itself, and not as the world of Brahma, because of the indicatory sign in the text where it is said that the soul goes to this world every day, for it is not possible to go to the world of Brahma every day."
    },
    "terms": {
        "गति": "motion",
        "शब्दाभ्यां": "through the words",
        "तथा": "in the same way",
        "हि": "indeed",
        "दृष्टं": "seen",
        "लिङ्गं": "indication",
        "च": "and"
    },
    "meaning": "Meaning: Through the words and also by means of indication, the concept of motion is understood.Explanation: In this verse, the Brahmasutra states that the concept of motion can be understood through both verbal communication and through indications. This implies that motion can be conveyed through spoken or written words, as well as through various signs or actions. The sutra suggests that the presence of words or indications can be observed to infer the existence or occurrence of motion. This verse highlights the importance of language and signs in communication and understanding."
}