{
    "verse_no": "१-३-१३",
    "verse": "दहर उत्तरेभ्यः ॥",
    "ref" : [
        "main kaun mera kaun 4 - 25:27"
    ],
    "theme": "dahar vidya - दहर आकाश ब्रह्म है कोई प्राकृत आकाश नहीं और जीव नहीं",
    "wisdomlib": {
        "terms": {
          "daharaḥ": "Small",
          "uttarebhyaḥ": "because of subsequent texts."
        },
         "meaning": "The small (Akasa) (is Brahman) because of subsequent texts (which give ample indication to that effect)",
         "shankara-comm": "“Now there is in this city of Brahman (the body) a small lotus-like palace (the heart), and in it a small Akasa. What exists within that small Akasa is to be sought, that is to be understood” (Chh. 8. 1. 1).\n\nHere the ‘small Akasa’ is Brahman and does not mean ether, though it is the ordinary meaning of the word; nor does it mean the Jiva or individual soul, though there is the qualification ‘small’, which may show that it is a limited something. Why ? Because the characteristics of Brahman occur later on in the text, “As large as this (external) ether is, so large is that Akasa within the heart” (Chh. 8. 1. 3), which clearly shows it is not actually small. Again Akasa cannot be compared with itself, nor can the limited individual soul be compared with the all-pervading ether. Therefore the two are precluded. Then we have the characteristics of Brahman. “Both the earth and heaven are contained in it” (Ibid. 8. 1. 3), which shows that this Akasa is the support of the whole world. “It is the Self, free from sin, free from old age” etc. (Ibid. 8.1.5), all of which are distinctly qualities of the Highest Brahman"
     },
    "terms": {
        "दहरः": "(daharah) small",
        "उत्तरेभ्यः": "(uttarebhyah) from the scriptures "
    },
    "meaning": "Therefore, the phrase \"दहर उत्तरेभ्यः\" (dahar uttarebhyah) can be roughly translated as \"from the scriptures about the Inner Controller.\" This verse is from the Brahma Sutras, and it signifies that the knowledge about the Inner Controller or the Self is obtained from scriptural texts. It emphasizes the importance of studying the scriptures to understand the nature of the Self and its relationship with the universe."
}