```json
{
  "अणिमादिपदं": {
    "अणिमा": "the ability to become small",
    "आदि": "etc.",
    "पदं": "state"
  },
  "प्राप्य": "achieving",
  "राजते": "becomes king",
  "राजयोगतः": {
    "राज": "royal",
    "योग": "yoga",
    "तः": "from"
  },
  "प्राणापानसमायोगो": {
    "प्राण": "inhalation",
    "आपन": "exhalation",
    "समायोगः": "union"
  },
  "ज्ञेयं": "should be known",
  "योगचतुष्टयम्": {
    "योग": "yoga",
    "चतुष्टय": "fourfold"
  }
}
```

**Overall meaning:**

Achieving the state of "an-ima" (ability to become small) etc. makes one a king through royal yoga. The union of inhalation and exhalation should be known as the fourfold yoga.

**Explanation:**

This verse outlines the benefits of Royal Yoga (Rajayoga) and introduces the concept of the "fourfold yoga" (yoga caturshtaya). 

* **An-ima etc.:** "An-ima" refers to one of the eight siddhis, or supernatural powers, which are said to be attainable through advanced yogic practices. The other siddhis include the ability to become large (mahima), the ability to become light (laghima), the ability to become heavy (garhima), the ability to control the elements (prakamya), the ability to enter another's body (vaśīkaraṇa), the ability to become invisible (praptī), and the ability to gain knowledge of everything (kāmāvasāyitā). 
* **Becoming a king:** This refers to the realization of one's true nature as the Self, achieving a state of freedom, power, and mastery over the senses and mind.
* **Royal yoga:** This is the highest form of yoga, often associated with the practice of meditation and mental discipline. It involves transcending the limitations of the mind and achieving enlightenment.
* **Union of inhalation and exhalation:** This refers to the practice of controlled breathing (pranayama), which is an integral part of yoga. The balance of inhalation (pran) and exhalation (apan) is essential for harmonizing the body and mind.
* **Fourfold yoga:** This is a classification of yoga practices into four categories: Hatha Yoga (physical yoga), Karma Yoga (the yoga of action), Jnana Yoga (the yoga of knowledge), and Bhakti Yoga (the yoga of devotion).

The verse suggests that through the practice of Royal Yoga, one can achieve a state of liberation and master the mind and senses. It also emphasizes the importance of understanding the fourfold yoga (yoga caturshtaya) in order to achieve holistic well-being and spiritual growth. 
