```json
{
  "कन्द": "kanda",
  "meaning": "root, base",
  "ऊर्ध्वे": "urdve",
  "meaning": "upwards",
  "कुण्डली": "kundali",
  "meaning": "coiled, Kundalini",
  "शक्ति": "shakti",
  "meaning": "power",
  "मुक्ति": "mukti",
  "meaning": "liberation",
  "रूपा": "rupa",
  "meaning": "form",
  "हि": "hi",
  "meaning": "indeed",
  "योगिनाम्": "yoginam",
  "meaning": "of the yogis",
  "बन्धनाय": "bandhanaya",
  "meaning": "for bondage",
  "च": "cha",
  "meaning": "and",
  "मूढानां": "mudadanam",
  "meaning": "of the ignorant",
  "यस्तां": "yastam",
  "meaning": "who that",
  "वेत्ति": "vetti",
  "meaning": "knows",
  "स": "sa",
  "meaning": "that",
  "योगवित्": "yogavit",
  "meaning": "knower of yoga"
}
"overall_meaning": "At the root (base chakra), the Kundalini power is the form of liberation for the yogis.  For the ignorant, it is for bondage.  Whoever knows that is the knower of yoga." 
```

**Explanation:**

This verse highlights the dual nature of Kundalini energy: it can be a force for liberation for those who understand and control it, but also a source of bondage for the ignorant.

* **कन्दोर्ध्वे कुण्डलीशक्तिर्मुक्तिरूपा हि योगिनाम्** - This explains that the Kundalini power (kundali shakti) at the base (kanda urdve) is the form (rupa) of liberation (mukti) for the yogis (yoginam). This signifies that the yogi, through understanding and control of Kundalini, can achieve liberation from the cycle of birth and death.
* **बन्धनाय च मूढानां यस्तां वेत्ति स योगवित्** - This adds that for the ignorant (mudadanam), Kundalini can be a source of bondage (bandhanaya).  Only those who know (vetti) this dual nature of Kundalini (yastam) are considered true yogis (yogavit). 

**Overall Meaning:**

The verse emphasizes that Kundalini energy can be both a path to liberation and a source of bondage depending on one's understanding. The true yogi is one who recognizes its potential for both and uses it to achieve liberation, while those who are ignorant are bound by its uncontrolled energy. 


