{
    "verse_no": "१-२",
    "verse": "स होवाच ये वै के चास्माल्लोकात्प्रयन्ति चन्द्रमसमेव ते सर्वे गच्छन्ति।\nतेषां प्राणैः पूर्वपक्ष आप्यायते।\nअथापरपक्षे न प्रजनयति।\nएतद्वै स्वर्गस्य लोकस्य द्वारं यश्चन्द्रमास्तं यत्प्रत्याह तमतिसृजतेऽथ य एनं प्रत्याहतमिह वृष्टिर्भूत्वा वर्षति स इह कीटो वा पतङ्गो वा शकुनिर्वा शार्दूलो वा सिंहो वा मत्स्यो वा परश्वा वा पुरुषो वान्यो वैतेषु स्थानेषु प्रत्याजायते यथाकर्म यथाविद्यम्।\nतमागतं पृच्छति कोऽसीति तं प्रतिबूयाद्विचक्षणादतवो रेत आभृतं पञ्चदशात्प्रसूतात्पित्र्यावतस्तन्मा पुंसि कर्तर्येयध्वं पुंसा कर्त्रा मातरि मा निषिक्तः स जायमान उपजायमानो द्वादश त्रयोदश उपमासो द्वादशत्रयोदशेन पित्रा संतद्विदेहं तन्म ऋतवो मर्त्यव आरभध्वम्।\nतेन सत्येन तपसरस्यार्तवोऽस्मि कोऽसि त्वमस्मीति तमतिसृजते ॥",
    "terms": {
        "स होवाच": "He said",
        "ये वै": "(As) indeed",
        "के": "who",
        "च": "also",
        "आस्माल्": "us",
        "लोकात्": "from the world",
        "प्रयन्ति": "depart",
        "चन्द्रमसम्": "like the moon",
        "इव": "as",
        "ते सर्वे": "they all",
        "गच्छन्ति": "go",
        "तेषां": "of them",
        "प्राणैः": "by the vital breaths",
        "पूर्व": "earlier",
        "पक्षे": "it increases",
        "आप्यायते": "it diminishes",
        "अथ": "then",
        "अपर": "in the second half (of the lunar month)",
        "न": "not",
        "प्रजनयति": "it procreates",
        "एतत्": "this",
        "वै": "indeed",
        "स्वर्गस्य": "of heaven",
        "लोकस्य": "of the world",
        "द्वारम्": "the door",
        "यः": "who",
        "चन्द्रमाः": "the moon",
        "तं": "him",
        "यत्": "that",
        "प्रत्याह": "opposes",
        "तम्": "him",
        "अतिसृजते": "he banishes",
        "एनम्": "him",
        "प्रत्याहतम्": "opposed",
        "इह": "here",
        "वृष्टिः": "rain",
        "भूत्वा": "becoming",
        "वर्षति": "rains",
        "सः": "he",
        "कीटः": "insects",
        "वा": "or",
        "पतङ्गः": "moths",
        "शकुनिः": "birds",
        "शार्दूलः": "tigers",
        "सिंहः": "lions",
        "मत्स्यः": "fish",
        "परश्वाः": "snakes",
        "पुरुषः": "humans",
        "अन्यः": "others",
        "वैतेषु": "in these",
        "स्थानेषु": "places",
        "प्रत्याजायते": "they are born",
        "यथा": "according to",
        "कर्म": "actions",
        "विद्यम्": "knowledge",
        "आगतम्": "having come",
        "पृच्छति": "asks",
        "कः": "who",
        "असीति": "who are you",
        "प्रतिबूयात्": "(therefore) answer",
        "विचक्षणात्": "intelligently",
        "अतवः": "or",
        "रेतः": "semen",
        "आभृतम्": "having carried",
        "पञ्चदशात्": "up to the fiveteenth day (of the lunar month)",
        "प्रसूतात्": "born",
        "पितृयावतः": "like a father",
        "तत्": "that",
        "मा": "do not",
        "पुंसि": "in a man",
        "कर्तर्येयध्वम्": "be an object of action",
        "पुंसा": "by a man",
        "कर्त्रा": "by the doer",
        "मातरि": "in a mother",
        "निषिक्तः": "be born",
        "जायमानः": "about to be born",
        "उपजायमानः": "being born",
        "द्वादश": "twelve",
        "त्रयोदश": "thirteen",
        "उपमासः": "lunar months",
        "त्रयोदशेन": "by thirteen",
        "पित्रा": "by the father",
        "संतद्विदेहम्": "in the other's body",
        "म्": "me",
        "ॠतवः": "sacred seasons",
        "मर्त्यवः": "mortal beings",
        "आरभध्वम्": "pursue",
        "तेन": "by that",
        "सत्येन": "truth",
        "तपसा": "by austerity",
        "रस्या": "desire",
        "अस्मि": "I am",
        "असि": "you are",
        "त्वम्": "you are",
        "इति": "thus"
    },
    "meaning": "Translation:He said, \"Indeed, those who depart from this world are like the moon. All of them go. Their vital breaths lessen in the first half of the lunar month and increase in the second half. However, they do not procreate in the second half. The moon, who is the door of the heavenly realm, opposes them and banishes them. But when it rains here in opposition to the moon, beings are born in various places such as insects, moths, birds, tigers, lions, fish, snakes, humans, and others according to their actions and knowledge.When one who has come asks who are you, intelligently answer him. Do not be an object of action for a man, and do not be born in a mother. One who is about to be born, being born, and twelve or thirteen lunar months, let me (someone else) pursue immortality in the other's body by the father's choice. By that truth and desire for austerity, I have become the semen carried up to the fifteenth day, like a father. Who I am, who are you, and who am I? He banishes him.\"",
     "upanishad-org" : {
         "meaning": "महर्षि चित्र ने कहा- हे ब्रह्मन् ! जो भी कोई लोग अग्निहोत्रादि सत्कार्यों का अनुष्ठान करने वाले हैं, वे सभी जब इस लोक से प्रयाण करते हैं, तो वे चन्द्रलोक अर्थात् स्वर्ग लोक में गमन करते हैं। पूर्व पक्ष में (पुण्य शेष रहने तक) वे प्राणों द्वारा वहाँ के भोग पदार्थों का सेवन करते हैं। दूसरे पक्ष में (अर्थात् स्वर्ग प्राप्ति के निमित्त भूत पुण्यों के क्षीण होने पर) चन्द्र लोक प्राणियों को तृप्ति नहीं दे पाता।\nनिश्चय ही यह चन्द्रमा स्वर्ग लोक के द्वार के नाम से प्रसिद्ध है। जो अधिकारी (दैवी सम्पत्ति से युक्त होने के कारण) उस स्वर्ग रूप चन्द्रमा का प्रत्याख्यान कर देता है (अर्थात् जहाँ से फिर से नीचे गिरना पड़े, ऐसा स्वर्ग मुझे नहीं चाहिए। ऐसा कहते हुए चन्द्रलोक का परित्याग कर देता है।), उस पुरुष को उसका वह शुभ संकल्प चन्द्रलोक से भी ऊपर अविनाशी ब्रह्मलोक में प्रतिष्ठित करा देता है; लेकिन जो पुरुष स्वर्गीय सुख के प्रति ही आसक्त होने के कारण चन्द्रलोक को स्वीकार कर लेता है, उस कामनायुक्त स्वर्गवासी को उसके पुण्य भोग के समाप्त होने पर उसे सभी देव वर्षा के रूप में परिवर्तित करके उसी लोक में ही पुनः बरसा देते हैं। वर्षा के रूप में वह यहाँ आया हुआ कर्मफल का भोक्ता जीव स्वकृत पूर्व वासनानुसार कीट-पतंग या पक्षी, व्याघ्र, सिंह, मछली, साँप, बिच्छू, मनुष्य या अन्य कोई दूसरा जीव होकर अनुकूल शरीरों में स्वकर्म एवं विद्या (उपासना) के अनुसार ही यहाँ-वहाँ जन्म लेता है। इस प्रकार अपने पास में आए हुए शिष्य से दयालु एवं तत्त्वज्ञान धारण करने वाले गुरु को इस तरह से पूछना चाहिए-हे वत्स! तुम कौन हो? गुरु के इस तरह से पूछने पर शिष्य को इस तरह उत्तर देना चाहिए। हे देवताओ! जो पन्द्रह कलाओं से युक्त शुक्ल एवं कृष्ण पक्ष के कारणभूत श्रद्धा के माध्यम से प्रादुर्भुत, पितृलोक स्वरूप एवं विभिन्न प्रकार के भोगों को प्रदान करने में समर्थ हैं, उन चन्द्रमा के समीप से उत्पन्न होकर पुरुष रूप अग्नि में स्थापित हुआ, जो श्रद्धा, सोम, वृष्टि एवं अन्न का परिणामभूत वीर्य है, उस वीर्य के ही रूप में केन्द्रित हुए मुझ कर्मफल के भोक्ता जीव को तुमने वीर्याधान करने वाले पुरुष में प्रेरित किया। तदनन्तर गर्भाधान करने वाले पुरुष (पिता) के द्वारा तुमने मुझको माता के गर्भ में धारण करवाया। माता के गर्भ में द्वादश-त्रयोदश आर्षमास (२३ दिन का एक आर्षमास) तक रहकर जन्म लिया। इस कारण अब मुझे अमृतत्व की प्राप्ति के साथ साधनभूत ब्रह्मज्ञान हेतु अनेक ऋतुओं तक अक्षय रहने वाली दीर्घायु प्रदान करें। ब्रह्म के साक्षात्कार तक मेरे दीर्घ जीवन हेतु चिरस्थाई आयु की पुष्टि प्रदान करें, क्योंकि यह सब कुछ जानकर के मैं समस्त देवताओं से प्रार्थना करता हूँ। इसीलिए उसी सत्य से, उसी तप से, जिनका कि मैंने अभी उल्लेख किया है, मैं वही ऋतु हूँ अर्थात् संवत्सरादि रूप मरणधर्मा मनुष्य हूँ। आर्तव हूँ-ऋतु अर्थात् रज-वीर्य के माध्यम से प्रादुर्भूत हुआ शरीर हूँ\nऔर यदि ऐसी बात नहीं है, तो आप ही कृपा करके बतायें कि मैं कौन हूँ? उस (शिष्य) के इस तरह से कहने पर संसार के भय से भयभीत हुए शिष्य को गुरु ब्रह्मविद्या के उपदेश द्वारा भवसागर से पार करके बन्धनों से मुक्ति प्रदान कर देता है"
     }
}