{
    "verse_no": "१-४",
    "verse": "तं पञ्चशतान्यप्सरसां प्रतियन्ति शतं चूर्णहस्ताः शतं वासोहस्ताः शतं फलहस्ताः शतमाञ्जनहस्ताः शतं माल्यहस्तास्तं ब्रह्मालंकारेणालंकुर्वन्ति स ब्रह्मालंकारेणालंकृतो ब्रह्म विद्वान्ब्रह्माभिप्रैति स आगच्छत्यारं ह्नदं तं मनसाऽत्येति।\nतमित्वा संप्रतिविदो मज्जन्ति स\nआगच्छति मुहूर्तान्विहेष्टिहास्तेऽस्मादपद्रवन्ति स आगच्छति विरजां नदीं तां मनसैवात्येति। तत्सुकृतदुष्कृते धुनुते ।\nतस्य प्रिया ज्ञातयः सुकृतमुपयन्त्यप्रिया दुष्कृतं तद्यथा रथेन धावयन्नथचक्रे पर्यवेक्षत, एवमहोरात्रे पर्यवेक्षत एवं सुकृतदुष्कृते सर्वाणि च द्वंद्वानि स एष विसुकृतो विदुष्कृतो ब्रह्म विद्वान्ब्रह्मैवाभिप्रैति ॥",
    "terms": {
        "तं": "him",
        "पञ्चशतान्यप्सरसां": "five hundred heavenly nymphs",
        "प्रतियन्ति": "surround",
        "शतं": "a hundred",
        "चूर्णहस्ताः": "with powdered hands",
        "वासोहस्ताः": "with perfumed hands",
        "फलहस्ताः": "with fruit-bearing hands",
        "शतमाञ्जनहस्ताः": "with kohl-applying hands",
        "माल्यहस्तास्तं": "with garland-making hands",
        "ब्रह्मालंकारेण": "with divine ornaments",
        "आलंकुर्वन्ति": "they decorate",
        "स": "he",
        "आलंकृतो": "adorned",
        "ब्रह्म": "the Supreme Reality",
        "विद्वान्": "the knower",
        "ब्रह्माभिप्रैति": "attains Brahman",
        "आगच्छति": "approaches",
        "आरं": "the celestial river",
        "ह्नदं": "flowing",
        "मनसा": "mentally",
        "अत्येति": "he crosses",
        "तमित्वा": "having entered it",
        "संप्रति": "during that time",
        "विदो": "the knowers",
        "मज्जन्ति": "immerse themselves",
        "मुहूर्तान्विहेष्टिहास्ते": "his desired results",
        "अस्मादपद्रवन्ति": "speedily, swiftly",
        "विरजां": "the pure",
        "नदीं": "river",
        "तां": "it",
        "मनसैव": "by the mind alone",
        "तत्": "that",
        "सुकृतदुष्कृते": "good and bad deeds",
        "धुनुते": "washes away",
        "तस्य": "for him",
        "प्रिया": "beloved ones",
        "ज्ञातयः": "people who know",
        "सुकृतमुपयन्ति": "approach with good deeds",
        "अप्रिया": "unpleasant ones",
        "दुष्कृतं": "bad deeds",
        "तद्यथा": "as it were",
        "रथेन": "with a chariot",
        "धावयन्नथचक्रे": "runs with its wheels",
        "पर्यवेक्षत": "looks upon",
        "एवं": "in this way",
        "होरात्रे": "in a day and night",
        "सर्वाणि": "all",
        "च": "and",
        "द्वंद्वानि": "pairs of opposites",
        "एष": "this",
        "विसुकृतो": "purified of sin",
        "विदुष्कृतो": "devoid of sin",
        "ब्रह्मैवाभिप्रैति": "indeed attains Brahman"
    },
    "meaning": "",
    "upanishad-org" : {
         "meaning": "(ब्रह्माजी का आदेश प्राप्त होने पर उस पुरुष के सम्मान के लिए) पाँच सौ अप्सरायें जाती हैं। उनमें से सौ अप्सराएँ तो हाथों में (मंगल द्रव्य, केशर, हल्दी एवं रोली आदि के) चूर्ण लिए रहती हैं। अन्य सौ के हाथों में तरह-तरह के दिव्य वस्त्र तथा आभूषण आदि होते हैं। अन्य सौ अप्सराएँ अपने हाथों में फल लिए होती हैं, अन्य सौ के हाथों में विभिन्न तरह के दिव्य अङ्गराग होते हैं एवं सौ अप्सराएँ अपने हाथों में भाँति-भाँति की मालाएँ उसके सम्मानार्थ लिए होती हैं। वे सभी अप्सराएँ उस महान् आत्मा को ब्रह्मोचित अलंकारों से सुसज्जित करती हैं। वह ब्रह्मवेत्ता पुरुष ब्रह्माजी के योग्य आभूषणों को धारण करके ब्रह्माजी के स्वरूप को प्राप्त कर लेता है। तदनन्तर वह ‘अर’ नाम वाले सरोवर के समीप आकर उसे मन के द्वारा संकल्प मात्र से पार कर लेता है। उस जलाशय के समीप पहुँच कर अज्ञानी मनुष्य उसमें डूब जाते हैं। तत्पश्चात् यह ब्रह्मज्ञानी मुहूर्ताभिमानी ‘इष्टिहा’ नामक देवताओं के समीप में आता है; लेकिन वे विघ्नकारी देवता उसके पास से डरकर भाग जाते हैं। उसके बाद वह विरजा नदी के तट पर आ करके उस नदी को भी संकल्प मात्र से लाँघ जाता है। वहाँ पर वह ब्रह्मज्ञानी अपने समस्त पुण्य एवं पापों को त्याग देता है। जो उसके कुटुम्बी प्रियपरिजन आदि होते हैं, वे सभी लोग तो उसके पुण्य के भागीदार बनते हैं; किन्तु जो उस (दिव्यात्मा) से द्वेष करने वाले होते हैं, उन्हें उसके द्वारा त्यागे हुए पापों का भागीदार बनना पड़ता है। ( उस सन्दर्भ में यह दृष्टान्त इस प्रकार है)-रथ के द्वारा यात्रा करने वाला पुरुष दौड़ाते हुए रथ के दोनों चक्रों का भूमि से जो संयोग-वियोग होता है, वह उन चक्रों को देखते रहने पर भी आरोही को प्राप्त नहीं होता, वैसे ही वह ब्राह्मवेत्ता पुरुष रात एवं दिन को , पाप एवं पुण्य को तथा अन्य सभी तरह के द्वन्द्वो को देखता है, परन्तु द्रष्टा होने के कारण ही वह इनसे सम्बन्धरहित रहता है। इस कारण वह पुण्य एवं पाप से रहित होता है। अतः ब्रह्मज्ञान के कारण ही वह ब्रह्मवेत्ता ब्रह्म को प्राप्त हो जाता है"
     }
}