{
    "verse_no": "३-४",
    "verse": "स यदाऽस्माच्छरीरादुत्क्रामति सहैवैतैः सर्वैरुत्क्रामति वागस्मात्सर्वाणि नामान्यभिवि सृजते ।\nवाचा सर्वाणि नामान्याप्नोति प्राणोऽस्मात्सर्वान्गन्धानभिविसृजते प्राणेन सर्वान्गन्धानाप्नोति चक्षुरस्मात्सर्वाणि रूपाण्यभिविसृजते चक्षुषा सर्वाणि रूपाण्याप्नोति श्रोत्रमस्मात्सर्वाञ्श-ब्दानभिविसृजते श्रोत्रेण सर्वाञ्शब्दानाप्नोति मनोऽस्मात्सर्वाणि ध्यानान्यभिविसृजते मनसा सर्वाणि ध्यानान्याप्नोति सैषा प्राणे सर्वाप्तिः।\nयो वै प्राणः सा प्रज्ञा या वा प्रज्ञा से प्राणः सह ह्येतावस्मिञ्शरीरे वसतः सहोक्रामतः।\nअथ खलु यथाऽस्यै प्रज्ञायै सर्वाणि भूतान्येकं भवन्ति तद्व्याख्यास्यामः॥",
    "terms": {
        "सः": "He",
        "यदा": "when",
        "अस्मात्": "from this",
        "शरीरात्": "body",
        "उत्क्रामति": "departs",
        "सह": "together",
        "एतैः": "these",
        "सर्वैः": "all",
        "वागास्मात्": "from speech",
        "सर्वाणि": "all",
        "नामानि": "names",
        "अभिविसृजते": "creates",
        "वाचा": "through speech",
        "आप्नोति": "obtains",
        "प्राणः": "life force",
        "अंगानि": "limbs",
        "प्राणेन": "with life force",
        "चक्षुः": "eyes",
        "रूपाणि": "forms",
        "चक्षुषा": "through eyes",
        "श्रोत्रम्": "ears",
        "शब्दानि": "sounds",
        "श्रोत्रेण": "through ears",
        "मनः": "mind",
        "ध्यानानि": "thoughts",
        "मनसा": "through mind",
        "सा": "that",
        "प्राणे": "in life force",
        "सर्वाप्तिः": "complete fulfillment",
        "यः": "who",
        "वै": "indeed",
        "प्रज्ञा": "consciousness",
        "या": "which",
        "वा": "or",
        "से": "from",
        "हि": "indeed",
        "एतावत्स्मिन्": "in this extent",
        "शरीरे": "body",
        "वसतः": "residing",
        "उक्रामतः": "departs",
        "अथ": "now",
        "खलु": "now",
        "यथा": "how",
        "अस्यै": "in this",
        "प्रज्ञायै": "consciousness",
        "भूतानि": "beings",
        "एकं": "one",
        "भवन्ति": "become",
        "तत्": "that",
        "व्याख्यास्यामः": "we shall explain"
    },
    "meaning": "",
    "upanishad-org": {
        "meaning": "शरीर से उन्मुक्त होने वाला वह प्राण जब उत्क्रमण करता है, तब उस समय वह इन सभी इन्द्रियों के सहित ही उत्क्रमण करता है। उस समय वाक्-इन्द्रिय इस पुरुष के सभी नामों का परित्याग कर देती है; क्योंकि वागिन्द्रिय से ही मनुष्य नामों को ग्रहण कर पाता है। (ऐसा ही तथ्य सभी इन्द्रियों के विषय में है।) प्राण (घ्न्नाणेन्द्रिय) सभी गंधों का त्याग कर देती है, चक्षु सभी रूपों को त्याग देता है, कर्णेन्द्रिय सभी तरह के शब्दों का परित्याग कर देती है और मन ध्यानस्थ विषयों का परित्याग कर देता है। इसी प्राणरूप आत्मा में समस्त इन्द्रियाँ समर्पित होकर अपने-अपने विषयों का पूर्ण रूप से परित्याग कर देती हैं। प्राण ही प्रज्ञा है और प्रज्ञा ही प्राण है अथवा जो प्रज्ञा है, वहीं प्राण है: क्योंकि ये दोनों इस शरीर में एक साथ ही निवास करते हैं और एक साथ ही इस शरीर से उत्क्रमण करते हैं। अब जिस तरह से समस्त भूत-प्राणी इस प्रज्ञा में एक रूप हो जाते हैं, इसकी (अगले मंत्र में) स्पष्ट शब्दों में व्याख्या करेंगे"
    }
}