{
  "verse_no": "३-७",
  "verse": "न हि प्रज्ञापेता वा नाम किंचन प्रज्ञापयेत् ।\nअन्यत्र में मनोऽभूदित्याह। नाहमेतन्नाम प्रज्ञासिषमिति।\nन हि प्रज्ञापेतः प्राणो गन्धं कंचन प्रज्ञापयेदन्यत्र\nमें मनोऽभूदित्याह नाहमेतं गन्धं प्राङ्गासिषमिति । न हि प्रज्ञापेतं चक्षु रूपं किंचन प्रज्ञापयेदन्यत्र मे मनोऽभूदित्याह।\nनाहमेतद्रूपं प्रज्ञासिषमिति न प्रज्ञापेतं श्रोत्रं शब्दं कंचन प्रज्ञापयेदन्यत्र में मनोऽभूदित्याह।\nनाहमेतं शब्दं\nप्रज्ञासिषमिति नहि प्रज्ञापेता जिह्वाऽन्नरसं कंचन प्रज्ञापयेदन्यत्र मे मनोऽभूदित्याह।\nनाहमेतमन्नरसं प्राज्ञासिषमिति न प्रज्ञापेतौ हस्तौ कर्म किंचन प्रज्ञापयेतामन्यत्र मे मनोऽभूदित्याह नाहमेतत्कर्म प्राज्ञाससिषमिति न हि प्रज्ञापेतं शरीरं सुखं दुःखं किंचन प्रज्ञापयेदन्यत्र मे मनोऽभूदित्याह नाहमेतत्सुखं दु:खं प्रज्ञासिषमिति न हि प्रज्ञापेत उपस्थ आनन्दं रतिं प्रजाति कांचन प्रज्ञापयेदन्यत्र मे मनोऽभूदित्याह ।\nनाहमेतमानन्दं न रतिं न प्रजातिं प्राङ्गासिषमिति न हि प्रज्ञापेतौ पादावित्यां कांचन प्रज्ञापयेतामन्यत्र मे मनोऽभूदित्याह।\nनाहमेतामित्यां प्राज्ञासिषमिति।\nन हि प्रज्ञापेता धी: काचन सिध्येन्न प्रज्ञातव्यं प्रज्ञायेत ॥",
  "terms": {
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेता": "absence of knowledge",
    "वा": "",
    "नाम": "name",
    "किंचन": "anything",
    "प्रज्ञापयेत्": "",
    "अन्यत्र": "elsewhere",
    "में": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतन्": "",
    "नाम": "",
    "प्रज्ञासिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेतः": "absence of knowledge",
    "प्राणो": "",
    "गन्धं": "",
    "कंचन": "anything",
    "प्रज्ञापयेदन्यत्र": "",
    "में": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतं": "",
    "गन्धं": "",
    "प्राङ्गासिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेतं": "absence of knowledge",
    "चक्षु": "",
    "रूपं": "",
    "किंचन": "anything",
    "प्रज्ञापयेदन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह।": "",
    "नाहमेतद्": "",
    "रूपं": "",
    "प्रज्ञासिषमिति": "",
    "न": "not",
    "प्रज्ञापेतं": "absence of knowledge",
    "श्रोत्रं": "",
    "शब्दं": "",
    "कंचन": "",
    "प्रज्ञापयेदन्यत्र": "",
    "में": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतं": "",
    "शब्दं": "",
    "प्रज्ञासिषमिति": "",
    "नहि": "",
    "प्रज्ञापेता": "absence of knowledge",
    "जिह्वाऽन्नरसं": "",
    "कंचन": "",
    "प्रज्ञापयेदन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतमन्नरसं": "",
    "प्राज्ञासिषमिति": "",
    "न": "not",
    "प्रज्ञापेतौ": "absence of knowledge",
    "हस्तौ": "",
    "कर्म": "",
    "किंचन": "anything",
    "प्रज्ञापयेतामन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतत्": "",
    "कर्म": "",
    "प्राज्ञाससिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेतं": "absence of knowledge",
    "शरीरं": "",
    "सुखं": "",
    "दुःखं": "",
    "किंचन": "anything",
    "प्रज्ञापयेदन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतत्": "",
    "सुखं": "",
    "दु:खं": "",
    "प्रज्ञासिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेत": "absence of knowledge",
    "उपस्थ": "",
    "आनन्दं": "",
    "रतिं": "",
    "प्रजाति": "",
    "कांचन": "",
    "प्रज्ञापयेदन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेतमानन्दं": "",
    "न": "not",
    "रतिं": "",
    "न": "not",
    "प्रजातिं": "",
    "प्राङ्गासिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेतौ": "absence of knowledge",
    "पादावित्यां": "",
    "कांचन": "",
    "प्रज्ञापयेतामन्यत्र": "",
    "मे": "",
    "मनोऽभूदित्याह": "mind not present gone elsewhere",
    "नाहमेत": "",
    "ामित्यां": "",
    "प्राज्ञासिषमिति": "",
    "न": "not",
    "हि": "indeed",
    "प्रज्ञापेता": "absence of knowledge",
    "धी:": "",
    "काचन": "",
    "सिध्येन्न": "",
    "प्रज्ञातव्यं": "",
    "प्रज्ञायेत": ""
  },
  "meaning": "",
  "upanishad-org": {
    "meaning": "प्रज्ञा के अभाव में वाणी किसी भी नाम का ज्ञान नहीं करा सकती; क्योंकि ऐसी अवस्था में व्यक्ति इस तरह कहता है कि मेरा मन अमुक ओर था, अतः मैं इस नाम को नहीं जान सका। प्रज्ञा से हीन होने पर प्राण (घ्राणेन्द्रिय) भी किसी गन्ध का बोध नहीं करा सकता। ऐसी स्थिति में व्यक्ति इस प्रकार कहता है कि मेरा मन दूसरी जगह चला गया था, इस कारण से मैं इस घ्रणेन्द्रिय की गन्ध को जानने में असमर्थ रहा, ऐसे ही प्रज्ञा से रहित होने पर चक्षु-इन्द्रिय भी किसी भी तरह के रूप का ज्ञान नहीं करा सकती। ऐसी दशा में व्यक्ति ऐसा कहता है कि ‘मेरा मन उस समय अन्यत्र था, अतः मैं इसके उस रूप को नहीं जान सका।’ प्रज्ञा से अलग रहकर कर्णेन्द्रिय भी किसी तरह के शब्द का बोध नहीं करा सकती। ऐसी दशा में व्यक्ति यह कहता है कि मेरा मन उस समय अन्यत्र गमन कर रहा था, इस कारण से मैं इन शब्दों को नहीं जान सका। प्रज्ञा से रहित होने पर जिह्वा किसी भी अन्न के रस का अनुभव नहीं कर सकती। ऐसी स्थति में व्यक्ति, ‘यह कहता है कि मेरा मन अन्यत्र चला गया था', अतः मैं अन्न के रस की अनुभूति नहीं कर पाया।’ प्रज्ञा से रहित होते हुए हाथ किसी भी तरह के कर्म का बोध नहीं करा सकते। ऐसी दशा में मानव यह कहता है कि उस समय मेरा मन अन्यत्र गमन कर गया था। इसलिए मैं इस अमुक कार्य को नहीं समझ सका। प्रज्ञा से अलग रहते हुए शरीर भी किसी तरह के सुख-दुःख की अनुभूति नहीं करा सकता। ऐसी स्थिति में मनुष्य कहता है कि ‘मेरा मन अन्यत्र गमन कर गया था।’ अतः मैं इस शरीर के सुख-दुःखों को नहीं समझ सका। प्रज्ञा से रहित होकर उपस्थ भी किसी तरह के आनन्द, रति एवं प्रजा को उत्पत्ति का ज्ञान नहीं करा सकता है। उस स्थिति में व्यक्ति कहता है कि ‘मेरा मन उस समय अन्यत्र था, इस कारण से मैं उस आनन्द, रति एवं प्रजा के उत्पत्ति की जानकारी नहीं पा सका। प्रज्ञा से अलग रहकर दोनों पैर भी किसी तरह की गमन क्रिया का ज्ञान नहीं करा सकते, उस स्थिति में व्यक्ति यह कहता है कि ‘मेरा मन उस समय अन्य किसी स्थान की ओर चला गया था, इस कारण मैं इस आवागमन की क्रिया का अनुभव नहीं कर सका। प्रज्ञा के अभाव में कोई भी बौद्धिक-वृत्ति नहीं सिद्ध हो सकती है, उस बुद्धि वृत्ति के द्वारा ज्ञात वस्तु के ज्ञान का एहसास नहीं हो सकता"
  }
}