{
    "verse_no": "३-८",
    "verse": "नवाचं विजिज्ञासीत वक्तारं विद्यान्न गन्धं विजिज्ञासीत घ्रातारं विद्यान्न रूपं विजिज्ञासीत रूपविद्यं विद्यान्न शब्दं विजिज्ञासीत श्रोतारं विद्यान्नान्नरसं विजिज्ञासीतान्नरसस्य विज्ञातार विद्यान्न कर्म विजिज्ञासीत कर्तारं विद्यान्न सुखदुःखे विजिज्ञासीत सुखदुःखयोर्विज्ञातार विद्यान्नानन्दं न रतिं न प्रजातिं विजिज्ञासीतानन्दस्य रतेः प्रजातेर्विज्ञातारं विद्यात्रेत्यां विजिज्ञासीतैतारं विद्यात्।\nन मनो विजिज्ञासीत मन्तारं विद्यात् ।\nता वा एता दशैव भूतमात्रा अधिप्रज्ञं दश प्रज्ञामात्रा अधिभूतं यद्धि भूतमात्रा न स्युर्न प्रज्ञामात्राः स्युर्यद्वा प्रज्ञामात्रा न स्युर्न भूतमात्राः स्युः ॥",
    "terms": {
        "न": "not",
        "वचं": "speech",
        "विजिज्ञासीत": "should seek to know, should desire to understand",
        "वक्तारं": "speaker",
        "विद्यात्": "should know, should understand",
        "गन्धं": "smell, fragrance",
        "घ्रातारं": "taster, one who tastes",
        "रूपं": "form, appearance",
        "रूपविद्यं": "knowledge of forms",
        "शब्दं": "sound, word",
        "श्रोतारं": "hearer, listener",
        "आन्नरसं": "taste of food",
        "आन्नरसस्य": "of the taste of food",
        "विज्ञातार": "knower, one who knows",
        "विद्यात्रेत्यां": "knowledge of actions",
        "मनो": "mind",
        "मन्तारं": "thinker, one who thinks",
        "एता": "these",
        "वा": "or",
        "दश": "ten",
        "एव": "indeed",
        "भूतमात्रा": "objects of perception",
        "अधिप्रज्ञं": "beyond the perceiving subject",
        "प्रज्ञामात्रा": "objects of consciousness",
        "अधिभूतं": "beyond the conscious subject",
        "यथ्धि": "indeed, certainly",
        "न स्युः": "are not",
        "न प्रज्ञामात्राः": "nor are the objects of consciousness",
        "स्युः": "are they",
        "यत्वा": "or",
        "न भूतमात्राः": "nor are the objects of perception"
    },
    "upanishad-org" : {
        "meaning" : "वाक् शक्ति को जानने की इच्छा नहीं करनी चाहिए; वरन् वाणी को प्रेरित करने वाले आत्मा को जानना चाहिए। गन्ध को जानने का प्रयास नहीं करना चाहिए, बल्कि गन्ध को ग्रहण करने वाले आत्मा को जानना चाहिए: रूप को जानने की इच्छा नहीं करनी चाहिए, रूप के ज्ञाता साक्षी स्वरूप आत्मा को जानना चाहिए; शब्द को जानने की इच्छा नहीं करनी चाहिए, शब्द श्रवण करने वाले आत्मा को जानने की इच्छा रखनी चाहिए। अत्र रस के ज्ञान को कामना व्यर्थ है, अन्न-रस के ज्ञाता आत्मा को जानना चाहिए। कर्म को जानने की इच्छा नहीं रखनी चाहिए, कर्म-कर्तारूप आत्मा को आनना चाहिए। सुख-दु:ख आदि के जानने की इच्छा नहीं करनी चाहिए, सुख-दुःख के विशेषज्ञ साक्षी रूप आत्मा को जानना चाहिए। आनन्द, रति एवं प्रजनन सामयं के जानने की इच्छा नहीं करनी चाहिए; वरन् आनन्द, रति एवं प्रजनन सामर्थ्य के जानकार (आत्मतत्त्व) को समझना चाहिए; विचरण की क्रिया को समझने की इच्छा नहीं करनी चाहिए, विचरण करने वाले साक्षी स्वरूप आत्मा को हो जानने का प्रयास करना चाहिए। इसी तरह मन को भी जानने की अभिलाषा नहीं रखनी चाहिए; बल्कि मनन करने वाले आत्मा को ही जानना चाहिए। इस प्रकार से दस ही भूत मात्राएँ अर्थात् जाम आदि विषय हैं; जो प्रज्ञा में विद्यमान हैं एवं प्रज्ञा की भी दस मात्राएँ (वाणी आदि इन्द्रिय रूप) हैं, जो कि समस्त प्राणियों में विद्यमान हैं। यदि ये प्रख्यात समस्त भूत मात्राएँ न हों, तो प्रज्ञा की मात्राएँ भी स्थित नहीं रह सकती और यदि प्रज्ञा की मात्राएँ न हों, तो भूत मात्राएँ भी स्थित नहीं है सकती"
    },
    "wikipedia": {
        "meaning": "One should not desire to understand the speech but should desire to know him who speaks,\nOne should not desire to understand the smell (described by a person) but should desire to know him who smells,\nOne should not desire to understand the form (of the person) but should desire to know him who sees the form,\nOne should not desire to understand the sound (described) but should desire to know him who hears,\nOne should not desire to understand the food (description) but should desire to know him who tastes,\nOne should not desire to understand the deed but should desire to know him who performs the deed,\nOne should not desire to understand pleasure and pain from excitation but should desire to know him who feels the pleasure and pain,\nOne should not desire to understand the opinion and thinking but should desire to know him who opines and thinks.\nBecause if there were no elements of consciousness, there would be no elements of material being\nBecause if there were no elements of material being, there would be no elements of consciousness\nBecause any one phenomenon does not come about through the one without the other,\nBecause Prana (life-force) is also the Prajnatman (knowledge-self), is bliss, is not ageing, is immortal\nThis is my Atman (Self) which one should know, O! this is my Atman which one should know"
    },
    "meaning-gpt": "One should not seek to know speech, should know the speaker; should not seek to know smell, should know the taster; should not seek to know form, should know the knower of forms; should not seek to know sound, should know the listener; should not seek to know taste of food, should know the taster; should not seek to know the actions, should know the doer of actions; should not seek to know materialistic joy and sorrow, should know the experiencer of joy and sorrow. One should not seek to know materialistic joy, bliss, or progeny, should know the experiencer of bliss. Thus, one should seek to know these. One should not seek to know the mind, should know the thinker. These ten are beyond the objects of perception and consciousness. Objects of perception are not the same as the perceiver, nor are the objects of consciousness the same as the conscious subject. Neither are the objects of consciousness the same as the objects of perception."
}