{
    "verse_no": "३-९",
    "verse": "न ह्यन्यतरतो रूपं किंचन सिध्येत् ।\nनो एतन्नना, तद्यथा रथस्यारेषु नेमिरर्पितो नाभावरा अर्पिता एवमेवैता भूतमात्राः प्रज्ञामात्रास्वर्पिताः प्रज्ञामात्राः प्राणेऽर्पिताः स एष प्राण एवं प्रज्ञात्मानन्दोऽजरोऽमृतः ।\nन साधुना कर्मणा भूयान्नो एवासाधुना कनीयान्।\nएष ह्येवैनं साधु कर्म कारयति तं यमेभ्यो लोकेभ्य उन्निनीषत एवं उ एवैनमसाधु कर्म कारयति तं यमधो निनीषते ।\nएष लोकपाल एष लोकाधिपतिरेष सर्वेशः स म आत्मेति विद्यात्स म आत्मेति विद्यात् ॥",
    "terms": {
        "न (na)": "not",
        "हि (hi)": "indeed",
        "अन्यतरतः (anyataratah)": "than any other",
        "रूपम् (rupam)": "form",
        "किंचन (kimcana)": "anything",
        "सिध्येत् (sidhyet)": "can be accomplished",
        "नो (no)": "not",
        "एतत् (etat)": "this",
        "अना (ana)": "not?",
        "तद् (tad)": "it",
        "यथा (yatha)": "like",
        "रथस्य (rathasya)": "of a chariot",
        "अरेषु (aresu)": "in the spokes",
        "नेमिः (nemi)": "the hub",
        "अर्पितः (arpitah)": "placed",
        "अभावरा (abhavara)": "without spokes",
        "अर्पिता (arpita)": "placed",
        "एव (eva)": "indeed",
        "मेता (meta)": "only this",
        "भूतमात्राः (bhutamatrah)": "consisting of material elements",
        "प्रज्ञामात्राः (prajnamatrah)": "consisting of consciousness",
        "स्वर्पिताः (svarpitah)": "placed",
        "प्राणेऽर्पिताः (pranearpitah)": "placed in the pranas (life-force)",
        "स (sa)": "he",
        "एष (esha)": "this",
        "प्राणः (pranah)": "prana",
        "एवम् (evam)": "in this way",
        "प्रज्ञात्मानन्दः (prajnatmananda)": "bliss of self-awareness",
        "अजरः (ajarah)": "without old age",
        "अमृतः (amritah)": "immortal",
        "साधुना (sadhu na)": "by a righteous person",
        "कर्मणा (karma na)": "through action",
        "भूयान् (bhuyan)": "greater",
        "असाधुना (asadhuna)": "by an unrighteous person",
        "कनीयान् (kaniyan)": "lesser",
        "एवैनं (evainam)": "this",
        "साधु (sadhu)": "righteous",
        "कर्म (karma)": "action",
        "कारयति (karayati)": "accomplishes",
        "तं (tam)": "him",
        "यमेभ्यः (yamebhyah)": "by the immortals",
        "लोकेभ्यः (lokebhyah)": "by the people",
        "उन्निनीषते (unninisate)": "he is praised/noised abroad",
        "लोकपालः (lokapalah)": "guardian of the world(s)",
        "लोकाधिपतिः (lokadhipatih)": "ruler of the world(s)",
        "सर्वेशः (sarvesha)": "lord of all",
        "म (ma)": "not",
        "आत्मेति (atmeti)": "understood as the Self",
        "विद्यात् (vidyat)": "knows"
    },
    "meaning-Kalātattvakośa": "For, truly, if there were no elements of existence, there would be no elements of intelligence. Verily, if there were no elements of intelligence, there would be no elements of existence. For from either alone no form whatsoever would be possible. And this (the self of intelligence) is not many. For as in a chariot the felly is fixed on the spokes and the spokes are fixed on the hub, even so these elements of existence are fixed in the elements of intelligence and the elements of intelligence are fixed in the breathing spirit. This same breathing spirit is, truly, the intelligent self, bliss, ageless, immortal.",
    "meaning": "Indeed, no other form can accomplish anything, just as the hub of a chariot cannot be placed without the spokes. In the same way, only the material elements are placed in the consciousness and the prana is placed in the consciousness alone. This prana is the bliss of self awareness, immortal and without old age. Righteous action is not greater than that of a righteous person, nor lesser than that of an unrighteous person. Indeed, this righteous action accomplishes him, and he is praised by the immortals and renowned among the people. He is the guardian and ruler of the world(s), the lord of all, yet he is not known as the Self.",
     "upanishad-org" : {
         "meaning": "इन दोनों में से किसी भी एक के माध्यम से किसी भी रूप. विषय अथवा इन्द्रिय की सिद्धि नहीं हो सकती है। प्रज्ञा मात्रा और भूतमात्रा के स्वरूप में कोई भेद नहीं है। उसे इस तरह से जानना चाहिए, जिस प्रकार रथ की नेमि अरों में और अरे रथ को नाभि के आश्रित रहते हैं; उसी प्रकार ही ये समस्त भूत मात्राएँ प्रज्ञा मात्राओं में विद्यमान हैं एवं प्रज्ञा मात्राएँ प्राण में स्थित हैं। यह प्राण ही प्रज्ञात्या, आनन्दस्वरूप, अजर-अमर है। यह न तो अच्छे कर्म से वृद्धि को प्राप्त होता है और न ही बुरे कर्म से छोटा होता है। यह प्राण एवं प्रज्ञा रुप चैतन्य युक्त परब्रह्म ही इस देहाभिमानी पुरुष से श्रेष्ठ कार्य करवाता है। वह ऐसे श्रेष्ठ कृत्य उसी से करवाता है, जिसे वह इन प्रत्यक्ष लोकों से ऊर्ध्व की तरफ ले जाना चाहता है और जिसे वह इन श्रेष्ठ लोकों । की अपेक्षा नीचे ले जाना चाहता है, उससे अशुभ कार्य करवाता है। यह आत्मा समस्त लोकों का अधिपति है एवं यही सभी का स्वामी है। इन सभी श्रेष्ठ गुणों से युक्त वह प्राण ही आत्मा है, ऐसा जानना चाहिए। वह प्राण ही हमारा आत्मा है, ऐसा जानना चाहिए। वह प्राण ही हमारा आत्मा है, ऐसा ही जानना चाहिए ॥"
     }
}