{
    "verse_no": "४-१९",
    "verse": "तं होवाचाजातशत्रुर्यत्रैष एतत्वालाके पुरुषोऽशयिष्ट यत्रैतदभूद्यत एतदागादिति ।\nहिता नाम हृदयस्य नाड्यो हृदयात्पुरीततमभिप्रतन्वन्ति तद्यथा सहस्त्रधा केशो विपाटितस्तावदण्व्यः पिङ्गलस्याणिम्ना तिष्ठन्ति। शुक्लस्य कृष्णस्य पीतस्य लोहितस्येति तासु तदा भवति ।\nयदा सुप्तः स्वप्नं न कंचन पश्यत्यस्मिन्प्राण एवैकधा भवति तदैनं वाक्सर्वैर्नामभिः सहाप्येति चक्षुः सर्वै रूपैः सहाप्येति श्रोत्रं सर्वैः शब्दैः सहाप्येति मनः सर्वैर्ध्यानैः सहाप्येति स यदा प्रतिबुध्यते यथाऽग्नेर्वलतः सर्वा दिशो विस्फुलिङ्गा विप्रतिष्ठेरनैवमेवैतस्मादात्मनः प्राणा यथायतनं विप्रतिष्ठन्ते प्राणेभ्यो देवा देवेभ्यो लोकाः तद्यथा क्षुरः क्षुरधानेऽवहितः स्यात्।\nविश्वंभरो वा विश्वंभरकुलाय एवमेवैष प्रज्ञ आत्मेदं शरीरमात्मानमनुप्रविष्ट आलोमध्य आनखेभ्यः ",
    "terms": {
        "तं": "him",
        "होवाच": "spoke",
        "आजातशत्रुः": "born enemy",
        "यत्र": "where",
        "एषः": "this",
        "एतत्": "this",
        "आलाके": "in the body",
        "पुरुषः": "person",
        "अशयिष्टः": "desires",
        "अभूत्": "became",
        "यत्": "that",
        "आगात्": "came",
        "Meaning: He spoke to his born enemy": "where did this person desire this which has come into this body?",
        "हिताः": "veins",
        "नाम": "name",
        "हृदयस्य": "of the heart",
        "नाड्यः": "arteries",
        "हृदयात्": "from the heart",
        "पुरीत": "तमाः - leading heartwards",
        "अभिप्रतन्वन्ति": "flow",
        "तद्": "that",
        "यथा": "just as",
        "सहस्त्रधा": "in thousand ways",
        "केशः": "hair",
        "विपाटितः": "scattered",
        "तावत्": "अण् - even so",
        "व्यः": "numerous",
        "पिङ्गलस्य": "of Pingala",
        "अणिम्ना": "in the lowest part",
        "तिष्ठन्ति": "stay",
        "शुक्लस्य": "of the bright one",
        "कृष्णस्य": "of the dark one",
        "पीतस्य": "of the yellow one",
        "लोहितस्य": "of the red one",
        "इति": "thus",
        "तासु": "in them",
        "तदा": "then",
        "भवति": "becomes",
        "यदा": "when",
        "सुप्तः": "asleep",
        "स्वप्नं": "dream",
        "न": "not",
        "कंचन": "anything",
        "पश्यति": "sees",
        "अस्मिन्": "in this",
        "प्राणः": "prana",
        "एव": "indeed",
        "एकधा": "in one way",
        "एनं": "this",
        "वाक्": "speech",
        "सर्वैः": "with all",
        "नामभिः": "names",
        "सहाप्येति": "think",
        "चक्षुः": "eyes",
        "रूपैः": "forms",
        "श्रोत्रं": "ears",
        "शब्दैः": "sounds",
        "मनः": "mind",
        "ध्यानैः": "thoughts",
        "सः": "he",
        "प्रतिबुध्यते": "wakes up",
        "अग्नेः": "of fire",
        "वलतः": "sparks",
        "सर्वा": "all",
        "दिशः": "directions",
        "विस्फुलिङ्गाः": "bursting forth",
        "विप्रतिष्ठे": "without ceasing",
        "अनैवम्": "in this way",
        "एतस्मात्": "From this",
        "आत्मनः": "from the self",
        "प्राणाः": "breaths",
        "यथायतनं": "in their proper places",
        "विप्रतिष्ठन्ते": "stay",
        "प्राणेभ्यः": "from the breaths",
        "देवाः": "gods",
        "देवेभ्यः": "from the gods",
        "लोकाः": "worlds",
        "तद्यथा": "just as",
        "क्षुरः": "the razor",
        "क्षुरधानेऽवहितः": "without any defect",
        "Meaning: When a person is asleep and does not see anything in the dream, then the breath alone stays in one way. Then, during that time, the speech connects with all names, the eyes perceive all forms, the ears hear all sounds, and the mind thinks all thoughts. When he wakes up, just as sparks burst forth in all directions from fire without ceasing, in the same way, from the self, the breaths stay in their proper places. From the breaths, the gods stay in the Gods and the worlds, just as the razor stays defect": "free in the sheath.",
        "विश्वंभरः": "universal support",
        "वा": "or",
        "विश्वंभरकुलाय": "to the lineage of the universal support",
        "एवमेव": "in this manner",
        "प्रज्ञः": "consciousness",
        "आत्मेदं": "dwelling in the self",
        "शरीरम्": "body",
        "आत्मानम्": "the self",
        "अनुप्रविष्टः": "entered",
        "आलोमध्ये": "in the middle of the hairs"
    },
    "meaning": "Meaning: The veins, named as Hita, which flow from the heart towards the body, are like hair scattered in a thousand ways, just as the numerous small veins stay in the lowest part of the Pingala.Meaning: In them (the veins), there is then a change as like the bright, the dark, the yellow and the red.Meaning: Or, in the lineage of the universal support, in this manner, this consciousness, dwelling in the self, entered the body, in the middle of the hairs.",
     "upanishad-org" : {
         "meaning": "गार्ग्य इस रहस्य को न समझ पाये, तब पुनः उनसे राजा अजातशत्रु ने कहा-‘ हे बलाका-तनय ! यह पुरुष इस तरह से अचेत-सा होकर जहाँ सोता था, जहाँ शयन करता था और इस जाग्रत्-अवस्था में इसका जहाँ से आगमन हुआ है, वह स्थान इस प्रकार से जाना जाता है। ‘हिता’ नाम से प्रसिद्ध बहुत-सी नाड़ियाँ हैं, जो कि हदय-कमल से सम्बन्ध रखने वाली हैं। वे (नाड़ियाँ) हृदय-- कमल से निकलकर सम्पूर्ण शरीर में विस्तृत होकर फैली हुई हैं। इन नाड़ियों का परिमाण इस तरह से है-एक बाल के हजारवें भाग के बराबर ही सूक्ष्मातिसूक्ष्म वे सभी नाड़ियाँ हैं। पिङ्गल अर्थात् विभिन्न तरह के रंगों का जो अति सूक्ष्मतम रस है, इससे वे पूर्ण है। शुक्ल, कृष्ण, पोत एवं रक्त आदि इन सभी रंगों के सूक्ष्मातिसूक्ष्म अंशों से ये सम्पन्न हैं। उन्हीं समस्त नाड़ियों में यह पुरुष सुषुप्तावस्था के समय विद्यमान रहता है।\nजिस समय यह सोया हुआ पुरुष किसी भी तरह का स्वप्न नहीं देखता, तब उस समय यह इस मुख्य प्राण तत्व में ही एकात्मभाव को प्राप्त कर लेता है। उस समय वाणी अपने समस्त नामों सहित इस प्राणतत्त्व में विलीन हो जाती है। चक्षु भी अपने सभी रूपों के साथ इस प्राण में ही मिल जाता है । कर्णेन्द्रिय अपने सभी शब्दों के साथ इस प्राण में विलीन हो जाती है और मन भी सभी चिन्तनयुक्त विषयों के सहित इस प्राण-तत्त्व में विलीन हो जाता है। यह पुरुष जब जाग जाता है, तब उस समय जैसे जलती हुई अग्नि से सभी दिशाओं की तरफ चिनगारियाँ प्रस्फुटित होती हैं, वैसे ही इस प्राण स्वरूप आत्मा से सभी वाणी आदि प्राणतत्त्व बहिर्गमन\nका अपने-अपने भोग्य-स्थल की तरफ गमन कर जाते हैं। तत्पश्चात् प्राणों से उनके अधिष्ठाता अग्नि आदि | देवों का प्रादुर्भाव होता है एवं साथ ही देवताओं से लोक अर्थात् नाम आदि विषयों का प्राकट्य होता है। उस श्रेष्ठ आत्मा की प्राप्ति का उदाहरण इस तरह से है-जैसे क्षुरधान (अर्थात् छुरा रखने हेतु निर्मित की हुयी चर्मयुक्त पेटी) में छुरा रखा रहता है, वैसे ही शरीर के अन्दर हृदय-कमल में अङ्गुष्ठ- मात्र पुरुष के रूप में परमात्म सत्ता को स्थिति होती है एवं जिस तरह अग्नि अपने नीड- भूत अरणी आदि काष्ट में सभी जगह फैली रहती है, उसी प्रकार यह प्रज्ञावान् आत्मा इस ‘आत्मा’ नाम से सम्बोधित किये जाने वाले शरीर में नख से शिखा तक व्याप्त है "
     }
}