```json
{
  "ना": "nā",
  "meaning": "not",
  "अजेषु": "ajeṣu",
  "meaning": "in the unborn",
  "सर्वधर्मेषु": "sarva-dharmeṣu",
  "meaning": "in all qualities",
  "शाश्वताशाश्वता": "śāśvatāśāśvatā",
  "meaning": "eternal-non-eternal",
  "अभिधा": "abhidhā",
  "meaning": "designation",
  "यत्र": "yatra",
  "meaning": "where",
  "वर्णाः": "varṇāḥ",
  "meaning": "categories",
  "न": "na",
  "meaning": "not",
  "वर्तन्ते": "vartante",
  "meaning": "exist",
  "विवेकः": "vivekaḥ",
  "meaning": "discrimination",
  "तत्र": "tatra",
  "meaning": "there",
  "नोच्यते": "nocyate",
  "meaning": "is not spoken"
}
```

**Overall meaning:**

Not in the unborn, in all qualities, is the designation of eternal-non-eternal. Where categories do not exist, there discrimination is not spoken.

**Explanation:**

This verse from the *Brihadaranyaka Upanishad* (2.4.14) emphasizes the transcendence of the ultimate reality beyond our usual understanding of categories, duality, and labels.

The verse states that the concepts of "eternal" and "non-eternal" (śāśvatāśāśvatā) do not apply to the "unborn" (ajeṣu). This implies that the ultimate reality is beyond the limitations of time and change. It is not subject to birth, decay, or destruction.

Furthermore, the verse emphasizes that in the realm of the "unborn," categories (varṇāḥ) cease to exist. This means that the usual distinctions we make in our perception of the world, such as good and evil, subject and object, or self and other, are not applicable in this ultimate reality. 

Because categories do not apply, "discrimination" (vivekaḥ) is not spoken. This means that the usual act of discerning and separating things into categories is no longer relevant when we reach the realm of the "unborn."  Our understanding of the world needs to transcend dualistic thinking and the limitations of our perception.

The verse encourages us to move beyond our conventional understanding of reality and to seek a deeper understanding that is not bound by categories, duality, or time. This understanding leads to liberation and a state of oneness with the ultimate reality. 
