{
    "verse_no": "१-२-९",
    "verse": "अविद्यायां बहुधा वर्तमाना वयं कृतार्था इत्यभिमन्यन्ति बालाः।\nयत्‌ कर्मिणो न प्रवेदयन्ति रागात्‌ तेनातुराः क्षीणलोकाश्च्यवन्ते ॥",
    "terms": {
        "अविद्यायां": "Due to ignorance",
        "बहुधा": "in various ways",
        "वर्तमाना": "behaving, acting",
        "वयं": "we",
        "कृतार्था": "feel fulfilled, satisfied",
        "इत्यभिमन्यन्ति": "believe, think",
        "बालाः": "the ignorant, immature ones",
        "यत्‌": "Because",
        "कर्मिणो": "of the doer, performer",
        "न": "not",
        "प्रवेदयन्ति": "convey, disclose",
        "रागात्‌": "due to attachment, desire",
        "तेन": "as a result of that",
        "आतुराः": "eager, longing",
        "क्षीणलोकाश्च्यवन्ते": "their lives become wasted, ruined"
    },
    "meaning": "Meaning:The ignorant individuals, behaving in various ways due to their ignorance, believe themselves to be fulfilled and satisfied. Due to their attachment to desires and not being able to understand the consequences of their actions, their lives become wasted and ruined.",
  "upanishad-org": {
    "meaning": "They dwell in many bonds of the Ignorance, children thinking, “We have achieved our aim of Paradise”; for when the men of works are held by their affections, and arrive not at the Knowledge, then they are overtaken by anguish, then their Paradise wastes by enjoying and they fall from their heavens.",
    "meaning-hindi": "ये 'अविद्या' के बहुविध बन्धनों में रहते हैं तथा बालकों के समान गर्ववशात् सोचते हैं, \"हमने अपने 'स्वर्ग' के लक्ष्य को प्राप्त कर लिया''; क्योंकि जब कर्मनिष्ठ व्यक्ति अपनी आसक्ति (राग) के कारण 'ज्ञान' लाभ नहीं कर पाते तब वे दुःख तथा आतुरता के वश में हो जाते हैं, तब उनका 'स्वर्ग', भोग के कारण क्षीण हो जाता है तथा वे स्वयं अपने स्वर्ग से पतित हो जाते हैं।",
    "terms": "अविद्यायाम् - avidyāyām - of the Ignorance | बहुधा - bahudhā - many bonds | वर्तमानाः - vartamānāḥ - dwelling in | बालाः - bālāḥ - children | वयम् कृतार्थाः इति - vayam kṛtārthāḥ iti - “We have achieved our aim of Paradise” | अभिमन्यन्ति - abhimanyanti - they think | यत् - yat - for when | कर्मिणः - karmiṇaḥ - the men of works | रागात् - rāgāt - held by their affections | न प्रवेदयन्ति - na pravedayanti - arrive not at the Knowledge | तेन - tena - then / because of that | क्षीणलोकाः - kṣīṇalokāḥ - when the Paradise wastes by enjoying | आतुराः - āturāḥ - overtaken by anguish | च्यवन्ते - cyavante - they fall (from their heavens) "
  }
}