{
    "verse_no": "३-१४-२",
    "verse": "मनोमयः प्राणशरीरो भारूपः सत्यसंकल्प आकाशात्मा सर्वकर्मा सर्वकामः सर्वगन्धः सर्वरसः सर्वमिदमभ्यत्तोऽवाक्यनादरः॥",
    "terms": {
        "मनोमयः (manomayaḥ)": "consisting of the mind (manas)",
        "प्राणशरीरो (prāṇaśarīro)": "composed of the vital breath (prāṇa) as the physical body (śarīra)",
        "भारूपः (bhārūpaḥ)": "having the form (rūpa) of the earth (bhū)",
        "सत्यसंकल्पः (satyasankalpaḥ)": "having truthful (satya) intentions (sankalpa)",
        "आकाशात्मा (ākāśātmā)": "the soul (ātman) resembling the sky (ākāśa)",
        "सर्वकर्मा (sarvakarmā)": "engaging in all (sarva) actions (karma)",
        "सर्वकामः (sarvakāmaḥ)": "having all (sarva) desires (kāma)",
        "सर्वगन्धः (sarvagandhaḥ)": "having all (sarva) fragrances (gandha)",
        "सर्वरसः (sarvarasaḥ)": "having all (sarva) tastes (rasa)",
        "सर्वमिदमभ्यत्तोऽवाक्यनादरः॥ (sarvamidamabhyatto'vākyanādaraḥ)": "existing in all (sarva) this (idam), beyond (abhyattaḥ) speech (vākya) and thought (nādaraḥ)"
    },
    "meaning": "जो अंदर बैठा है वो शुद्ध मन से ग्राह्य है समस्त प्राणों की आत्मा है ",
    "meaning-gpt": "This verse describes the nature of the soul or ātman. The ātman is said to be composed of the mind and the vital breath that dwell within the physical body. It takes on the form of the earth and has truthful intentions. The ātman is also compared to the vast sky and is involved in all actions and desires. It possesses all fragrances and tastes. Lastly, the verse states that the nature of the ātman is beyond mere words and thoughts, existing in all things.",
  "upanishad-org": {
    "meaning": "He who consists of the mind, whose body is subtle, whose form is light, whose thoughts are true, whose nature is like the akasa, whose creation in this universe, who cherishes all righteous desires, who contains all pleasant odours, who is endowed with all tastes, who embraces all this, who never speaks and who is without longingó He is my Self within the heart, smaller than a grain of rice, smaller than a grain of barley, smaller than a mustard seed, smaller than a grain of millet; He is my Self within the heart, greater than the earth, greater than the midóregion, greater than heaven, greater than all these worlds"
  },
    "wisdomlib": {
      "meaning": "He is controlled by the mind [i.e., his mind decides what he should and should not do]. He has a subtle body, and he is luminous. If he wants something, he never fails to get it. His Self is spotless like the sky. The whole world is his creation. [Desires are many, and] all those desires are his desires. All odours are his; similarly, all tastes are his. He is everywhere in the world. He has no sense organs, and he is free from desires.",
      "terms": "Manomayaḥ, dominated by the mind; prāṇaśarīraḥ, with a subtle body; bhārūpaḥ, whose body is luminous; satyasaṅkalpaḥ, whose thoughts always prove true; ākāśātmā, spotless like the sky; sarvakarmā, whose creation is this world; sarvakāmaḥ, whose desires are always pure; sarvagandhaḥ, who possesses good odours; sarvarasaḥ, whose tastes are all pure; idam sarvam abhyāttaḥ, this is all-pervasive; avākī anādaraḥ, has no sense organs and no desires"
    }
}