{
    "verse_no": "७-२६-२",
    "verse": "तदेष श्लोको न पश्यो मृत्युं पश्यति न रोगं नोत दुःखता सर्व ह पश्यः पश्यति सर्वमाप्नोति सर्वश इति स एकधा भवति त्रिधा भवति पञ्चधा सप्तधा नवधा चैव पुनश्चैकादशः स्मृतः शतं च दश चैकश्च सहस्राणि च विशतिराहारशुद्धौ सत्त्वशुद्धिः सत्त्वशुद्धौ ध्रुवा स्मृतिः स्मृतिलम्भे सर्वग्रन्थीनां विप्रमोक्षस्तस्मै मृदितकषायाय तमसस्पारं दर्शयति भगवान्सनत्कुमारस्त स्कन्द इत्याचक्षते त स्कन्द इत्याचक्षते॥",
    "terms": {
        "तदेषः": "This",
        "श्लोकः": "verse",
        "न": "not",
        "पश्यो": "sees",
        "मृत्युं": "death",
        "पश्यति": "sees",
        "रोगं": "disease",
        "उत": "and",
        "दुःखता": "suffering",
        "सर्वं": "everything",
        "ह": "indeed",
        "पश्यः": "sees",
        "सर्वम्": "everything",
        "आप्नोति": "attains",
        "सर्वः": "all",
        "इति": "thus",
        "स": "he",
        "एकधा": "in one way",
        "भवति": "becomes",
        "त्रिधा": "in three ways",
        "पञ्चधा": "in five ways",
        "सप्तधा": "in seven ways",
        "नवधा": "in nine ways",
        "च": "and",
        "एव": "also",
        "पुनः": "again",
        "एकादशः": "eleven",
        "स्मृतः": "remembered",
        "शतं": "a hundred",
        "दश": "ten",
        "एकश्च": "one",
        "सहस्राणि": "thousands",
        "विशतिर": "manifestation",
        "आहारशुद्धौ": "the purity of food(object of senses)",
        "सत्त्वशुद्धिः": "purification of the mind",
        "सत्त्वशुद्धौ": "in the purity of the mind",
        "ध्रुवा": "is firmly established",
        "स्मृतिः": "memory",
        "स्मृतिलम्भे": "in the attainment of memory",
        "सर्वग्रन्थीनां": "of all the knots (of ignorance)",
        "विप्रमोक्षः": "liberation from bondage",
        "तस्मै": "to that (person)",
        "मृदित": "who has discarded ",
        "कषायाय": "all attachments",
        "तमसस्पारं": "touching the darkness of ignorance",
        "दर्शयति": "reveals",
        "भगवान्": "the divine Lord",
        "सनत्कुमारः": "Sanatkumara",
        "त": "He",
        "स्कन्दः": "Skanda (Lord Muruga)",
        "आचक्षते": "is known"
    },
    "meaning": "This verse states that there are stages of spiritual evolution. In the first stage, one does not see death, disease, or suffering. In the second stage, one sees everything and attains everything. In the third stage, one experiences different levels of existence and attains various forms of liberation. This is achieved through the recollection of twenty four measures of food, the purification of the mind, and the attainment of memory. By abandoning all attachments, one obtains liberation from the knots of ignorance, and the divine Lord, Sanatkumara, reveals the path beyond ignorance. He is known as Skanda, the one who leads the way.",
  "upanishad-org": {
    "meaning": "On this there is the following verse: \"'The knower of Truth does not see death or disease or sorrow. The knower of Truth sees everything and obtains everything everywhere.' \"He (the knower) is one before the creation, becomes three, becomes five, becomes seven, becomes nine; then again he is called eleven, one hundred and ten and one thousand and twenty. \"Now is described the discipline for inner purification by which Self-Knowledge is attained: When the food is pure, the mind becomes pure. When the mind is pure the memory becomes firm. When the memory is firm all ties are loosened.\" The venerable Sanatkumara showed Narada, after his blemishes had been wiped out, the other side of darkness. They call Sanatkumara Skanda, yea, Skanda they call him"
  }
}