{
    "verse_no": "८-१२-४",
    "verse": "अथ यत्रैतदाकाशमनुविषण्णं चक्षुः स चाक्षुषः पुरुषो दर्शनाय चक्षुरथ यो वेदेदं जिघ्राणीति स आत्मा गन्धाय घ्राणमथ यो वेदेदमभिव्याहराणीति स आत्माऽभिव्याहाराय वागथ यो वेदेद शृणवानीति स आत्मा श्रवणाय श्रोत्रम्‌॥",
    "terms": {
        "अथ": "then",
        "यत्र": "where (here it refers to the body)",
        "एतद": "this (referring to the body)",
        "आकाशम्": "sky (here representing the space within the body)",
        "अनुविषण्णं": "surrounded by (enveloped in)",
        "चक्षुः": "eye",
        "सः": "that",
        "चाक्षुषः": "the eye (here it represents the sense organ of vision)",
        "पुरुषः": "individual (here representing the conscious being)",
        "दर्शनाय": "for perceiving",
        "यः": "who",
        "वेद": "knows",
        "इदं": "this",
        "जिघ्राणीति": "smells",
        "आत्मा": "self (consciousness)",
        "गन्धाय": "for smelling",
        "घ्राणम्": "nose",
        "अभिव्याहराणीति": "speaks",
        "अभिव्याहाराय": "for speaking",
        "वाक्": "speech",
        "शृणवानीति": "hears",
        "श्रवणाय": "for hearing",
        "श्रोत्रम्‌": "ear"
    },
    "meaning": "Meaning:Now, where this body is surrounded by the space within, there is the eye, which is the sense organ of vision, for perceiving. And who, among the senses, knows this body? The nose, which smells, represents the self (consciousness) for smelling. And who, among the senses, knows this body? The self (consciousness) represented by the faculty of speech speaks. And who, among the senses, knows this body? The self (consciousness) represented by the faculty of hearing hears.",
    "wisdomlib": {
        "meaning": "Next, this organ of vision lies inside the space in the eyes. That is where the deity presiding over the eyes [i.e., the Self] is. The eye is the instrument through which the Self sees. Next, the one who knows ‘I am smelling this’ is the Self. The organ of smell is the instrument through which the Self smells. Next, the one who knows ‘I am speaking this’ is the Self. The organ of speech is the instrument through which the Self speaks. Next, the one who knows ‘I hear this’ is the Self. The organ of hearing is the instrument through which the Self hears.",
        "terms": "Atha, then; yatra etat cakṣuḥ, where this organ of vision is; ākāśam anuviṣaṇṇam, lying inside the space [in the eye]; saḥ cākṣuṣaḥ puruṣaḥ, that is the deity presiding over the eye; darśanāya cakṣuḥ, the eye is the instrument of vision; atha, then; yaḥ veda, one who knows; idam jighrāṇi iti, I smell this; saḥ ātmā, that is the Self; gandhāya ghrāṇam, the organ of smell is the instrument of smelling; atha, then; yaḥ veda, one who knows; idam abhivyāharāṇi iti, I speak this; saḥ ātmā, that is the Self; abhivyāhārāya vāk, the organ of speech is the instrument of speaking; atha, then; yaḥ veda, one who knows; idam śṛṇavāni iti, I hear this; saḥ ātmā, that is the Self; śravaṇāya śrotram, the ear is the instrument of hearing.",
        "Commentary": "The Upaniṣad is saying that the Self is within us, and that the Self makes use of the organs for its experience in this empirical world. ‘I see, I hear, I speak’—who is this ‘I’? When I say, ‘I see,’ do I mean the eyes are seeing something by their own power? No. The Self is behind the eyes, and the Self uses them for its own purpose. The eyes are not independent. When we die, all our organs may be intact, yet we won’t be able to see or hear anything.\n\nYou may ask, ‘How do I know that the Self is working through the organs?’ Vedānta says, suppose you are absent-minded and are absorbed in thinking something. Someone may come and stand before you and say something, but you don’t see him at all. Now who is it that is absorbed? It is the Self. The Self has withdrawn itself from the sense organs, and because of this they are not able to operate in the way they normally do.\n\nEarlier Prajāpati had told Indra and Virocana that the person in the eyes is the Self. Indra took it to mean that his own reflection was the Self. But this is not what Prajāpati meant. He meant that there is a being within us who sees through the eyes and hears through the ears. He says that within the eye there is a space, and that is where the Self is. The Self is hiding there, as it were. Prajāpati uses the word puruṣa to refer to the Self. Here puruṣa does not mean ‘male,’ as it does in Bengali. The word puruṣa literally means pure śayate—that is, ‘one who is lying,’ or ‘hidden’ (śayate) ‘in a place’ (pure).\n\nWho does the organ of smelling work for? The Self. All our organs are servants of the Self. The person in the eye uses the eye to see and the organ of smelling to smell. When the Self, the puruṣa, wants to speak, it uses the organ of speaking. And when it wants to hear, it uses the organ of hearing."
    }
}