{
    "verse_no": "८-१२-५",
    "verse": "अथ यो वेदेदं मन्वानीति स अत्मा मनोऽस्य दैवं चक्षुः स वा एष एतेन दैवेन चक्षुषा मनसैतान्कामान् पश्यन् रमते॥",
    "terms": {
        "अथ (atha)": "Now, then",
        "यो (yo)": "One who",
        "वेदेदं (vededam)": "knows, understands",
        "मन्वानीति (manvānīti)": "as 'mana' (mind) + 'anīti' (leads)",
        "स (sa)": "he",
        "अत्मा (ātmā)": "Self, soul",
        "मनोऽस्य (mano 'sya)": "of this mind",
        "दैवं (daivam)": "divine nature, higher power",
        "चक्षुः (cakṣuḥ)": "eye, vision",
        "वा (vā)": "or",
        "एष (eṣa)": "this, such",
        "एतेन (etena)": "by this",
        "दैवेन (daivena)": "divine nature, higher power",
        "चक्षुषा (cakṣuṣā)": "by the eye, through the vision",
        "मनसैतान्कामान् (manasaitānkāmān)": "desires, wishes of the mind",
        "पश्यन् (paśyan)": "seeing, perceiving",
        "रमते (ramate)": "enjoys, delights"
    },
    "meaning": "Translation: Now, the one who understands this as 'the mind leads', that person is the self of this mind and the divine eye. He, indeed, sees and enjoys these desires/wishes of the mind through this divine eye and mind.",
    "ref": [
        "kamana aur upasana 1 175"
    ],
     "wisdomlib": {
         "meaning": "Then, it is the Self which knows ‘I am thinking this.’ The mind is its divine eye. The Self, now free, enjoys seeing everything it wants to see in Brahmaloka through its divine mental eye",
         "terms": "Atha, next; yaḥ veda, that which knows; idam manvāni iti, I am thinking this; saḥ ātmā, that is the Self; manaḥ asya daivam cakṣuḥ, the mind is its divine eye; saḥ vai eṣaḥ, that [Self]; etena daivena cakṣuṣā manasā, with the help of the divine mental eye; etān kāmān paśyan ramate, enjoys seeing the things it likes; yaḥ ete brahmaloke, those which are in Brahmaloka.\n",
         "commentary": "Next comes the mind. The mind is the principal organ. The Self works through the mind, and by means of the mind it works through the eyes, ears, and other organs.\n\nYou may remember the example given in the Kaṭha Upaniṣad: The Self is the master of the chariot, the mind is the charioteer, and the organs are the horses. The mind is directly responsible for keeping the organs under control.\n\nThe mind is called here the daivam cakṣuḥ, the divine eye, because the Self sees through the mind. The mind is extraordinary. One who is firmly established in Self-knowledge can enjoy whatever he wants mentally. And for such a person everything is Brahman and every place is Brahmaloka."
     }
}