{
    "verse_no": "८-३-२",
    "verse": "अथ ये चास्येह जीवा ये च प्रेता यच्चान्यदिच्छन्न लभते सर्वं तदत्र गत्वा विन्दतेऽत्र ह्यस्यैते सत्याः कामा अनृतापिधानास्तद्यथापि हिरण्यनिधिं निहितमक्षेत्रज्ञा उपर्युपरि सञ्चरन्तो न विन्देयुरेवमेवेमाः सर्वाः प्रजा अहरहर्गच्छन्त्य एतं ब्रह्मलोकं न विन्दन्त्यनृतेन हि प्रत्यूढाः॥",
    "terms": {
        "अथ": "now",
        "ये": "those",
        "च": "and",
        "अस्य": "of this (world)",
        "इह": "in this",
        "जीवाः": "living beings",
        "प्रेताः": "departed souls",
        "यच्च": "and whatever",
        "अन्यत्": "others",
        "इच्छन्न": "desiring",
        "लभते": "obtain",
        "सर्वं": "everything",
        "तदयत्र": "in that place",
        "गत्वा": "having gone",
        "विन्दते": "they obtain",
        "अत्र": "here",
        "हि": "indeed",
        "एषे": "these",
        "सत्याः": "true",
        "कामाः": "desires",
        "अनृतापिधानाः": "wrapped in falsehood",
        "तद्यथापि": "however",
        "हिरण्यनिधिं": "the treasure of gold",
        "निहितम्": "hidden",
        "अक्षेत्रज्ञाः": "ignorant of the field",
        "उपर्युपरि": "high and low",
        "सञ्चरन्तः": "wandering",
        "न": "not",
        "विन्देयुः": "find",
        "एवमेव": "in this same way",
        "इमाः": "these",
        "सर्वाः": "all",
        "प्रजाः": "beings",
        "अहरहः": "day and night",
        "गच्छन्ति": "they go",
        "एतं": "this",
        "ब्रह्मलोकं": "abode of Brahman",
        "विन्दन्ति": "find",
        "अनृतेन": "due to falsehood",
        "प्रत्यूढाः": "enveloped"
    },
    "meaning": "yeah jo ghar hai jismai aap bhi rehatein hai, us ghar ek anadar bahut badi nidhi gaddi hai, heere javaharat sab, hum usi ke upar chal rahe hain, lekin bheek maang rahe hain, din raat chal rahein usi ghar mai, us brahm ko, us bhandar ko jo gada hai niche dhaan nahi jaante, agar koi jyotishi bata de, are bewakuf to bheek mangata hai tere ghar ke nich aanant dhan gada hai jara sa khod ke nikal le naa",
    "meaning-gpt": "Translation:Now, those living beings in this world, as well as the departed souls and others who desire, obtain everything there. Having gone to that place, they obtain it here. Truly, these desires of this world are wrapped in falsehood. However, the ignorant of the field, wandering high and low, do not find the hidden treasure of gold. In this same way, all beings go day and night, but they do not find this abode of Brahman. They are enveloped in falsehood.",
    "upnishad-org": {
        "meaning": "Those of his fellows who belong to him here and those who are dead and whatever else there is which he wishes for and does not obtain-he finds all that by going in there (i.e. into his own Self). For there, indeed, lie those true desires of his, covered by what is false. \"As people who do not know the spot where a treasure of gold has been hidden somewhere in the earth, walk over it again and again without finding it, so all these creatures day after day go into the World of Brahman and yet do not find it, because they are carried away by untruth"
    }
}