{
  "verse_no": "१-४-७",
  "verse": "तद्धेदं तर्ह्यव्याकृतमासीत्तन्नामरूपाभ्यामेव व्याक्रियतासौ नामायमिदरूप इति तदिदमप्येतर्हि नामरूपाभ्यामेव व्याक्रियतेऽसौ नामायमिदरूप इति स एष इह प्रविष्टः। आनखाग्रेभ्यो यथा क्षुरः क्षुरधानेऽवहितः स्याद्विश्वम्भरो वा विश्वम्भरकुलाये तं न पश्यन्ति। अकृत्स्नो हि स प्राणन्नेव प्राणो नाम भवति। वदन् वाक् पश्यश्चक्षुः शृण्वन् श्रोत्रं मन्वानो मनस्तान्यस्यैतानि कर्मनामान्येव। स योऽत एकैकमुपास्ते न स वेदाकृत्स्नो ह्येषोऽत एकैकेन भवतात्मेत्येवोपासीतात्र ह्येते सर्व एकं भवन्ति। तदेतत्पदनीयमस्य सर्वस्य यदयमात्माऽनेन ह्येतत्सर्वं वेद। यथा ह वै पदेनानुविन्देदेवं कीर्ति श्लोकं विन्दते य एवं वेद॥",
  "terms": {
  },
  "meaning": "ये संपूर्ण जगत नाम रूप रहित सूक्ष्म रूप से था महाप्रलय के बाद और फिर ये नाम रूप युक्त स्थूल रूप से प्रकट हो गया",
  "upnishad-org": {
    "meaning": "Now, all this universe was then undifferentiated. It became differentiated by name and form: it was known by such and such a name and such and such a form. Thus to this day this universe is differentiated by name and form; so it is said. \"He has such a name and such a form.\" This Self has entered into these bodies up to the very tips of the nails, as a razor lies hidden in its case, or as fire, which sustains the world, lies hidden in its source. People do not see the Self, for when viewed in parts It is incomplete: when breathing, It is called the vital breath (prana); when speaking, the organ of speech; when seeing, the eye; when hearing, the ear; when thinking, the mind. These are merely Its names according to Its functions. He who meditates on one or another of Its aspects does not know, for It is then incomplete: the Self is separated from Its totality by being associated with a single characteristic. The Self alone is to be meditated upon, for in It all these become unified. Of all these, this Self alone should be known, for one knows all these through It, just as one may find an animal which is lost through its footprints. He who thus knows the Self obtains fame and association with dear ones"
  }
}