{
    "verse_no": "३-४-१",
    "verse": "अथ हैनमुषस्तश्चाक्रायणः पप्रच्छ याज्ञवल्क्येति होवाच यत्साक्षादपरोक्षाद्ब्रह्म य आत्मा सर्वान्तरस्तं मे व्याचक्ष्व इत्येष त आत्मा सर्वान्तरः कतमो याज्ञवल्क्य सर्वान्तरो यः प्राणेन प्राणिति स त आत्मा सर्वान्तरो योऽपानेनापानिति स त आत्मा सर्वान्तरो यो व्यानेन व्यानिति स त आत्मा सर्वान्तरो य उदानेनोदानिति स त आत्मा सर्वान्तर एश त आत्मा सर्वन्तरः॥",
    "terms": {
        "अथ": "Now, then",
        "हैनम्": "this (person)",
        "उषस्": "Ushas (the dawn)",
        "तश्": "from that person",
        "च": "and",
        "आक्रायणः": "Akrayana (a sage)",
        "पप्रच्छ": "asked",
        "याज्ञवल्क्यः": "Yajnavalkya",
        "इति": "thus",
        "होवाच": "replied",
        "यत्": "that which",
        "साक्षात्": "directly",
        "अपरोक्षात्": "not indirect",
        "ब्रह्म": "Brahman (the ultimate reality)",
        "यः": "who",
        "आत्मा": "ātman",
        "सर्वान्तरः": "within everything",
        "तम्": "to me",
        "व्याचक्ष्व": "explain",
        "एषः": "this (person)",
        "तः": "to him",
        "कतमः": "which",
        "प्राणेन": "by prana (life force)",
        "प्राणिति": "sustains",
        "सः": "that",
        "अपानेन": "by apana (the downward force of prana)",
        "अपानिति": "leads",
        "व्यानेन": "by vyana (the pervading force of prana)",
        "व्यानिति": "spreads",
        "उदानेन": "by udana (the upward force of prana)",
        "उदानिति": "uplifts",
        "सर्वन्तरः": "within everything"
    },
    "meaning": "Translation:Now, Akrayana, the disciple of Ushas, asked Yajnavalkya, \"Please explain to me about that self, who is Brahman, directly, not indirectly, and who is present within everything.\"To him, Yajnavalkya replied, \"That self who is within everything is the self that sustains everything through prana (life force). That self who is within everything is the self that leads everything through apana (downward force of prana). That self who is within everything is the self that spreads through vyana (pervading force of prana). That self who is within everything is the self that uplifts everything through udana (upward force of prana).\"This person (Yajnavalkya) is that self who is within everything."
}