{
    "verse_no": "३-५-१",
    "verse": "अथ हैनं कहोलः कहोलः कौषीतकेयः पप्रच्छ याज्ञवल्क्येति होवाच यदेव साक्षादपरोक्षाद्ब्रह्म य आत्मा सर्वान्तरस्तं मे व्याचक्ष्वेत्येष त आत्मा सर्वान्तरः। कतमो याज्ञवल्क्य सर्वान्तरो योऽशयनायापिपासे शोकं मोहं जरां मृत्युमत्येति। एतं वै तमात्मानं विदित्वा ब्राह्मणाः पुत्रैषणायाश्च वित्तैषणायाश्च लोकैषणायाश्च व्युत्थायाथ भिक्षाचर्यं चरन्ति या ह्येव पुत्रैषणा सा वित्तैषणा या वित्तैषणा सा लोकैषणोभे ह्येते एषणे एव भवतस्तस्माद् ब्राह्मणः पाण्डित्यं निर्विद्य बाल्येन तिष्ठासेद्बाल्यं च पाण्डित्यं च निर्विद्याथ मुनिरमौनं च मौनं च निर्विद्याऽथ ब्राह्मणः स ब्राह्मणः केन स्याद्येन स्यात्तेनेदृश एवतोऽन्यदार्तं ततो ह कहोलः कौषीतकेय उपरराम॥",
    "terms": {
        "अथ हैनं": "Now, he (Kahola) asked this (question) -",
        "कहोलः कहोलः": "Kahola, Kahola",
        "कौषीतकेयः पप्रच्छ": "Kaushitaki (son) asked",
        "याज्ञवल्क्येति होवाच": "(He) replied, \"Yajnavalkya\"",
        "यदेव साक्षादपरोक्षाद्ब्रह्म": "That which indeed is Brahman, which is immediate and not mediate",
        "य आत्मा सर्वान्तरस्तं मे व्याचक्ष्वेति": "That Self which is innermost, you tell me",
        "एष त आत्मा सर्वान्तरः": "This indeed is the Self, innermost",
        "कतमो याज्ञवल्क्य सर्वान्तरो": "Which is Yajnavalkya, the innermost Self?",
        "योऽशयनायापिपासे शोकं मोहं जरां मृत्युमत्येति": "One who desires to know the state of deep sleep, death, sorrow, delusion, and old age",
        "एतं वै तमात्मानं विदित्वा": "Having known this Self",
        "ब्राह्मणाः पुत्रैषणायाश्च वित्तैषणायाश्च लोकैषणायाश्च व्युत्थायाथ भिक्षाचर्यं चरन्ति": "The Brahmins, seeking sons, wealth, and worldly desires, take to the life of begging",
        "या ह्येव पुत्रैषणा सा वित्तैषणा": "Those who desire sons, seek wealth",
        "सा वित्तैषणा या वित्तैषणा सा लोकैषणा": "Those who seek wealth, desire worldly achievements",
        "उभे ह्येते एषणेषु": "Both of these are desires",
        "एव भवतः": "Indeed, you have desires",
        "तस्मात् ब्राह्मणः पाण्डित्यं निर्विद्य": "Therefore, O Brahmin, having realized wisdom",
        "बाल्येन तिष्ठासेद्बाल्यं च पाण्डित्यं च निर्विद्याथ": "Stand in childhood, and having realized both childhood and wisdom",
        "मुनिरमौनं च मौनं च निर्विद्याऽथ ब्राह्मणः": "The sage (Muni) has realized silence, and having realized both silence and wisdom",
        "स ब्राह्मणः केन स्याद्येन स्यात्तेनेदृश एवतोऽन्यदार्तं": "By whom should the Brahmin be known? By whom should the Brahmin be as he is?",
        "ततो ह कहोलः कौषीतकेय उपरराम": "Thereupon, Kahola, son of Kaushitaki, remained silent (stopped asking further questions)"
    },
    "meaning": ""
}