{
    "verse_no": "५-१-१",
    "verse": "ॐ पूर्णमदः पूर्णमिदं पूर्णात्पूर्णमुदच्यते॥ पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते॥ ॐ खं ब्रह्म खं पुराणं वायुरं खम्इति ह स्माह कौरव्यायणीपुत्रो वेदोऽयं ब्राह्मणा विदुर्वेदैनेन यद्वेदितव्यम्॥",
    "terms": {
        "ॐ (om)": "a sacred sound and symbol in Hinduism, often regarded as a representation of the divine consciousness or ultimate reality.",
        "पूर्णमदः (purnamadah)": "this is a compound word made up of two parts:",
        "": "इतव्यम् (itavyam) - should be done, is required",
        "पूर्णमिदं (purnamidam)": "this is also a compound word made up of two parts:",
        "पूर्णात् (purnat)": "from पूर्ण (purna); from the fullness, from the complete",
        "पूर्णमुदच्यते (purnamudachyate)": "this is a verb derived from the root उच् (uch) which means to speak or say; it is in the passive voice",
        "पूर्णस्य (purnasya)": "from पूर्ण (purna); of the complete/full",
        "पूर्णमादाय (purnamadaya)": "taking from the complete/full",
        "पूर्णमेव (purnameva)": "the complete/full alone",
        "अवशिष्यते (avashishyate)": "remains, is left over",
        "खं (kham)": "sky",
        "ब्रह्म (brahma)": "ultimate reality, the absolute",
        "पुराणं (puranam)": "ancient, traditional, eternal",
        "वायुः (vayuh)": "air, wind",
        "अं (am)": "a sound added for euphonic reasons; it indicates the accusative singular form",
        "इति (iti)": "thus, so",
        "ह (ha)": "an exclamation indicating praise or reverence",
        "स्माह (smah)": "1st-person singular present indicative of the verb सूच् (such), which means to indicate, to mention",
        "कौरव्यायणीपुत्रो (kauravyayaniputro)": "son of Kauravyayani, a sage or a descendant of the sage Kauravyayani",
        "वेदः (vedah)": "knowledge, wisdom, scripture, the Vedas",
        "अयं (ayam)": "this",
        "ब्राह्मणा (brahmana)": "Brahmins, the priestly class in the Vedic tradition",
        "विदुः (viduh)": "know, understand",
        "वेदैनेन (vedainena)": "by this Veda",
        "यत् (yat)": "which",
        "वेदितव्यम् (veditavyam)": "should be known, should be understood"
    },
    "meaning": "Meaning: The first line of the verse describes the nature of the ultimate reality or divine consciousness. It is described as \"पूर्ण\" (complete, full, whole) and is said to be the source of all creation. The verse states that the universe arises from this fullness, and yet, the fullness remains unchanged and complete.Meaning: The second line of the verse explains that when something is taken from the complete/full, the complete/full remains as it is. Even after the unfoldment of the universe, the fullness or completeness is not diminished but remains as it is.Meaning: This concluding verse praises the Vedas as the embodiment of knowledge and wisdom. It mentions that the Veda, specifically the Brahmanas (priestly class) understood by the son of Kauravyayani, contains the eternal truth about Brahman (ultimate reality) being the sky (space), air (wind), etc. It suggests that through the study and understanding of the Vedas, one can gain knowledge of the ultimate reality.",
    "upnishad-org": {
        "meaning": "Om. Infinite is That Brahman, infinite in this manifested universe. From the Infinite Brahman proceeds the infinite. After the realization of the Great Identity or after the cosmic dissolution, when the infinity of the infinite universe merges in the Infinite Brahman, there remains the Infinite Brahman alone. Om is the Akasa Brahman-the primeval akasa. It is the akasa containing air, says the son of Kauravayarn. It (Om) is the Veda-thus the knowers of Brahman know; for through it one knows what is to he known"
    }
}