{
  "verse_no": "१-६",
  "verse": "स य एषोऽन्तरहृदय आकाशः। तस्मिन्नयं पुरुषो मनोमयः। अमृतो हिरण्मयः। अन्तरेण तालुके। य एष स्तन इवावलम्बते।सेन्द्रयोनिः। यत्रासौ केशान्तो विवर्तते। व्यपोह्य शीर्षकपाले।\nभूरित्यग्नौ प्रतितिष्ठति।भुव इति वायौ। सुवरित्यादित्ये। मह इति ब्रह्मणि। आप्नोति स्वाराज्यम्। आप्नोति मनसस्पतिम्‌। वाक्पतिश्चक्षुष्पतिः।श्रोत्रपतिर्विज्ञानपतिः। एतत्ततो भवति। आकाशशरीरं ब्रह्म। सत्यात्मप्राणारामं मनानन्दम्‌।शान्तिसमृद्धममृतम्। इति प्राचीनयोग्योपास्व॥",
  "terms": {
    "glossary": "एषः आकाशः - eṣaḥ ākāśaḥ - this heaven of ether | यः अन्तर्हृदय - yaḥ antarhṛdaya - which is in the heart within | तस्मिन् - tasmin - there | सः अयम् पुरुषः - saḥ ayam puruṣaḥ - the Being that is | मनोमयः - manomayaḥ - is all Mind | हिरण्मयः - hiraṇmayaḥ - the radiant & golden | अमृतः - amṛtaḥ - Immortal | अन्तरेण तालुके - antareṇa tāluke - between the two palates | यः एषः - yaḥ eṣaḥ - this that | स्तनः इव - stanaḥ iva - like the breast of a woman | अबलम्बते - abalambate - hangeth down | सा इन्द्रयनिः - sā indrayaniḥ - is the womb of Indra | यत्र - yatra - where | असौ - asau - this | केशान्तः - keśāntaḥ - the hair at its end | विवर्तते - vivartate - whirleth round like an eddy | शीर्षकपाले व्यपोह्य - śīrṣakapāle vyapohya - there it divideth the skull and pusheth through it | भूः इति - bhūḥ iti - as Bhu | अग्नौ प्रतितिष्ठति - agnau pratitiṣṭhati - He is established in Agni | भुवः इति - bhuvaḥ iti - as Bhuva | वायौ - vāyau - in Vayu | सुवः इति - suvaḥ iti - as Suva | आदित्ये - āditye - in the Sun | महः इति - mahaḥ iti - as Mahas | ब्रह्मणि - brahmaṇi - in the Eternal | स्वाराज्यम् - svārājyam - to the kingdom of Himself | आप्नोति - āpnoti - He attaineth | वाक्पतिः - vākpatiḥ - He becometh Lord of Speech | चक्षुष्पतिः - cakṣuṣpatiḥ - Lord of Sight | श्रोत्रपतिः - śrotrapatiḥ - Lord of Hearing | विज्ञानपतिः - vijñānapatiḥ - Lord of the Knowledge | एतत् ब्रह्म - etat brahma - the Eternal | आकाशशरीरम् - ākāśaśarīram - whose body is all ethereal space | सत्यात्मप्राणारामम् - satyātmaprāṇārāmam - whose soul is Truth and who taketh His ease in Prana | मन आनन्दम् - mana ānandam - whose bliss is in Mind | शान्तिसमृद्धम् - śāntisamṛddham - Rich in Peace | अमृतम् - amṛtam - the Immortal Self | भवति इति - bhavati iti - thereafter this too He becometh | प्राचीनयोग्य - prācīnayogya - O son of the ancient Yoga ! | उपास्व - upāsva - do thou adore Him |"
  },
  "meaning": "Meaning\nLo this heaven of ether which is in the heart within, there dwelleth the Being who is all Mind, the radiant & golden Immortal. Between the two palates, this that hangeth down like the breast of a woman, is the womb of Indra; yea where the hair at its end whirleth round like an eddy, there it divideth the skull and pusheth through it. As Bhur He is established in Agni, as Bhuvar in Vayu, as Suvar in the Sun, as Mahas in the Eternal. He attaineth to the kingdom of Himself; He attaineth to be the Lord of Mind; He becometh Lord of Speech, Lord of Sight, Lord of Hearing, Lord of the Knowledge. Thereafter this too He becometh,-the Eternal whose body is all ethereal space, whose soul is Truth, whose bliss is in Mind, who taketh His ease in Prana, the Rich in Peace, the Immortal. As such, O son of the ancient Yoga, do thou adore Him.\n\nHindi Meaning\nदेखो, यह जो अन्तर्हदय में आकाशीय स्वर्ग है, वहाँ निवास करता है यह 'पुरुष' (आत्मसत्ता) जो मनोमय है, देदीप्यमान एवं स्वर्णिम (हिरण्मय) है, अमृतस्वरूप है। दोनों तालुओं के बीच यह जो स्त्री के स्तन जैसा लटक रहा है वह इन्द्र का उत्पत्ति स्थान (योनि) है। जहाँ केश अपने अन्तिम सिरे पर भँवर के समान कुन्तलित हो जाता है वही यह कपाल को विभाजित करके उसके बीच से निकल जाता है ।\n'भूः' के रूप में यह अग्नि में प्रतिष्ठित है; 'भुवः' के रूप में वायु में; 'सुवः' के रूप में आदित्य में;'महः' के रूप में शाश्वत 'ब्रह्म' में। वह 'स्वराज्य' को प्राप्त करता है। वह 'मन' के आधिपत्य को प्राप्त करता है; वह 'वाक्' का अधिपति, 'चक्षु' का अधिपति, 'श्रोत्र' का अधिपति, 'विज्ञान' का अधिपति बन जाता है। इसके पश्चात् 'वह' यह 'ब्रह्म' भी बन जाता है जिसका शरीर है समस्त आकाश, जिसका आत्मा है 'सत्य', जिसका आनन्द 'मन' में है, जो 'प्राण' में अपना सुख-आराम प्राप्त करता है, जो 'शान्ति-समृद्ध है 'अमृतमय' है। हे प्राचीन योग के पुत्र, इस रूप में तुम 'उसकी' उपासना करना।",
  "ref": [
    "kamana aur upasana 2 274"
  ]
}