{
  "verse_no": "२-१",
  "verse": "प्राणं देवा अनु प्राणन्ति। मनुष्याः पशवश्च ये।प्राणो हि भूतानामायुः। तस्मात् सर्वायुषमुच्यते।सर्वमेव त आयुर्यन्ति। ये प्राणं ब्रह्मोपासते।प्राणो हि भूतानामायुः। तस्मात् सर्वायुषमुच्यत इति।तस्यैष एव शारीर आत्मा। यः पूर्वस्य। तस्माद्वा एतस्मात्प्राणमयात्। अन्योऽन्तर आत्मा मनोमयः। तेनैष पूर्णः। स वा एष पुरुषविध एव।तस्य पुरुषविधताम्। अन्वयं पुरुषविधः।तस्य यजुरेव शिरः। ऋग्दक्षिणः पक्षः। सामोत्तरः पक्षः। आदेश आत्मा। अथर्वाङ्गिरसः पुच्छं प्रतिष्ठा।तदप्येष श्लोको भवति॥",
  "terms": {
    "glossary": "ये देवाः - ye devāḥ - The Gods | मनुष्याः - manuṣyāḥ - men | पशवः - paśavaḥ - beasts | च - ca - and | सन्ति ते सर्वे - santi te sarve - all these that are | प्राणम् अनु - prāṇam anu - under the dominion of Prana | प्राणन्ति - prāṇanti - live and breathe | प्राणः हि - prāṇaḥ hi - for Prana is | भूतानाम् - bhūtānām - of created things | आयुः - āyuḥ - the life | तस्मात् - tasmāt - therefore | प्राण - prāṇa - it (Prana) | सर्वायुषम् - sarvāyuṣam - the Life Stuff of the All | इति उच्यते - iti ucyate - they name | ये - ye - they who | प्राणम् - prāṇam - Prana | ब्रह्म - brahma - the Eternal | इति - iti - as | उपासते - upāsate - worship | ते - te - they | सर्वम् एव - sarvam eva - to the uttermost | आयुः यन्ति - āyuḥ yanti - attain mastery of Life | प्राणः हि - prāṇaḥ hi - for Prana is | भूतानाम् आयुः - bhūtānām āyuḥ - the life of created things | तस्मात् - tasmāt - therefore | सः उच्यते - saḥ ucyate - they name it | सर्वायुषम् इति - sarvāyuṣam iti - the Life Stuff of the All | तस्य पूर्वस्य - tasya pūrvasya - of the former one which was of food | यः शारीरः आत्मा - yaḥ śārīraḥ ātmā - the soul in the body | सः एषः एव - saḥ eṣaḥ eva - this Self of Prana | तस्मात् वै - tasmāt vai - now there is yet | एतस्मात् प्राणमयात् आत्मनः - etasmāt prāṇamayāt ātmanaḥ - this that is of Prana | अन्यः - anyaḥ - other than | अन्तरः - antaraḥ - inner Self | मनोमयः - manomayaḥ - made of Mind | आत्मा अस्ति - ātmā asti - there is a second and inner Self | तेन - tena - (by) the Self of Mind | एषः - eṣaḥ - the Self of Prana | पूर्णः - pūrṇaḥ - filleth | सः वै - saḥ vai - now the Self of Mind | एषः पुरुषविधः एव - eṣaḥ puruṣavidhaḥ eva - is made in the image of a man | तस्य पुरुषविधताम् - tasya puruṣavidhatām - according as is the human image of the other | अनु अयम् पुरुषविधः - anu ayam puruṣavidhaḥ - so is it in the image of the man | यजुः एव - yajuḥ eva - Yajur is | तस्य शिरः - tasya śiraḥ - the head of him | ऋक् - ṛk - the Rigveda | दक्षिणः पक्षः - dakṣiṇaḥ pakṣaḥ - is his right side | साम - sāma - Samaveda | उत्तरपक्षः - uttarapakṣaḥ - is his left side | आदेशः - ādeśaḥ - the Commandment | आत्मा - ātmā - his spirit which is the self of him | अथर्वाङ्गिरसः - atharvāṅgirasaḥ - Atharvan Angirasa | तस्य पुच्छम् - tasya puccham - his lower member | प्रतिष्ठा च - pratiṣṭhā ca - whereon he resteth abidingly | तद् अपि - tad api - whereof | एषः श्लोकः भवति - eṣaḥ ślokaḥ bhavati - this is the Scripture "
  },
  "meaning": "The Gods live and breathe under the dominion of Prana and men and all these that are beasts; for Prana is the life of created things & therefore they name it the LifeStuff of the All. Verily they who worship the Eternal as Prana attain mastery of Life to the uttermost; for Prana is the life of created things and therefore they name it the LifeStuff of the All. And this Self of Prana is the soul in the body of the former one which was of food. Now there is yet a second and inner Self which is other than this that is of Prana, and it is made of Mind. And the Self of Mind filleth the Self of Prana. Now the Self of Mind ismade in the image of a man; according as is the human image of the other, so is it in the image of the man. Yajur is the headof him and the Rigveda is his right side and the Samaveda is his left side: the Commandment is his spirit which is the self of him, Atharvan Ungirus is his lower member whereon he resteth abidingly. Whereof this is the Scripture.",
  "meaning hindi": "'प्राण' के साम्राज्य में ही देवगण निवास करते एवं निश्वास लेते हैं, इसी प्रकार जो मानव हैं तथा जो पशु है वे भी; क्योंकि 'प्राण' ही समस्त भूत-पदार्थों (सृष्ट पदार्थों) का जीवन है, इसीलिए उसे ''सर्वायुष'' अर्थात् 'सबका जीवन-तत्त्व' कहा जाता है। वस्तुतः जो 'ब्रह्म' की 'प्राण' के रूप में उपासना करते हैं वे 'जीवन' पर पूर्ण प्रभुत्व प्राप्त कर लेते हैं; क्योंकि 'प्राण' ही समस्त भूत-पदार्थों का जीवन है, इसीलिए उसे 'सर्वायुष ''अर्थात् 'सबका जीवनतत्त्व' कहा जाता है। और यह प्राणमय 'आत्मरूप' पूर्वरूप शरीर जो अन्नमय था, उसके अन्दर आत्मा है।\nइस प्राणमय 'आत्मा' से भिन्न, एक अन्य 'अन्तरात्मा' है जो 'मनस्तत्त्व' से निर्मित है: मनोमय आत्मा। इस 'मनोमय आत्मा' से यह 'प्राणमय आत्मा' परिव्याप्त रहता है। और यह 'मनोमय आत्मा' मानवाकार में ही रचित है; जिस प्रकार अन्य का भी मानव रूप है उसी प्रकार इसका भी मानव रूप है। यजुर्वेद जिसका शिर है, ऋग्वेद उसका दक्षिण पक्ष है तथा सामवेद उसका वाम पक्ष है: परम 'आदेश' उसकी आत्मा है जो कि उसका आत्मस्वरूप है। अथर्व अंगिरस उसका निम्न अंग है जिस पर वह स्थिररूप से प्रतिष्ठित है। जिसके विषय में 'श्रुति' का यह वचन है।"
}