{
    "verse_no": "२-७",
    "verse": "असद् वा इदमग्र आसीत्‌। ततो वै सदजायत। तदात्मानं स्वयमकुरुत। तस्मात् तत्सुकृतमुच्यत इति। यद्वै तत्सुकृतम्‌। रसो वै सः। रसं ह्येवायं लब्ध्वानन्दी भवति। को ह्येवान्यात् कः प्राण्यात्‌। यदेष आकाश आनन्दो न स्यात्‌। एष ह्येवानन्द याति। यदा ह्येवैष एतस्मिन्नदृश्येऽनात्म्येऽनिरुक्तेऽनिलयनेऽभयं प्रतिष्ठां विन्दते। अथ सोऽभयं गतो भवति। यदा ह्येवैष एतस्मिन्नुदरमन्तरं कुरुते। थ तस्य भयं भवति। तत्वेव भयं विदुषो मन्वानस्य।तदप्येष श्लोको भवति॥",
    "upanishad-org": {
        "terms": {
            "glossary": "अग्रे - agre - in the beginning | असत् वै - asat vai - Non-Existent and Unmanifest | इदम् आसीत् - idam āsīt - all this Universe was | ततः वै - tataḥ vai - from which | सत् - sat - this manifest Existence | अजायत - ajāyata - was born | तत् - tat - that itself | आत्मानम् स्वयम् अकुरुत - ātmānam svayam akuruta - created itself (none other created it) | तस्मात् - tasmāt - therefore | तत् सुकृतम् - tat sukṛtam - the well and beautifully made | इति उच्यते - iti ucyate - they say of it | यत् वै - yat vai - this that is | तत् सुकृतम् - tat sukṛtam - is well and beautifully made | सः वै - saḥ vai - verily it is (no other than) | रसः - rasaḥ - the delight behind existence | अयम् रसम् - ayam rasam - this delight | हि लब्ध्वा - hi labdhvā - when he hath gotten | आनन्दी भवति - ānandī bhavati - a thing of bliss then it is that this creature becometh | कः हि एव अन्यात् - kaḥ hi eva anyāt - for who could labour to draw in the breath ? | कः प्राण्यात् - kaḥ prāṇyāt - who could have strength to breathe it out | यत् एषः आनन्दः - yat eṣaḥ ānandaḥ - that this Bliss | आकाशे - ākāśe - in the heaven of his heart | न स्यात् - na syāt - if there were not | एषः हि एव - eṣaḥ hi eva - it is He that | आनन्दायाति - ānandāyāti - is the fountain of bliss | एषः - eṣaḥ - he that is the fountain of bliss | यदा हि एव - yadā hi eva - for when | अदृश्ये - adṛśye - in the Invisible | अनात्म्ये - anātmye - in the Bodiless | अनिरुक्ते - anirukte - in the Undefinable | अनिलयने - anilayane - in the Unhoused Eternal | अभयम् प्रतिष्ठाम् - abhayam pratiṣṭhām - his refuge and firm foundation | विन्दते - vindate - findeth | अथ - atha - then | सः - saḥ - he | अभयम् गतः भवति - abhayam gataḥ bhavati - hath passed beyond the reach of Fear | यदा हि एव - yadā hi eva - but when | एषः - eṣaḥ - the Spirit | एतस्मिन् - etasmin - that is within us | उ दरम् अन्तरम् कुरुते - u daram antaram kurute - maketh for himself even a little difference in the Eternal | अथ - atha - then | तस्य भयम् भवति - tasya bhayam bhavati - he hath fear | तत् तु एव - tat tu eva - the Eternal himself | अमन्वानस्य - amanvānasya - a knower who thinketh not | विदुष्सः भयम् - viduṣsaḥ bhayam - becometh a terror ? | तत् अपि - tat api - whereof | एषः श्लोकः भवति - eṣaḥ ślokaḥ bhavati - this is the Scripture |"
        },
        "meaning": "In the beginning all this Universe was NonExistent and Unmanifest, from which this manifest Existence was born. Itself created itself; none other created it. Therefore they say of it the well and beautifully made. Lo this that iswell and beautifully made, verily it is no other than the delight behind existence. When he hath gotten him this delight, then it is that this creature becometh a thing of bliss; for who could labour to draw in the breath or who could have strength to breathe it out, if there were not that Bliss in the heaven of his heart, the ether within his being? It is He that is the fountain of bliss; for when the Spirit that is within us findeth his refuge and firm foundation in the Invisible Bodiless Undefinable and Unhoused Eternal, then he hath passed beyond the reach of Fear. But when the Spirit that is within us maketh for himself even a little difference in the Eternal, then he hath fear, yea the Eternal himself becometh a terror to such a knower who thinketh not. Whereof this is the Scripture.",
        "meaning-hindi": "आरम्भ में यह सम्पूर्ण विश्व 'असत्' (अस्तित्वहीन) एवं 'अव्यक्त' था, इसी में से इस 'व्यक्त सत्ता' का प्रादुर्भाव हुआ। उसने अपना सृजन 'स्वयं' ही किया; अन्य किसी ने उसको नहीं सृजा। इसी कारण इसके सम्बन्ध में कहा जाता है यह 'सुकृत' अर्थात् बहुत सुचारु एवं सुन्दर रूप से रचा गया है। और यह जो बहुत अच्छी तरह तथा सुन्दरता से रचा गया है यह वस्तुतः अन्य कुछ नहीं, इस अस्तित्व के पीछे छिपा हुआ आनन्द, रस ही है। जब प्राणी इस आनन्द को, इस रस को प्राप्त कर लेता है तो वह स्वयं आनन्दमय बन जाता है; कारण, यदि उसकी सत्ता के हृदयाकाश में यह आनन्द न हो तो कौन है जो प्राणों को अन्दर ले पाने का श्रम कर पायेगा अथवा किसके पास प्राणों को बाहर छोड़ने की शक्ति होगी? 'यही' है जो आनन्द का स्रोत है; क्योंकि जब हमारी 'अन्तरात्मा' उस 'अदृश्य', 'अशरीरी' (अनात्म्य) अनिर्दशं (अनिरुक्त) एवं 'अनिलयन' 'ब्रह्म' में आश्रय ग्रहण करके दृढ़ रूप से 'उस' प्रतिष्ठित हो जाता है, तब वह 'भय' की पकड़ से बाहर हो जाता है। किन्तु जब हमारी 'अन्तरात्मा' स्वयं के लिए 'ब्रह्म ' में स्वल्पमात्र भी भेद करती है, तो वह भयभीत होता है; जो विद्वान् मननशील नहीं है, उसके लिए स्वयं 'ब्रह्म' ही एक भय बन जाता है। जिसके विषय में 'श्रुति' का यह वचन है।"
    },
    "terms": {
        "असद्": "non-existence",
        "वा": "or",
        "इदम्": "this",
        "अग्र": "in the beginning",
        "आसीत्": "was",
        "ततः": "from that",
        "वै": "indeed",
        "सद्": "existence",
        "जायते": "is born",
        "तदात्मानं": "that self",
        "स्वयं": "on its own",
        "अकुरुत्": "does",
        "तस्मात्": "from that",
        "तत्": "that",
        "सुकृतं": "good action",
        "उच्यते": "is called",
        "इति": "thus",
        "यद्वै": "indeed that",
        "रसो": "essence",
        "सः": "he",
        "रसं": "essence",
        "ह्येव": "indeed",
        "अयम्": "this",
        "लब्ध्वा": "having attained",
        "आनन्दी": "joyful",
        "भवति": "is",
        "को": "who?",
        "ह्येवान्यात्": "indeed, apart from this",
        "कः": "who?",
        "प्राण्यात्": "can live?",
        "यदेष": "which is",
        "आकाश": "space",
        "आनन्दः": "joy",
        "न": "not",
        "स्यात्": "be",
        "एष": "this",
        "याति": "attains",
        "यदा": "when",
        "ह्येवैष": "indeed, this",
        "एतस्मिन्": "in this",
        "अदृश्ये": "imperceptible",
        "अनात्म्ये": "non-self",
        "अनिरुक्ते": "unmanifest",
        "अनिलयने": "non-abiding",
        "अभयं": "fearlessness",
        "प्रतिष्ठां": "foundation",
        "विन्दते": "finds",
        "अथ": "then",
        "गतः": "attains",
        "उदरमन्तरं": "internal world",
        "कुरुते": "creates",
        "तद्": "then",
        "तस्य": "his",
        "भयं": "fear",
        "तत्वेव": "truly",
        "विदुषः": "the wise",
        "मन्वानस्य": "of a contemplative mind",
        "तद् अपि": "nonetheless",
        "एषः": "this",
        "श्लोकः": "verse"
    },
    "meaning": "In the beginning, there was either non-existence or this. From that, existence is born. That self creates itself. Therefore, it is called good action. Truly, that good action is the essence. Having attained it, one becomes joyful. Apart from this, who can live? Which space will not be joyful? This alone attains joy. When this imperceptible, non-self, unmanifest, non-abiding, and foundation of fearlessness is found, then one attains fearlessness. But when this creates the internal world, fear arises. Truly, the wise contemplative mind knows this fear. Nonetheless, this verse is."
}