{
    "verse":   "धन्योऽहं कृतकृत्योऽहं विमुक्तोऽहं भवग्रहात् । नित्यानन्दस्वरूपोऽहं पूर्णोऽहं त्वदनुग्रहात् ॥ (विवेक चूड़ामणि)",
    "terms":  {
        "धन्योऽहं (Dhanyo aham)":  " I am blessed",
        "कृतकृत्योऽहं (Kritakrityo aham)":  " I have accomplished my tasks/goals",
        "विमुक्तोऽहं (Vimukto aham)":  " I am liberated",
        "भवग्रहात् (Bhavagrahat)":  " from the grip of worldly existence/sufferings",
        "नित्यानन्दस्वरूपोऽहं (Nityananda svarupo aham)":  " I am of the nature of eternal bliss",
        "पूर्णोऽहं (Purno aham)":  " I am complete",
        "त्वदनुग्रहात् (Tvad anugrahāt)":  " by your grace"
    },
    "meaning":   "Explanation This verse is from the Vivekachudamani, a philosophical text written by Adi Shankaracharya. The verse expresses the realization of the self or the individual soul.The verse begins with the statement "Dhanyo aham" which means "I am blessed". It signifies a sense of gratitude and contentment. The individual recognizes the divine grace and blessings upon themselves.The next phrase, "Kritakrityo aham", means "I have accomplished my tasks/goals". It signifies a sense of fulfillment and completion. The individual realizes that they have fulfilled their responsibilities and achieved their objectives.The following phrase, "Vimukto aham", means "I am liberated". It implies liberation from the cycle of birth and death, and from the sufferings of worldly existence. The individual realizes a state of freedom and liberation from the bondage of ignorance.The next line, "Bhavagrahat", refers to the grip of worldly existence or the suffering caused by the cycle of birth and death. The individual recognizes that they have been liberated and freed from this suffering.The phrase, "Nityananda svarupo aham", means "I am of the nature of eternal bliss". It indicates that the true nature of the self is eternal bliss, beyond the temporary happiness and sorrows experienced in the world.The verse concludes with the statement "Purno aham tvad anugrahāt" which means "I am complete, by your grace". It acknowledges that the individual's completeness and realization of their true self is due to the grace and blessings of the divine.Overall, this verse expresses the individual's realization of their true nature as a divine being, liberated from worldly attachments and suffering, and experiencing eternal bliss and completeness. It emphasizes gratitude and the recognition of the divine grace that has made this realization possible."
}