{
    "verse": "नाथेतिश्रुतयो न तत्त्वमतयो घोषस्थिता गोपिका।\\n जारिण्यः कुल जाति धर्म विमुखा अध्यात्म भावं ययुः\\n भक्तिर्यस्य ददाति मुक्तिमतुलां जारस्य यः सद्गति,\\n र्ह्यार्तत्राण परायणः स भगवान् नारायणो मे गतिः॥ (शंकराचार्य)",
    "terms": {
        "नाथेति": "स्वामीन् इति (भगवान्)",
        "श्रुतयः": "श्रुति: (वेदाः)",
        "न": "न (अपि)",
        "तत्त्वमतयः": "तत्त्वसिद्धिं न प्राप्ताः",
        "घोषस्थिताः": "घोष: निवासिनि",
        "गोपिकाः": "गोपिकाः (स्त्रियः)",
        "जारिण्यः": "बुद्धिवादिनः",
        "कुलजातिधर्मविमुखाः": "कुल, जाति, धर्म नष्टा:",
        "अध्यात्मभावं": "आत्मनि प्रवृत्तिं",
        "ययुः": "गतिं यान्ति",
        "भक्तिः": "भक्ति:",
        "यस्य": "यस्य (भगवतः)",
        "ददाति": "दत्त्वा (प्रददाति)",
        "मुक्तिमतुलां": "मुक्तिं सर्वेषां मुख्यतराम्",
        "जारस्य": "जरस्य (संसारस्य)",
        "यः": "यः",
        "सद्गतिः": "सत्परायण गति:",
        "अर्थत्राण": "एतद्वारण कारणं भवः",
        "परायणः": "परं परम्परया एकंतं प्राप्ताः",
        "सः": "स: (च तत्त्वतः)",
        "स भगवान् नारायणः": "तस्मिन् परमेश्वरे श्रीनारायणे अस्ति"
    },

  "meaning": "नाथेति श्रुतयः न तत्त्वमतयः घोषस्थिताः गोपिकाः।जारिण्यः कुलजातिधर्मविमुखाः अध्यात्मभावं ययुः॥भक्तिर्यस्य ददाति मुक्तिमतुलां जारस्य यः सद्गतिः।र्ह्यार्तत्राण परायणः स स भगवान् नारायणो मे गतिः॥Meaning:The verse is attributed to Adi Shankaracharya and describes the qualities and actions of different individuals.The Gopikas (milkmaidens) are mentioned as the group of women who constantly chant the name of Lord Krishna as \"Natha\" meaning \"O Lord\" and are immersed in devotion and love for Him. They are not interested in discussions about the Vedas and philosophical truths (Tattvamata).On the other hand, there are those who have lost their sense of duty, ascribed to their caste and family traditions, and disregarded the importance of spiritual growth (Adhyatmabhavam). They are referred to as \"Jarinis\" or those with deluded intellects.The verse further states that true devotion (Bhakti) grants one the ultimate liberation (Mukti), surpassing any other attainment. This realization of Mukti is the ultimate goal for a seeker. The one who attains this state is considered to be the refuge for those who are suffering (Arthatran), deeply devoted to the Supreme (Parayanah), and such a being is recognized as Lord Narayana, the supreme deity and ultimate destination."
}