{
    "verse_no": "१-१-११",
    "verse": "भूरीणि भूरिकर्माणि श्रोतव्यानि विभागशः ।\nअतः साधोऽत्र यत्सारं समुद्‍धृत्य मनीषया ।\nब्रूहि न श्रद्धानानां येनात्मा सम्प्रसीदति",
    "vedabase": {
        "terms": {
            "bhūrīṇi": "multifarious",
            "bhūri": "many",
            "karmāṇi": "duties",
            "śrotavyāni": "to be learned",
            "vibhāgaśaḥ": "by divisions of subject matter",
            "ataḥ": "therefore",
            "sādho": "O sage",
            "atra": "herein",
            "yat": "whatever",
            "sāram": "essence",
            "samuddhṛtya": "by selection",
            "manīṣayā": "to the best of your knowledge",
            "brūhi": "please tell us",
            "bhadrāya": "for the good of",
            "bhūtānām": "the living beings",
            "yena": "by which",
            "ātmā": "the self",
            "suprasīdati": "becomes fully satisfied."
        },
        "translation": "There are many varieties of scriptures, and in all of them there are many prescribed duties, which can be learned only after many years of study in their various divisions. Therefore, O sage, please select the essence of all these scriptures and explain it for the good of all living beings, that by such instruction their hearts may be fully satisfied.  ",
        "purport": "Ātmā, or self, is distinguished from matter and material elements. It is spiritual in constitution, and thus it is never satisfied by any amount of material planning. All scriptures and spiritual instructions are meant for the satisfaction of this self, or ātmā. There are many varieties of approaches which are recommended for different types of living beings in different times and at different places. Consequently, the numbers of revealed scriptures are innumerable. There are different methods and prescribed duties recommended in these various scriptures. Taking into consideration the fallen condition of the people in general in this Age of Kali, the sages of Naimiṣāraṇya suggested that Śrī Sūta Gosvāmī relate the essence of all such scriptures because in this age it is not possible for the fallen souls to understand and undergo all the lessons of all these various scriptures in a varṇa and āśrama system. The varṇa and āśrama society was considered to be the best institution for lifting the human being to the spiritual platform, but due to Kali-yuga it is not possible to execute the rules and regulations of these institutions. Nor is it possible for the people in general to completely sever relations with their families as the varṇāśrama institution prescribes. The whole atmosphere is surcharged with opposition. And considering this, one can see that spiritual emancipation for the common man in this age is very difficult. The reason the sages presented this matter to Śrī Sūta Gosvāmī is explained in the following verses."
    },
    "gpt": {
        "terms": {
            "भूरीणि भूरिकर्माणि": "There are numerous actions and duties",
            "श्रोतव्यानि विभागशः": "They are to be heard and understood categorically",
            "अतः साधोऽत्र यत्सारं समुद्धृत्य मनीषया": "Therefore, O noble one, grasping the essence of all these actions",
            "ब्रूहि न श्रद्धानानां येनात्मा सम्प्रसीदति": "Tell me, by which one's soul becomes content"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "bhūrīṇi bhūri karmāṇi": "many many actions",
            "śrotavyāni": "are to be heard",
            "vibhāgaśaḥ": "in detail",
            "ataḥ": "therefore",
            "sādho": "O ascetic",
            "atra": "here",
            "yat sāram": "the essence",
            "samuddhṛtya": "having extracted",
            "manīṣayā": "with intelligence",
            "brūhi": "speak",
            "bhadrāya": "for the good",
            "bhūtānām": "of beings",
            "yena": "which",
            "ātmā": "self",
            "suprasīdati": "is pleased"
        },
        "meaning": "Many many actions are to be heard in detail. Therefore, O ascetic, here extract the essence with intelligence and speak for the good of beings, which self is pleased."
    }
}