{
    "verse_no": "१-२-१०",
    "verse": "कामस्य नेन्द्रियप्रीतिर्लाभो जीवेत यावता ।\nजीवस्य तत्त्वजिज्ञासा नार्थो यश्चेह कर्मभि: ॥",
    "vedabase": {
        "terms": {
            "kāmasya": "of desires",
            "na": "not",
            "indriya": "senses",
            "prītiḥ": "satisfaction",
            "lābhaḥ": "gain",
            "jīveta": "self-preservation",
            "yāvatā": "so much so",
            "jīvasya": "of the living being",
            "tattva": "the Absolute Truth",
            "jijñāsā": "inquiries",
            "arthaḥ": "end",
            "yaḥ ca iha": "whatsoever else",
            "karmabhiḥ": "by occupational activities."
        },
        "translation": "Life’s desires should never be directed toward sense gratification. One should desire only a healthy life, or self-preservation, since a human being is meant for inquiry about the Absolute Truth. Nothing else should be the goal of one’s works.  ",
        "purport": "The completely bewildered material civilization is wrongly directed towards the fulfillment of desires in sense gratification. In such civilization, in all spheres of life, the ultimate end is sense gratification. In politics, social service, altruism, philanthropy and ultimately in religion or even in salvation, the very same tint of sense gratification is ever-increasingly predominant. In the political field the leaders of men fight with one another to fulfill their personal sense gratification. The voters adore the so-called leaders only when they promise sense gratification. As soon as the voters are dissatisfied in their own sense satisfaction, they dethrone the leaders. The leaders must always disappoint the voters by not satisfying their senses. The same is applicable in all other fields; no one is serious about the problems of life. Even those who are on the path of salvation desire to become one with the Absolute Truth and desire to commit spiritual suicide for sense gratification. But the Bhāgavatam says that one should not live for sense gratification. One should satisfy the senses only insomuch as required for self-preservation, and not for sense gratification. Because the body is made of senses, which also require a certain amount of satisfaction, there are regulative directions for satisfaction of such senses. But the senses are not meant for unrestricted enjoyment. For example, marriage or the combination of a man with a woman is necessary for progeny, but it is not meant for sense enjoyment. In the absence of voluntary restraint, there is propaganda for family planning, but foolish men do not know that family planning is automatically executed as soon as there is search after the Absolute Truth. Seekers of the Absolute Truth are never allured by unnecessary engagements in sense gratification because the serious students seeking the Absolute Truth are always overwhelmed with the work of researching the Truth. In every sphere of life, therefore, the ultimate end must be seeking after the Absolute Truth, and that sort of engagement will make one happy because he will be less engaged in varieties of sense gratification. And what that Absolute Truth is is explained as follows."
    },
    "gpt": {
        "terms": {
            "कामस्य": "of desire",
            "नेन्द्रियप्रीतिः": "pleasure of the senses",
            "लाभः": "acquisition",
            "जीवेत": "one should live",
            "यावता": "as long as",
            "जीवस्य": "of a living being",
            "तत्त्वजिज्ञासा": "inquiry into the nature of the self",
            "नार्थः": "purpose",
            "यश्चेह": "in this",
            "कर्मभिः": "through actions"
        },
        "meaning": " The verse urges individuals to engage in the inquiry and exploration of the true nature of the self. This refers to self realization or self-knowledge, which is the understanding of one's true identity beyond the temporary physical body and material desires. It encourages a deeper introspection into the nature of consciousness, existence, and the meaning of life."
    },
    "bard": {
        "terms": {
            "kāmasya": "of desire",
            "na": "not",
            "indriya": "sense organs",
            "prītiḥ": "pleasure",
            "lābhaḥ": "gain",
            "jīveta": "live",
            "yāvatā": "as long as",
            "jīvasya": "of the living being",
            "tattva": "truth",
            "jijñāsā": "search",
            "arthaḥ": "goal",
            "yaḥ": "which",
            "ca": "and",
            "iha": "here",
            "karmabhiḥ": "by actions",
            "desire": "not sense organs pleasure gain live as long as living beings truth search goal which and here by actions"
        },
        "meaning": ""
    }
}