{
    "verse_no": "१-३-४०",
    "verse": "इदं भागवतं नाम पुराणं ब्रह्मसम्मितम् ।\nउत्तमश्लोकचरितं चकार भगवानृषिः ।\nनिःश्रेयसाय लोकस्य धन्यं स्वस्त्ययनं महत् ॥",
    "vedabase": {
        "terms": {
            "idam": "this",
            "bhāgavatam": "book containing the narration of the Personality of Godhead and His pure devotees",
            "nāma": "of the name",
            "purāṇam": "supplementary to the Vedas",
            "brahma-sammitam": "incarnation of Lord Śrī Kṛṣṇa",
            "uttama-śloka": "of the Personality of Godhead",
            "caritam": "activities",
            "cakāra": "compiled",
            "bhagavān": "incarnation of the Personality of Godhead",
            "ṛṣiḥ": "Śrī Vyāsadeva",
            "niḥśreyasāya": "for the ultimate good",
            "lokasya": "of all people",
            "dhanyam": "fully successful",
            "svasti-ayanam": "all-blissful",
            "mahat": "all-perfect."
        },
        "translation": "This Śrīmad-Bhāgavatam is the literary incarnation of God, and it is compiled by Śrīla Vyāsadeva, the incarnation of God. It is meant for the ultimate good of all people, and it is all-successful, all-blissful and all-perfect.  ",
        "purport": "Lord Śrī Caitanya Mahāprabhu declared that Śrīmad-Bhāgavatam is the spotless sound representation of all Vedic knowledge and history. There are selected histories of great devotees who are in direct contact with the Personality of Godhead. Śrīmad-Bhāgavatam is the literary incarnation of Lord Śrī Kṛṣṇa and is therefore nondifferent from Him. Śrīmad-Bhāgavatam should be worshiped as respectfully as we worship the Lord. Thereby we can derive the ultimate blessings of the Lord through its careful and patient study. As God is all light, all bliss and all perfection, so also is Śrīmad-Bhāgavatam. We can have all the transcendental light of the Supreme Brahman, Śrī Kṛṣṇa, from the recitation of Śrīmad-Bhāgavatam, provided it is received through the medium of the transparent spiritual master. Lord Caitanya’s private secretary Śrīla Svarūpa Dāmodara Gosvāmī advised all intending visitors who came to see the Lord at Purī to make a study of the Bhāgavatam from the person Bhāgavatam. Person Bhāgavatam is the self-realized bona fide spiritual master, and through him only can one understand the lessons of Bhāgavatam in order to receive the desired result. One can derive from the study of the Bhāgavatam all benefits that are possible to be derived from the personal presence of the Lord. It carries with it all the transcendental blessings of Lord Śrī Kṛṣṇa that we can expect from His personal contact."
    },
    "gpt": {
        "terms": {
            "इदं": "This",
            "भागवतं": "Bhagavatam (another name for the Srimad Bhagavatam, a revered Hindu scripture)",
            "नाम": "named",
            "पुराणं": "Purana (a genre of ancient Hindu scriptures)",
            "ब्रह्मसम्मितम्": "which is revered as equivalent to Brahman (the ultimate reality)",
            "उत्तमश्लोकचरितं": "having the best verses and stories",
            "चकार": "compiled",
            "भगवानृषिः": "by the divine sage",
            "निःश्रेयसाय": "for the ultimate good/benefit",
            "लोकस्य": "of the people",
            "धन्यं": "blessed",
            "स्वस्त्ययनं": "as the means of prosperity",
            "महत्": "great"
        },
        "meaning": "Meaning:This Bhagavatam, named as such and revered as equivalent to Brahman, was compiled by the divine sage. It contains the best verses and stories, and is considered to be a great source of ultimate good and blessings for the people, leading them towards prosperity."
    },
    "bard": {
        "terms": {
            "idaṁ": "this",
            "bhāgavatam": "bhāgavata",
            "nāma": "name",
            "purāṇam": "purāṇa",
            "brahma-sammitam": "brahma-sammita",
            "uttama-śloka": "uttama-śloka",
            "caritam": "carita",
            "cakāra": "cakāra",
            "bhagavān": "bhagavān",
            "ṛṣiḥ": "ṛṣi",
            "niḥśreyasāya": "niḥśreyasāya",
            "lokasya": "lokasya",
            "dhanyam": "dhanyam",
            "svasti-ayanam": "svasti-ayanam",
            "mahat": "mahat",
            "This": "idaṁ",
            "Bhāgavatam": "bhāgavata",
            "Name": "nāma",
            "Purāṇam": "purāṇa",
            "Brahma-sammitam": "brahma-sammita",
            "Uttama-śloka": "uttama-śloka",
            "Carita": "carita",
            "Cakára": "cakāra",
            "Bhagavān": "bhagavān",
            "Ṛṣi": "ṛṣi",
            "Niḥśreyasāya": "niḥśreyasāya",
            "Lokasya": "lokasya",
            "Dhanyaṁ": "dhanyam",
            "Svasti-ayanam": "svasti-ayanam",
            "Mahat": "mahat"
        },
        "meaning": "This is the name of the Bhāgavata Purāṇa which is full of brahman, and which is a supreme poem composed by the divine sage for the welfare of the world."
    }
}