{
    "verse_no": "१-३-३८",
    "verse": "स वेद धातु: पदवीं परस्य दुरन्तवीर्यस्य रथाङ्गपाणे: । \nयोऽमायया सन्ततयानुवृत्त्या भजेत तत्पादसरोजगन्धम् ॥",
    "vedabase": {
        "terms": {
            "saḥ": "He alone",
            "veda": "can know",
            "dhātuḥ": "of the creator",
            "padavīm": "glories",
            "parasya": "of the transcendence",
            "duranta-vīryasya": "of the greatly powerful",
            "ratha-aṅga-pāṇeḥ": "of Lord Kṛṣṇa, who bears in His hand the wheel of a chariot",
            "yaḥ": "one who",
            "amāyayā": "without reservation",
            "santatayā": "without any gap",
            "anuvṛttyā": "favorably",
            "bhajeta": "renders service",
            "tat-pāda": "of His feet",
            "saroja-gandham": "fragrance of the lotus."
        },
        "translation": "Only those who render unreserved, uninterrupted, favorable service unto the lotus feet of Lord Kṛṣṇa, who carries the wheel of the chariot in His hand, can know the creator of the universe in His full glory, power and transcendence.  ",
        "purport": "Only the pure devotees can know the transcendental name, form and activities of Lord Kṛṣṇa due to their being completely freed from the reactions of fruitive work and mental speculation. The pure devotees have nothing to derive as personal profit from their unalloyed service to the Lord. They render incessant service to the Lord spontaneously, without any reservation. Everyone within the creation of the Lord is rendering service to the Lord indirectly or directly. No one is an exception to this law of the Lord. Those who are rendering service indirectly, being forced by the illusory agent of the Lord, are rendering service unto Him unfavorably. But those who are rendering service unto Him directly under the direction of His beloved agent are rendering service unto Him favorably. Such favorable servitors are devotees of the Lord, and by the grace of the Lord they can enter into the mysterious region of transcendence by the mercy of the Lord. But the mental speculators remain in darkness all the time. As stated in Bhagavad-gītā, the Lord Himself guides the pure devotees toward the path of realization due to their constant engagement in the loving service of the Lord in spontaneous affection. That is the secret of entering into the kingdom of God. Fruitive activities and speculation are no qualifications for entering."
    },
    "gpt": {
        "terms": {
            "Word": "by-word breakdown:",
            "सः (saḥ)": "He",
            "वेत् (vet)": "knows",
            "धातुः (dhātuḥ)": "the root (of knowledge)",
            "पदवीं (padavīṁ)": "the path or the destination",
            "परस्य (pasya)": "of the supreme",
            "दुरन्तवीर्यस्य (durantavīryasya)": "of the immensely courageous",
            "रथाङ्गपाणेः (rathāṅgapāṇeḥ)": "the one with hands ready to wield the chariot",
            "यः (yaḥ)": "Who",
            "अमायया (amāyayā)": "with unwavering devotion",
            "सन्ततया (santatayā)": "constantly",
            "अनुवृत्त्या (anuvṛttyā)": "in accordance with",
            "भजेत (bhajeta)": "serves or adores",
            "तत्पादसरोजगन्धम् (tatpādasarojagandham)": "the fragrance of the lotus feet"
        },
        "meaning": "स वेद धातुः पदवीं परस्य दुरन्तवीर्यस्य रथाङ्गपाणेः। योऽमायया सन्ततया अनुवृत्त्या भजेत तत्पादसरोजगन्धम् ॥Meaning:He who knows the root of knowledge and the path to the destination of the supreme, the one with immense courage and hands ready to wield the chariot.One who serves or adores with unwavering devotion, constantly in accordance with the path, the fragrance of the lotus feet."
    },
    "bard": {
        "terms": {
            "saḥ": "He",
            "veda": "knows",
            "dhātuḥ": "essence",
            "padavīm": "feet",
            "parasya": "of that one",
            "durantā-vīryasya": "of great strength",
            "ratha-aṅga-pāṇeḥ": "having arms like chariot wheels",
            "yaḥ": "who",
            "amāyayā": "without illusion",
            "santatayā": "continuously",
            "anuvṛttyā": "with devotion",
            "bhajeta": "worships",
            "tat-pāda": "that feet",
            "saroja-gandham": "lotus-like fragrance"
        },
        "meaning": "He knows the essence of the feet of that one of great strength, who has arms like chariot wheels, who worships with devotion, continuously and without illusion, that feet which have the fragrance of lotus."
    }
}