{
    "verse_no": "१-५-८",
    "verse": "भवतानुदितप्रायं यशो भगवतोऽमलम् ।\nयेनैवासौ न तुष्येत मन्ये तद्दर्शनं खिलम् ॥",
    "vedabase": {
        "terms": {
            "śrī-nāradaḥ": "Śrī Nārada",
            "uvāca": "said",
            "bhavatā": "by you",
            "anudita-prāyam": "almost not praised",
            "yaśaḥ": "glories",
            "bhagavataḥ": "of the Personality of Godhead",
            "amalam": "spotless",
            "yena": "by which",
            "eva": "certainly",
            "asau": "He (the Personality of Godhead)",
            "na": "does not",
            "tuṣyeta": "be pleased",
            "manye": "I think",
            "tat": "that",
            "darśanam": "philosophy",
            "khilam": "inferior."
        },
        "translation": "Śrī Nārada said: You have not actually broadcast the sublime and spotless glories of the Personality of Godhead. That philosophy which does not satisfy the transcendental senses of the Lord is considered worthless.  ",
        "purport": "The eternal relation of an individual soul with the Supreme Soul Personality of Godhead is constitutionally one of being the eternal servitor of the eternal master. The Lord has expanded Himself as living beings in order to accept loving service from them, and this alone can satisfy both the Lord and the living beings. Such a scholar as Vyāsadeva has completed many expansions of the Vedic literatures, ending with the Vedānta philosophy, but none of them have been written directly glorifying the Personality of Godhead. Dry philosophical speculations even on the transcendental subject of the Absolute have very little attraction without directly dealing with the glorification of the Lord. The Personality of Godhead is the last word in transcendental realization. The Absolute realized as impersonal Brahman or localized Supersoul, Paramātmā, is less productive of transcendental bliss than the supreme personal realization of His glories. The compiler of the Vedānta-darśana is Vyāsadeva himself. Yet he is troubled, although he is the author. So what sort of transcendental bliss can be derived by the readers and listeners of Vedānta which is not explained directly by Vyāsadeva, the author? Herein arises the necessity of explaining Vedānta-sūtra in the form of Śrīmad-Bhāgavatam by the self-same author."
    },
    "gpt": {
        "terms": {
            "भवतानुदितप्रायं": "(bhavatānuditaprāyaṁ) - Most of you (referring to all present)",
            "यशो भगवतोऽमलम्": "(yaśo bhagavato'malam) - The pure glory of the Lord",
            "येनैवासौ न तुष्येत": "(yenaivāsau na tuṣyeta) - By which alone he is not pleased",
            "मन्ये तद्दर्शनं खिलम्": "(manye taddarśanaṁ khilam) - I consider that as complete knowledge"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "śrī-nāradaḥ": "` śrī + narada` = `Sri Narada`",
            "uvāca": "` √vac + a + ā` = `say`",
            "bhavatā": "` bhav + ā + ta` = `by you`",
            "anudita-prāyam": "` anu + √dī + ta + prāya` = `praised continually`",
            "yaśaḥ": "` yaś + a` = `glory`",
            "bhagavataḥ": "` bhaga + vat + a` = `of the Lord`",
            "amalam": "` a + mala` = `pure`",
            "yena": "` ya + na` = `which`",
            "eva": "` eva` = `indeed`",
            "asau": "` asu` = `he`",
            "na": "` na` = `not`",
            "tuṣyeta": "` √tus + ya` = `be satisfied`",
            "manye": "` manya + e` = `I think`",
            "tat": "` tat` = `that`",
            "darśanam": "` √darś + a + na` = `sight`",
            "khilam": "` khil + a` = `little`"
        },
        "meaning": "श्री-नारदः उवाच भवता anudita-prāyam यशः bhagavataḥ amalam येन eva asau न tuṣyeta manye tat darśanam khilamSri Narada said, your continually praised glory, pure of the Lord, which indeed he will not be satisfied, I think that sight little."
    }
}