{
    "verse_no": "१-७-११",
    "verse": "हरेर्गुणाक्षिप्तमतिर्भगवान् बादरायणिः ।\nअध्यगान्महदाख्यानं नित्यं विष्णुजनप्रियः ॥",
    "vedabase": {
        "terms": {
            "hareḥ": "of Hari, the Personality of Godhead",
            "guṇa": "transcendental attributes",
            "ākṣipta": "being absorbed in",
            "matiḥ": "mind",
            "bhagavān": "powerful",
            "bādarāyaṇiḥ": "the son of Vyāsadeva",
            "adhyagāt": "underwent studies",
            "mahat": "great",
            "ākhyānam": "narration",
            "nityam": "regularly",
            "viṣṇu-jana": "devotees of the Lord",
            "priyaḥ": "beloved."
        },
        "translation": "Śrīla Śukadeva Gosvāmī, son of Śrīla Vyāsadeva, was not only transcendentally powerful. He was also very dear to the devotees of the Lord. Thus he underwent the study of this great narration [Śrīmad-Bhāgavatam].  ",
        "purport": "According to Brahma-vaivarta Purāṇa, Śrīla Śukadeva Gosvāmī was a liberated soul even within the womb of his mother. Śrīla Vyāsadeva knew that the child, after his birth, would not stay at home. Therefore he (Vyāsadeva) impressed upon him the synopsis of the Bhāgavatam so that the child could be made attached to the transcendental activities of the Lord. After his birth, the child was still more educated in the subject of the Bhāgavatam by recitation of the actual poems. The idea is that generally the liberated souls are attached to the feature of impersonal Brahman with a monistic view of becoming one with the supreme whole. But by the association of pure devotees like Vyāsadeva, even the liberated soul becomes attracted to the transcendental qualities of the Lord. By the mercy of Śrī Nārada, Śrīla Vyāsadeva was able to narrate the great epic of Śrīmad-Bhāgavatam, and by the mercy of Vyāsadeva, Śrīla Śukadeva Gosvāmī was able to grasp the import. The transcendental qualities of the Lord are so attractive that Śrīla Śukadeva Gosvāmī became detached from being completely absorbed in impersonal Brahman and positively took up the personal activity of the Lord. Practically he was thrown from the impersonal conception of the Absolute, thinking within himself that he had simply wasted so much time in devoting himself to the impersonal feature of the Supreme, or in other words, he realized more transcendental bliss with the personal feature than the impersonal. And from that time, not only did he himself become very dear to the viṣṇu-janas, or the devotees of the Lord, but also the viṣṇu-janas became very dear to him. The devotees of the Lord, who do not wish to kill the individuality of the living entities and who desire to become personal servitors of the Lord, do not very much like the impersonalists, and similarly the impersonalists, who desire to become one with the Supreme, are unable to evaluate the devotees of the Lord. Thus from time immemorial these two transcendental pilgrims have sometimes been competitors. In other words, each of them likes to keep separate from the other because of the ultimate personal and impersonal realizations. Therefore it appears that Śrīla Śukadeva Gosvāmī also had no liking for the devotees. But since he himself became a saturated devotee, he desired always the transcendental association of the viṣṇu-janas, and the viṣṇu-janas also liked his association, since he became a personal Bhāgavata. Thus both the son and the father were completely cognizant of transcendental knowledge in Brahman, and afterwards both of them became absorbed in the personal features of the Supreme Lord. The question as to how Śukadeva Gosvāmī was attracted by the narration of the Bhāgavatam is thus completely answered by this śloka."
    },
    "gpt": {
        "terms": {
            "हरेः": "of Lord Hari (Vishnu)",
            "गुणाक्षिप्तमतिः": "the one whose mind is completely absorbed in the qualities",
            "भगवान्": "the divine one",
            "बादरायणिः": "Sage Vyasa, the author of the Mahabharata and the Vedanta Sutras",
            "अध्यगान्": "who recites",
            "महद्": "the great",
            "आख्यानं": "stories",
            "नित्यं": "constantly",
            "विष्णुजनप्रियः": "dear to the devotees of Vishnu"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "hareḥ": "hare   =  Lord Vishnu",
            "guṇa": "quality",
            "ākṣipta": "fix",
            "matiḥ": "mind",
            "bhagavān": "the lord",
            "bādarāyaṇiḥ": "badarayana",
            "adhyagāt": "learned",
            "mahat": "great",
            "ākhyānam": "story",
            "nityam": "always",
            "viṣṇu-jana": "devotees of Vishnu",
            "priyaḥ": "dear"
        },
        "meaning": "Lord Vishnu's quality fixed mind the lord badarayana learned great story always devotees of Vishnu dearLord Vishnu's quality fixed mind, the lord badarayana, learned great story, always devotees of Vishnu dear."
    }
}