{
    "verse_no": "१-८-३०",
    "verse": "जन्म कर्म च विश्वात्मन्नजस्याकर्तुरात्मन: ।\nतिर्यङ्‍नृषिषु याद:सु तदत्यन्तविडम्बनम् ॥",
    "vedabase": {
        "terms": {
            "janma": "birth",
            "karma": "activity",
            "ca": "and",
            "viśva-ātman": "O soul of the universe",
            "ajasya": "of the unborn",
            "akartuḥ": "of the inactive",
            "ātmanaḥ": "of the vital energy",
            "tiryak": "animal",
            "nṛ": "human being",
            "ṛṣiṣu": "in the sages",
            "yādaḥsu": "in the water",
            "tat": "that",
            "atyanta": "veritable",
            "viḍambanam": "bewildering."
        },
        "translation": "Of course it is bewildering, O soul of the universe, that You work, though You are inactive, and that You take birth, though You are the vital force and the unborn. You Yourself descend amongst animals, men, sages and aquatics. Verily, this is bewildering.  ",
        "purport": "The transcendental pastimes of the Lord are not only bewildering but also apparently contradictory. In other words, they are all inconceivable to the limited thinking power of the human being. The Lord is the all-prevailing Supersoul of all existence, and yet He appears in the form of a boar amongst the animals, in the form of a human being as Rāma, Kṛṣṇa, etc., in the form of a ṛṣi like Nārāyaṇa, and in the form of an aquatic like a fish. Yet it is said that He is unborn, and He has nothing to do. In the śruti mantra it is said that the Supreme Brahman has nothing to do. No one is equal to or greater than Him. He has manifold energies, and everything is performed by Him perfectly by automatic knowledge, strength and activity. All these statements prove without any question that the Lord’s activities, forms and deeds are all inconceivable to our limited thinking power, and because He is inconceivably powerful, everything is possible in Him. Therefore no one can calculate Him exactly; every action of the Lord is bewildering to the common man. He cannot be understood by the Vedic knowledge, but He can be easily understood by the pure devotees because they are intimately related with Him. The devotees therefore know that although He appears amongst the animals, He is not an animal, nor a man, nor a ṛṣi, nor a fish. He is eternally the Supreme Lord, in all circumstances."
    },
    "gpt": {
        "terms": {
            "जन्म": "birth",
            "कर्म": "actions",
            "च": "and",
            "विश्वात्मन्": "the universal self",
            "अजस्य": "of the unborn",
            "अकर्तुः": "non-doer",
            "आत्मनः": "of the self",
            "तिर्यङ्नृषिषु": "among animals and sages",
            "यादः": "seeking",
            "सु": "well",
            "तत्": "that",
            "अत्यन्तविडम्बनम्": "the utmost ignorance or delusion"
        },
        "meaning": " The verse highlights the concept of the universal self, which is unborn and a non doer of actions. It states that those individuals who are well-versed among animals and sages, yet seek to find the causes of birth and actions, are trapped in the utmost ignorance or delusion. Such individuals fail to understand the fundamental nature of the self as the eternal witness unaffected by the cycle of birth and actions."
    },
    "bard": {
        "terms": {
            "janma": "`birth`",
            "karma": "`action`",
            "ca": "`and`",
            "viśva-ātman": "`universal self`",
            "ajasya": "`unborn`",
            "akartuḥ": "`doer`",
            "ātmanaḥ": "`self`",
            "tiryak": "`against`",
            "nṛ": "`man`",
            "ṛṣiṣu": "`sages`",
            "yādaḥsu": "`and`",
            "tat": "`that`",
            "atyanta": "`very`",
            "viḍambanam": "`deceit`"
        },
        "meaning": "birth and action of unborn universal self against self in men and sages is very deceitful"
    }
}