{
    "verse_no": "१०-१४-३४",
    "verse": "तद् भूरिभाग्यमिह जन्म किमप्यटव्यां यद् गोकुलेऽपि कतमाङ्‍‍घ्रिरजोऽभिषेकम् ।\nयज्जीवितं तु निखिलं भगवान् मुकुन्दस्त्वद्यापि यत्पदरजः श्रुतिमृग्यमेव ॥",
    "vedabase": {
        "terms": {
            "tat": "that",
            "bhūri-bhāgyam": "the greatest good fortune",
            "iha": "here",
            "janma": "the birth",
            "kim api": "any whatsoever",
            "aṭavyām": "in the forest (of Vṛndāvana)",
            "yat": "whose",
            "gokule": "in Gokula",
            "api": "even",
            "katama": "of any (of the devotees)",
            "aṅghri": "of the feet",
            "rajaḥ": "by the dust",
            "abhiṣekam": "bathing",
            "jīvitam": "life",
            "tu": "but",
            "nikhilam": "whole",
            "bhagavān": "the Supreme Personality of Godhead",
            "mukundaḥ": "Lord Mukunda",
            "adya api": "even until now",
            "pāda-rajaḥ": "dust of the feet",
            "śruti": "by the Vedas",
            "mṛgyam": "sought after",
            "eva": "certainly."
        },
        "translation": "My greatest possible good fortune would be to take any birth whatever in this forest of Gokula and have my head bathed by the dust falling from the lotus feet of any of its residents. Their entire life and soul is the Supreme Personality of Godhead, Mukunda, the dust of whose lotus feet is still being searched for in the Vedic mantras.  ",
        "purport": "This verse indicates that Lord Brahmā desires to take birth even as the smallest blade of grass in Vṛndāvana so that the holy residents of the Lord’s abode may walk upon his head and bless him with the dust of their feet. Being realistic, Lord Brahmā does not aspire to directly achieve the dust of Lord Kṛṣṇa’s feet; rather, he aspires for the mercy of the Lord’s devotees. Śrīla Viśvanātha Cakravartī Ṭhākura explains that Brahmā is willing to take birth even as a stone in a paved footpath in the Lord’s abode. Since Brahmā is the creator of the entire universe, we can just imagine the glorious position of the residents of Vṛndāvana. The Lord’s devotees achieve their exalted position by unalloyed devotion and love. One cannot achieve such spiritual opulence by any puffed-up material process of personal improvement. In Kṛṣṇa, the Supreme Personality of Godhead, Śrīla Prabhupāda reveals the mind of Brahmā as follows: “But if I am not so fortunate to take birth within the forest of Vṛndāvana, I beg to be allowed to take birth outside the immediate area of Vṛndāvana so that when the devotees go out they will walk over me. Even that would be a great fortune for me. I am just aspiring for a birth in which I will be smeared by the dust of the devotees’ feet.”"
    },
    "gpt": {
        "terms": {
            "तद्": "Therefore",
            "भूरिभाग्यम्": "abundant fortune",
            "इह": "in this",
            "जन्म": "birth",
            "किमपि": "anything",
            "अटव्यां": "to be desired",
            "यत्": "which",
            "गोकुले": "in Gokula",
            "अपि": "even",
            "कतम्": "when",
            "अङ्घ्रिः": "feet",
            "अजः": "of a goat",
            "अभिषेकम्": "being bathed",
            "जीवितं": "life",
            "तु": "indeed",
            "निखिलं": "entire",
            "भगवान्": "Lord",
            "मुकुन्दः": "Mukunda (another name of Lord Krishna)",
            "त्वद्यापि": "than you",
            "पदरजः": "dust of the feet",
            "श्रुतिमृग्यमेव": "sought after by the Vedas"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "तद्": "that",
            "भूरिभाग्यं": "great fortune",
            "इह जन्म": "in this birth",
            "किम्": "even",
            "अटव्यां": "in the forest",
            "यद्": "which",
            "गोकुलेऽपि": "also in Gokula",
            "कतमाङ्‍‍घ्रिरजोऽभिषेकम्": "sprinkling of dust from whose feet",
            "यज्जीवितं": "the entire life",
            "तु": "but",
            "निखिलं": "all",
            "भगवान्": "O Lord",
            "मुकुन्द": "Mukunda (a name of Krishna)",
            "त्वद्यापि": "even today",
            "यत्पदरजः": "whose lotus feet",
            "श्रुतिमृग्यमेव": "sought after by the ears (the Vedas)"
        },
        "meaning": "That great fortune in this birth, even in the forest, which was the sprinkling of dust from whose feet in Gokula? The entire life is but your service, O Mukunda, even today, whose lotus feet are sought after by the ears (the Vedas)."
    }

}