{
    "verse_no": "१०-१४-५५",
    "verse": "कृष्णमेनमवेहि त्वमात्मानमखिलात्मनाम् ।\nजगद्धिताय सोऽप्यत्र देहीवाभाति मायया ॥",
    "vedabase": {
        "terms": {
            "kṛṣṇam": "Lord Kṛṣṇa, the Supreme Personality of Godhead",
            "enam": "this",
            "avehi": "just try to understand",
            "tvam": "you",
            "ātmānam": "the Soul",
            "akhila-ātmanām": "of all living entities",
            "jagat-hitāya": "for the benefit of the whole universe",
            "saḥ": "He",
            "api": "certainly",
            "atra": "here",
            "dehī": "a human being",
            "iva": "like",
            "ābhāti": "appears",
            "māyayā": "by His internal potency."
        },
        "translation": "You should know Kṛṣṇa to be the original Soul of all living entities. For the benefit of the whole universe, He has, out of His causeless mercy, appeared as an ordinary human being. He has done this by the strength of His internal potency.  ",
        "purport": "In the Caitanya-caritāmṛta, Madhya-līla, Chapter Twenty, text 162, Śrīla Prabhupāda comments on this verse as follows: “Parīkṣit Mahārāja asked Śukadeva Gosvāmī why Kṛṣṇa was so beloved by the residents of Vṛndāvana, who loved Him even more than their own offspring or life itself. At that time, Śukadeva Gosvāmī replied that everyone’s ātmā, or soul, is very, very dear, especially to all living entities who have accepted material bodies. However, that ātmā, the spirit soul, is part and parcel of Kṛṣṇa. For this reason, Kṛṣṇa is very dear to every living entity. Everyone’s body is very dear to oneself, and one wants to protect the body by all means because within the body the soul is living. Due to the intimate relationship between the soul and the body, the body is important and dear to everyone. Similarly, the soul, being part and parcel of Kṛṣṇa, the Supreme Lord, is very, very dear to all living entities. Unfortunately, the soul forgets his constitutional position and thinks he is only the body (dehātma-buddhi). Thus the soul is subjected to the rules and regulations of material nature. When a living entity, by his intelligence, reawakens his attraction for Kṛṣṇa, he can understand that he is not the body but part and parcel of Kṛṣṇa. Thus filled with knowledge, he no longer labors under attachment to the body and everything related to the body (janasya moho ’yam ahaṁ mameti). Material existence, wherein one thinks, ‘I am the body, and this belongs to me,’ is also illusory. One must redirect his attraction to Kṛṣṇa. Śrīmad-Bhāgavatam (1.2.7) states: vāsudeve bhagavatibhakti-yogaḥ prayojitaḥjanayaty āśu vairāgyaṁjñānaṁ ca yad ahaitukam ‘By rendering devotional service unto the Personality of Godhead, Śrī Kṛṣṇa, one immediately acquires causeless knowledge and detachment from the world.’”"
    },
    "gpt": {
        "terms": {
            "कृष्णम्": "O Krishna,",
            "एनम् अवेहि": "come, take;",
            "त्वम् आत्मानम्": "yourself, as;",
            "अखिलात्मनाम्": "of all selves;",
            "जगद्धिताय": "for the welfare of the world;",
            "सः अपि": "even he;",
            "अत्र": "here;",
            "देहीवाभाति": "appears as though a mortal being;",
            "मायया": "by illusion."
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "kṛṣṇam": "kṛṣṇa",
            "enam": "this",
            "avehi": "come",
            "tvam": "you",
            "ātmānam": "self",
            "akhila-ātmanām": "of all embodied beings",
            "jagat-hitāya": "for the welfare of the world",
            "saḥ": "he",
            "api": "also",
            "atra": "here",
            "dehī": "embodied being",
            "iva": "like",
            "ābhāti": "appears",
            "māyayā": "by illusion",
            "": "kṛṣṇa = kṛṣṇa"
        },
        "meaning": "kṛṣṇam enam avehi tvam ātmānam akhila-ātmanām jagat-hitāya Come to this Kṛṣṇa, who is the self of all embodied beings, for the welfare of the world. He appears here, like an embodied being, by illusion."
    }
}