{
    "verse_no": "१०-२४-१३",
    "verse": "कर्मणा जायते जन्तुः कर्मणैव प्रलीयते । सुखं दुःखं भयं क्षेमं कर्मणैवाभिपद्यते ॥",
    "meaning": "अपने अपने कर्म के अनुसार प्रारब्ध के अनुसार लोग आते हैं और समय पूरा होने के बाद फिर चले जाते हैं उसमें करेक्शन कोई नहीं कर सकता",
    "vedabase": {
        "terms": {
            "karmaṇā": "by karma",
            "jāyate": "takes birth",
            "jantuḥ": "the living entity",
            "eva": "alone",
            "pralīyate": "he meets his destruction",
            "sukham": "happiness",
            "duḥkham": "unhappiness",
            "bhayam": "fear",
            "kṣemam": "security",
            "karmaṇā eva": "by karma alone",
            "abhipadyate": "are obtained."
        },
        "translation": "Lord Kṛṣṇa said: It is by the force of karma that a living entity takes birth, and it is by karma alone that he meets his destruction. His happiness, distress, fear and sense of security all arise as the effects of karma.  ",
        "purport": "Lord Kṛṣṇa minimized the importance of the demigods by speaking the philosophy known as Karma-vāda or Karma-mīmāṁsā, which, basically, is atheism with a belief in reincarnation. According to this philosophy, there are subtle laws of nature that reward or punish us according to how we act: “As you sow, so shall you reap.” In a future life one reaps the fruit of his present work, and this is the sum and substance of reality. Lord Kṛṣṇa, being God Himself, could hardly be a serious proponent of this mediocre philosophy. In the role of a young boy He was simply teasing His pure devotees by preaching it. Śrīla Jīva Gosvāmī points out that Lord Kṛṣṇa was thinking, “Why are these eternal associates of Mine, appearing as My father and other relatives and friends, so caught up in this worship of Indra?” Thus although the Lord’s main purpose was to take away the false pride of Indra, He also wanted to remind His eternal devotees that they need not divert their attention to other so-called gods, since in fact His devotees were already living with the Supreme Absolute Truth, the almighty Lord Himself."
    },
    "gpt": {
        "terms": {
            "कर्मणा जायते जन्तुः": "Actions give birth to beings",
            "कर्मणैव प्रलीयते": "Actions alone cause their destruction",
            "सुखं दुःखं भयं क्षेमं कर्मणैवाभिपद्यते": "Happiness, sorrow, fear, and security are all determined by actions alone"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "śrī-bhagavān": "śrī + bhagavān = śrī + bhagavan = śrī + the glorious + lord",
            "uvāca": "speak",
            "karmaṇā": "action + by",
            "jāyate": "born",
            "jantuḥ": "living being",
            "eva": "indeed",
            "pralīyate": "destroyed",
            "sukham": "happiness",
            "duḥkham": "unhappiness",
            "bhayam": "fear",
            "kṣemam": "safety",
            "abhipadyate": "attained",
            "śrī-bhagavān uvāca karmaṇā jāyate jantuḥ eva pralīyate sukham duḥkham bhayam kṣemam karmaṇā eva abhipadyate": "śrī + the glorious + lord speak action + by living being indeed born indeed destroyed happiness unhappiness fear safety action + by indeed attained"
        },
        "meaning": ""
    }
}