{
    "verse_no": "१०-२३-४३",
    "verse": "नासां द्विजातिसंस्कारो न निवासो गुरावपि ।\nन तपो नात्ममीमांसा न शौचं न क्रिया: शुभा: ॥",
    "vedabase": {
        "terms": {
            "na": "not",
            "āsām": "on their part",
            "dvijāti-saṁskāraḥ": "the purificatory rituals pertaining to the twice-born classes of society",
            "nivāsaḥ": "residence",
            "gurau": "in the āśrama of a spiritual master (that is, training as a brahmacārī)",
            "api": "even though.",
            "tapaḥ": "execution of austerities",
            "ātma-mīmāṁsā": "philosophical inquiry into the reality of the self",
            "śaucam": "rituals of cleanliness",
            "kriyāḥ": "ritualistic activities",
            "śubhāḥ": "pious",
            "tathā api": "nevertheless",
            "hi": "indeed",
            "uttamaḥ-śloke": "whose glories are chanted by the exalted mantras of the Vedas",
            "kṛṣṇe": "for Lord Kṛṣṇa",
            "yoga-īśvara-īśvare": "the supreme master of all masters of mystic power",
            "bhaktiḥ": "pure devotional service",
            "dṛḍhā": "firm",
            "ca": "on the other hand",
            "asmākam": "of us",
            "saṁskāra-ādi-matām": "who possess such purification and so forth"
        },
        "translation": "These women have never undergone the purificatory rites of the twice-born classes, nor have they lived as brahmacārīs in the āśrama of a spiritual master, nor have they executed austerities, speculated on the nature of the self, followed the formalities of cleanliness or engaged in pious rituals. Nevertheless, they have firm devotion for Lord Kṛṣṇa, whose glories are chanted by the exalted hymns of the Vedas and who is the supreme master of all masters of mystic power. We, on the other hand, have no such devotion for the Lord, although we have executed all these processes.  ",
        "purport": "According to Śrīla Śrīdhara Svāmī, the husbands were not aware that their wives had occasionally associated with residents of Vṛndāvana, such as the flower ladies, and had heard about the beauty and qualities of Kṛṣṇa. The brāhmaṇas were astonished at their wives’ loving devotion for Lord Kṛṣṇa, not realizing that this devotion had developed as a result of hearing and chanting about the Lord in the association of His pure devotees."
    },
    "gpt": {
        "terms": {
            "नासां": "Not cleanliness of the nose",
            "द्विजातिसंस्कारो": "nor the sacred thread ceremony",
            "न निवासो": "nor the place of residence",
            "गुरावपि": "nor the guru",
            "न तपो": "not the practice of austerity",
            "नात्ममीमांसा": "nor the study of the self",
            "न शौचं": "not purity",
            "न क्रिया:": "nor rituals",
            "शुभा:": "are virtuous."
        },
        "meaning": ""
    },
    "bard": {
        "terms": {},
        "meaning": "na āsām    not for themdvijati-saṁskāraḥ    birth in a twice-born castenivāsaḥ       residencegurau api     even with a gurutapaḥ       austerityātma-mīmāṁsā    self-reflectionśaucam        puritykriyāḥ       actionsśubhāḥ       auspicioustathā api hi     stilluttamaḥ-śloke     in the best versekṛṣṇe       Krishnayoga-īśvara-īśvare     in the Supreme Lord who is the controller of yogabhaktiḥ       devotiondṛḍhā      firmca              andasmākam      for ussaṁskāra-ādi-matām     those who are devoted to rituals"
    }
}