{
    "verse_no": "१०-३१-१९",
    "verse": "यत्ते सुजातचरणाम्बुरुहं स्तनेषु भीताः शनैः प्रिय दधीमहि कर्कशेषु ।\nतेनाटवीमटसि तद् व्यथते न किंस्वित् कूर्पादिभिर्भ्रमति धीर्भवदायुषां नः ॥",
    "ref": [
        "रास पंचध्यायी ५७, १६५"
    ],
    "vedabase": {
        "terms": {
            "yat": "which",
            "te": "Your",
            "su-jāta": "very fine",
            "caraṇa-ambu-ruham": "lotus feet",
            "staneṣu": "on the breasts",
            "bhītāḥ": "being afraid",
            "śanaiḥ": "gently",
            "priya": "O dear one",
            "dadhīmahi": "we place",
            "karkaśeṣu": "rough",
            "tena": "with them",
            "aṭavīm": "the forest",
            "aṭasi": "You roam",
            "tat": "they",
            "vyathate": "are distressed",
            "na": "not",
            "kim svit": "we wonder",
            "kūrpa-ādibhiḥ": "by small stones and so on",
            "bhramati": "flutters",
            "dhīḥ": "the mind",
            "bhavat-āyuṣām": "of those of whom Your Lordship is the very life",
            "naḥ": "of us."
        },
        "translation": "O dearly beloved! Your lotus feet are so soft that we place them gently on our breasts, fearing that Your feet will be hurt. Our life rests only in You. Our minds, therefore, are filled with anxiety that Your tender feet might be wounded by pebbles as You roam about on the forest path.  ",
        "purport": "The translation of this verse is from Śrīla Prabhupāda’s English rendering of Caitanya-caritāmṛta (Ādi 4.173). Thus end the purports of the humble servants of His Divine Grace A.C. Bhaktivedanta Swami Prabhupāda to the Tenth Canto, Thirty-first Chapter, of the Śrīmad-Bhāgavatam, entitled “The Gopīs’ Songs of Separation.”"
    },
    "gpt": {
        "terms": {
            "यत्ते सुजातचरणाम्बुरुहं": "yatte sujātacharaṇāmburuhām: The lotus-like feet of yours, which are beautifully formed,",
            "स्तनेषु भीताः शनैः प्रिय दधीमहि": "staneshu bhītāḥ śanaiḥ priya dadhīmahi: Slowly and with fear, we place our loved offerings on your breasts,",
            "कर्कशेषु": "karkaśeṣhu: which are as soft as the touch of a lotus petal.",
            "तेनाटवीमटसि तद् व्यथते न किंस्वित्": "tenāṭavīmaṭasi tad vyathate na kiṁsvit: But that dark blue spot on your forehead, it does not hurt at all,",
            "कूर्पादिभिर्भ्रमति धीर्भवदायुषां नः": "kūrpādibhirbhramati dhīrbhavadāyuṣhām naḥ: as does not the curl of your graceful hair that enhances our lifespans."
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "yat": "that",
            "te": "your",
            "su-jāta": "well-born",
            "caraṇa": "feet",
            "ambu": "water",
            "ruham": "to drink",
            "staneṣu": "breasts",
            "bhītāḥ": "afraid",
            "śanaiḥ": "slowly",
            "priya": "dear",
            "dadhīmahi": "we give",
            "karkaśeṣu": "hard",
            "tena": "by",
            "aṭavīm": "waves",
            "aṭasi": "are struck",
            "tat": "it",
            "vyathate": "is agitated",
            "na": "not",
            "kim": "what",
            "svit": "at all",
            "kūrpa-ādibhiḥ": "from compassion",
            "bhramati": "wanders",
            "dhīḥ": "mind",
            "bhavat-āyuṣām": "of your life",
            "naḥ": "ours"
        },
        "meaning": "That (the waves) are struck by the hard (breasts) of your well-born (goddess) feet, which we, afraid (of the waves), slowly give to drink (to the goddess) in our breasts. The mind of our life in you does not at all wander from compassion."
    }
}