{
    "verse_no": "१०-३१-९",
    "verse": "तव कथामृतं तप्तजीवनं कविभिरीडितं कल्मषापहम् ।\nश्रवणमङ्गलं श्रीमदाततं भुवि गृणन्ति ये भूरिदा जनाः ॥",
    "ref": [
        "रास पंचध्यायी १६३"
    ],
    "meaning": "जो भगवान की ओर ले जाने के लिए पुस्तक लिखते हैं लेक्चर देते हैं समझाते हैं वो तो बहुत बड़े दानी हैं उनसे बड़ा कौन दानी होगा",
    "vedabase": {
        "terms": {
            "tava": "Your",
            "kathā-amṛtam": "the nectar of words",
            "tapta-jīvanam": "life for those aggrieved in the material world",
            "kavibhiḥ": "by great thinkers",
            "īḍitam": "described",
            "kalmaṣa-apaham": "that which drives away sinful reactions",
            "śravaṇa-maṅgalam": "giving spiritual benefit when heard",
            "śṛīmat": "filled with spiritual power",
            "ātatam": "broadcast all over the world",
            "bhuvi": "in the material world",
            "gṛṇanti": "chant and spread",
            "ye": "those who",
            "bhūri-dāḥ": "most beneficent",
            "janāḥ": "persons."
        },
        "translation": "The nectar of Your words and the descriptions of Your activities are the life and soul of those suffering in this material world. These narrations, transmitted by learned sages, eradicate one’s sinful reactions and bestow good fortune upon whoever hears them. These narrations are broadcast all over the world and are filled with spiritual power. Certainly those who spread the message of Godhead are most munificent.  ",
        "purport": "King Pratāparudra recited this verse to Śrī Caitanya Mahāprabhu during Lord Jagannātha’s Ratha-yātrā festival. While the Lord was resting in a garden, King Pratāparudra humbly entered and began massaging His legs and lotus feet. Then the King recited the Thirty-first Chapter of the Tenth Canto of the Śrīmad-Bhāgavatam, the songs of the gopīs. The Caitanya-caritāmṛta relates that when Lord Caitanya heard this verse, beginning tava kathāmṛtam, He immediately arose in ecstatic love and embraced King Pratāparudra. The incident is described in detail in the Caitanya-caritāmṛta (Madhya 14.4-18), and in his edition Śrīla Prabhupāda has given extensive commentary on it."
    },
    "gpt": {
        "terms": {
            "तव": "Your",
            "कथामृतं": "nectar-like stories",
            "तप्तजीवनं": "which give life to the despondent",
            "कविभिरीडितं": "praised by poets",
            "कल्मषापहम्": "destroying impurities",
            "श्रवणमङ्गलं": "auspicious to listen to",
            "श्रीमदाततं": "full of splendor and prosperity",
            "भुवि": "in this world",
            "गृणन्ति": "praise",
            "ये": "those who",
            "भूरिदा": "bestow abundance",
            "जनाः": "people"
        },
        "meaning": " Your nectar like stories, which give life to the despondent, are praised by poets and destroy impurities. The world praises these auspicious and splendid stories, which bestow abundance on the people."
    },
    "bard": {
        "terms": {
            "tava": "`your`",
            "kathā": "`story`",
            "amṛtam": "`nectar`",
            "tapta-jīvanam": "`life full of struggle`",
            "kavibhiḥ": "`by poets`",
            "īḍitam": "`desired`",
            "kalmaṣa-apaham": "`destroyer of sins`",
            "śravaṇa-maṅgalam": "`auspicious to hear`",
            "śṛīmat": "`auspicious`",
            "ātatam": "`constantly`",
            "bhuvi": "`on earth`",
            "gṛṇanti": "`chant`",
            "ye": "`who`",
            "bhūri-dāḥ": "`generous`",
            "janaḥ": "`people`"
        },
        "meaning": "your story full of struggle, desired by poets, destroyer of sins, auspicious to hear, constantly chanted on earth by generous people.Your story, full of struggle, desired by poets, destroyer of sins, auspicious to hear, constantly chanted on earth by generous people."
    }
}