{
    "verse_no": "१०-३३-३६",
    "verse": "गोपीनां तत्पतीनां च सर्वेषामेव देहिनाम् ।\nयोऽन्तश्चरति सोऽध्यक्षः क्रीडनेनेह देहभाक् ॥",
    "ref": [
        "रास पंचध्यायी २२२"
    ],
    "vedabase": {
        "terms": {
            "anugrahāya": "to show mercy",
            "bhaktānām": "to His devotees",
            "mānuṣam": "humanlike",
            "deham": "a body",
            "āsthitaḥ": "assuming",
            "bhajate": "He accepts",
            "tādṛśīḥ": "such",
            "kriḍāḥ": "pastimes",
            "yāḥ": "about which",
            "śrutvā": "hearing",
            "tat-paraḥ": "dedicated to Him",
            "bhavet": "one becomes."
        },
        "translation": "When the Lord assumes a humanlike body to show mercy to His devotees, He engages in such pastimes as will attract those who hear about them to become dedicated to Him.  ",
        "purport": "Śrīla Jīva Gosvāmī explains in this connection that when Lord Kṛṣṇa descends to this world in His original two-handed form, out of kindness He manifests that form in a way His devotees conditioned in human society can perceive and understand. Thus here it is stated, mānuṣaṁ deham āsthitaḥ: “He assumes a humanlike body.” Śrīla Viśvanātha Cakravartī Ṭhākura glorifies the Lord’s conjugal pastimes, stating that these romantic affairs have an inconceivable spiritual potency to attract the polluted heart of conditioned souls. It is an undeniable fact that any pure- or simple-hearted person who hears narrations of the loving affairs of Kṛṣṇa will be attracted to the lotus feet of the Lord and gradually become His devotee."
    },
    "gpt": {
        "terms": {
            "गोपीनां": "of the gopis (milkmaids)",
            "तत्पतीनां च": "and those who are ardently desiring Him",
            "सर्वेषामेव देहिनाम्": "of all living beings",
            "योऽन्तः चरति": "who resides within",
            "सोऽध्यक्षः": "He, the Supreme Being, who watches over everything",
            "क्रीडनेन इह देहभाक्": "sportingly playing within this physical body"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "anugrahāya": "for bestowing benediction",
            "bhaktānām": "on his devotees",
            "mānuṣam deham": "human body",
            "āsthitaḥ": "having assumed",
            "bhajate": "performs",
            "tādṛśīḥ kriḍāḥ": "such sports",
            "yāḥ": "which",
            "śrutvā": "hearing about",
            "tat-paraḥ": "becomes fully absorbed in Him"
        },
        "meaning": "He, having assumed a human body, performs such sports, which hearing about one becomes fully absorbed in Him, for bestowing benediction on his devotees."
    }
}