{
    "verse_no": "१०-४७-५२",
    "verse": "हे नाथ हे रमानाथ व्रजनाथार्तिनाशन ।\nमग्नमुद्धर गोविन्द गोकुलं वृजिनार्णवात् ॥",
    "vedabase": {
        "terms": {
            "he nātha": "O master",
            "he ramā-nātha": "O master of the goddess of fortune",
            "vraja-nātha": "O master of the cowherd village",
            "ārti": "of suffering",
            "nāśana": "O destroyer",
            "magnam": "submerged",
            "uddhara": "uplift",
            "govinda": "O Govinda",
            "gokulam": "Gokula",
            "vṛjina": "of distress",
            "arṇavāt": "from the ocean."
        },
        "translation": "O master, O master of the goddess of fortune, O master of Vraja! O destroyer of all suffering, Govinda, please lift Your Gokula out of the ocean of distress in which it is drowning!  ",
        "purport": "Śrīla Viśvanātha Cakravartī presents the following insight into this scene: Someone might propose to the gopīs, “Why don’t you just go somewhere else? Leave Vṛndāvana, and then you won’t have to see these rivers, mountains and forests. Cover your eyes with your garments, use your intelligence to lead your minds to some other thought, and thus forget Kṛṣṇa.” The gopīs answer this suggestion in the previous verse by stating, “We no longer possess our intelligence, for Kṛṣṇa has taken it away by His supreme beauty and charm.” Now in the present verse the feelings of the gopīs become so strong that they disregard Uddhava and, turning toward Mathurā, address Kṛṣṇa Himself with humble cries. They address Kṛṣṇa as Vrajanātha because in the past young Kṛṣṇa performed many inconceivable pastimes to protect His beloved village people, such as lifting Govardhana Hill and destroying many monstrous demons. In this heartrending verse, the gopīs cry out to Kṛṣṇa to remember the wonderful, sweet relationship they once enjoyed together as innocent village people. Indeed, Śrī Kṛṣṇa would lovingly take care of His father’s cows, and the gopīs appealed to Him to remember these duties and return so He could resume them."
    },
    "gpt": {
        "terms": {
            "Line": "by-line breakdown and meaning:",
            "हे नाथ (he natha)": "O Lord",
            "हे रमानाथ (he ramanatha)": "O beloved of Rama (an epithet of Lord Krishna)",
            "व्रजनाथार्तिनाशन (vrajanatharthinashan)": "O destroyer of the afflictions of the residents of Vraja (Vraja refers to the region in which Lord Krishna grew up, and arthinashan means destroyer of afflictions)",
            "मग्नमुद्धर (magnamuddhara)": "Lift me up from my state of delusion (magna means immersed or sunk, and uddhara means to lift up)",
            "गोविन्द (govinda)": "Another name for Lord Krishna, which means the protector of cows or the absolute truth",
            "गोकुलं वृजिनार्णवात् (gokulam vrajinarnavat)": "Like a boat for the residents of Gokula (Gokula refers to the divine abode of Lord Krishna, and vrajinarnavat means like a boat for the residents of Vraja)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "He `nātha`": "O Lord",
            "He `rāma-nātha`": "O Lord Rama",
            "He `vraja-nātha`": "O Lord of Vraja",
            "Ārti `nāśana`": "the remover of suffering",
            "Magnam `uddhara`": "please rescue",
            "Govinda `gokulam`": "Gokula",
            "Vṛjina `arṇavāt`": "from the ocean of mud"
        },
        "meaning": "Overall meaning: O Lord Rama, O Lord of Vraja, the remover of suffering, please rescue Gokula from the ocean of mud."
    }
}