{
    "verse_no": "१०-४७-५९",
    "verse": "क्वेमाः स्‍त्रियो वनचरीर्व्यभिचारदुष्टाः कृष्णे क्व‍ चैष परमात्मनि रूढभावः ।\nनन्वीश्वरोऽनुभजतोऽविदुषोऽपि साक्षाच्छ्रेयस्तनोत्यगदराज इवोपयुक्तः ॥",
    "vedabase": {
        "terms": {
            "kva": "where, in comparison",
            "imāḥ": "these",
            "striyaḥ": "women",
            "vana": "in the forests",
            "carīḥ": "who wander",
            "vyabhicāra": "by improper behavior",
            "duṣṭāḥ": "contaminated",
            "kṛṣṇe": "for Kṛṣṇa",
            "kva ca": "and where",
            "eṣaḥ": "this",
            "parama-ātmani": "for the Supreme Soul",
            "rūḍha-bhāvaḥ": "stage of perfect love (known technically as mahā-bhāva)",
            "nanu": "certainly",
            "īśvaraḥ": "the Personality of Godhead",
            "anubhajataḥ": "to one who constantly worships Him",
            "aviduṣaḥ": "not learned",
            "api": "even though",
            "sākṣāt": "directly",
            "śreyaḥ": "the highest good",
            "tanoti": "bestows",
            "agada": "of medicines",
            "rājaḥ": "the king (namely, the nectar which the demigods drink for long life)",
            "iva": "as if",
            "upayuktaḥ": "taken."
        },
        "translation": "How amazing it is that these simple women who wander about the forest, seemingly spoiled by improper behavior, have achieved the perfection of unalloyed love for Kṛṣṇa, the Supreme Soul! Still, it is true that the Supreme Lord Himself awards His blessings even to an ignorant worshiper, just as the best medicine works even when taken by a person ignorant of its ingredients.  ",
        "purport": "The use of the word kva in the first two lines indicates a sharp contrast between apparently incompatible items, in this case the apparently insignificant and even impure position of the gopīs, mentioned in the first line, and their attainment of the highest perfection of life, mentioned in the second. In this regard Śrīla Viśvanātha Cakravartī describes three types of adulterous women. The first is a woman who enjoys both her husband and a lover, being faithful to neither. Both ordinary society and the scriptures condemn this conduct. The second type of adulterous woman is she who abandons her husband to enjoy only with her lover. Society and the scriptures also condemn this behavior, although such a fallen woman may be said to at least have the good quality of dedicating herself to a single man. The last kind of adulterous woman is she who abandons her husband and enjoys in the attitude of being a lover of the Supreme Lord alone. Śrīla Viśvanātha Cakravartī explains that although foolish, common people criticize this position, such behavior is commended by those who are wise in spiritual science. Therefore learned members of society and the revealed scriptures praise such single-minded devotion to the Lord. Such was the gopīs’ behavior. Thus the term vyabhicāra-duṣṭāḥ, “corrupted by deviation,” indicates the apparent resemblance between the gopīs’ behavior and that of ordinary adulterous women."
    },
    "gpt": {
        "terms": {
            "क्वेमाः": "Where are",
            "स्त्रियः": "the women",
            "वनचरीः": "living in the forest",
            "व्यभिचारदुष्टाः": "with improper conduct",
            "कृष्णे": "in Krishna",
            "क्वचैष": "where is He",
            "परमात्मनि": "the Supreme Soul",
            "रूढभावः": "established in devotion",
            "ननु": "indeed",
            "ईश्वरः": "the Supreme Lord",
            "अनुभजतः": "being served",
            "अविदुषः": "by the ignorant",
            "अपि": "even",
            "साक्षात्": "directly",
            "श्रेयस्तनोति": "bestows welfare",
            "अगदराजः": "like a black snake",
            "इव": "as though",
            "उपयुक्तः": "engaged"
        },
        "meaning": "Where are the women with improper conduct in the forest? Where is Krishna, the Supreme Soul, established in devotion? Indeed, the Supreme Lord, even when served by the ignorant, directly bestows welfare, like a black snake engaged as though."
    },
    "bard": {
        "terms": {
            "kva": "where",
            "imāḥ": "these",
            "striyaḥ": "women",
            "vana": "forest",
            "carīḥ": "wandering",
            "vyabhicāra": "adultery",
            "duṣṭāḥ": "sinful",
            "kṛṣṇe": "Krishna",
            "ca": "and",
            "eṣaḥ": "this",
            "parama-ātmani": "supreme being",
            "rūḍha-bhāvaḥ": "conditioned state",
            "nanu": "indeed",
            "īśvaraḥ": "God",
            "anubhajataḥ": "when worshipped",
            "aviduṣaḥ": "by the ignorant",
            "api": "even",
            "sākṣāt": "directly",
            "śreyaḥ": "happiness",
            "tanoti": "bestows",
            "agada": "snake charmer",
            "rājaḥ": "king",
            "iva": "like",
            "upayuktaḥ": "aided by"
        },
        "meaning": ""
    }
}