{
    "verse_no": "१०-६-३५",
    "verse": "पूतना लोकबालघ्नी राक्षसी रुधिराशना ।\nजिघांसयापि हरये स्तनं दत्त्वाप सद्गतिम् ॥",
    "meaning": "कंस ने कहा भई सारे बच्चों को मार 2 जो 1 महीने के अंदर पैदा हुए हैं, उसी में वो वो भी होगा जो हमको मारने के लिए आ गया है कौन इसके लिए जाए का पूतना बढ़िया रहेगी क्योंकि पूतना स्त्री है और वो तमाम रूप धारण कर सकती है",
    "vedabase": {
        "terms": {
            "pūtanā": "Pūtanā, the professional Rākṣasī",
            "loka-bāla-ghnī": "who used to kill human children",
            "rākṣasī": "the she-demon",
            "rudhira-aśanā": "simply hankering for blood",
            "jighāṁsayā": "with the desire to kill Kṛṣṇa (being envious of Kṛṣṇa and having been instructed by Kaṁsa)",
            "api": "still",
            "haraye": "unto the Supreme Personality of Godhead",
            "stanam": "her breast",
            "dattvā": "after offering",
            "āpa": "obtained",
            "sat-gatim": "the most elevated position of spiritual existence",
            "kim": "something",
            "punaḥ": "again",
            "śraddhayā": "with faith",
            "bhaktyā": "by devotion",
            "kṛṣṇāya": "unto Lord Kṛṣṇa",
            "paramātmane": "who is the Supreme Person",
            "yacchan": "offering",
            "priya-tamam": "the dearmost",
            "nu": "indeed",
            "raktāḥ": "those who have an affinity",
            "tat-mātaraḥ": "Kṛṣṇa’s affectionate mothers (offering the beloved child their breasts)",
            "yathā": "exactly like."
        },
        "translation": "Pūtanā was always hankering for the blood of human children, and with that desire she came to kill Kṛṣṇa; but because she offered her breast to the Lord, she attained the greatest achievement. What then is to be said of those who had natural devotion and affection for Kṛṣṇa as mothers and who offered Him their breasts to suck or offered something very dear, as a mother offers something to a child?  ",
        "purport": "Pūtanā had no affection for Kṛṣṇa; rather, she was envious and wanted to kill Him. Nonetheless, because with or without knowledge she offered her breast, she attained the highest achievement in life. But the offerings of devotees attracted to Kṛṣṇa in parental love are always sincere. A mother likes to offer something to her child with affection and love; there is no question of envy. So here we can make a comparative study. If Pūtanā could attain such an exalted position in spiritual life by neglectfully, enviously making an offering to Kṛṣṇa, what is to be said of mother Yaśodā and the other gopīs, who served Kṛṣṇa with such great affection and love, offering everything for Kṛṣṇa’s satisfaction? The gopīs automatically achieved the highest perfection. Therefore Śrī Caitanya Mahāprabhu recommended the affection of the gopīs, either in maternal affection or in conjugal love, as the highest perfection in life (ramyā kācid upāsanā vrajavadhū-vargeṇa yā kalpitā)."
    },
    "gpt": {
        "terms": {
            "पूतना": "Pootana (a name)",
            "लोकबालघ्नी": "destroyer of the people (loka = people, bala = strength, ghnī = destroyer)",
            "राक्षसी": "demoness",
            "रुधिराशना": "whose mouth is filled with blood (rudhira = blood, āśanā = who eats)",
            "जिघांसयापि": "even while intending to kill",
            "हरये": "to Lord Hari (another name for Lord Krishna)",
            "स्तनं दत्त्वा": "giving her breast (to breastfeed)",
            "एव": "indeed",
            "सद्गतिम्": "salvation or liberation"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "pūtanā": "demon",
            "loka-bāla-ghnī": "killer of children",
            "rākṣasī": "demon",
            "rudhira-aśanā": "blood-eater",
            "jighāṁsayā": "angry",
            "api": "even",
            "haraye": "krishna",
            "stanam": "breast",
            "dattvā": "giving",
            "āpa": "obtained",
            "sat-gatim": "liberation",
            "kim punaḥ": "what to say",
            "śraddhayā": "with faith",
            "bhaktyā": "with devotion",
            "kṛṣṇāya": "krishna",
            "paramātmane": "supreme soul",
            "yacchan": "desiring",
            "priya-tamam": "most dear",
            "nu raktāḥ": "blood",
            "tat-mātaraḥ": "their mothers",
            "yathā": "as",
            "Putanā": "demon killer of children demon blood eater angry even krishna breast giving obtained liberation what to say with faith devotion krishna supreme soul desiring most dear blood their mothers as"
        },
        "meaning": ""
    }
}