{
    "verse_no": "१०-८४-१३",
    "verse": "यस्यात्मबुद्धिः कुणपे त्रिधातुके स्वधीः कलत्रादिषु भौम इज्यधीः ।\nयत्तीर्थबुद्धिः सलिले न कर्हिचिज्जनेष्वभिज्ञेषु स एव गोखरः ॥",
    "meaning": "जो अपने को शरीर मानें और जो मां बाप स्त्री पति बेटे को अपना समझे, नंबर 2 और जो ये मिट्टी और पत्थर आदि की मूर्तियों में भगवान की बुद्धि न मान के पत्थर की बुद्धि से पूजा करे शंगार कितनी सुन्दर मूर्ति है और जो तीर्थों में जल की बुद्धि से स्नान करे",
    "vedabase": {
        "terms": {
            "yasya": "whose",
            "ātma": "as his self",
            "buddhiḥ": "idea",
            "kuṇape": "in a corpselike body",
            "tri-dhātuke": "made of three basic elements",
            "sva": "as his own",
            "dhīḥ": "idea",
            "kalatra-ādiṣu": "in wife and so on",
            "bhaume": "in earth",
            "ijya": "as worshipable",
            "yat": "whose",
            "tīrtha": "as a place of pilgrimage",
            "salile": "in water",
            "na karhicit": "never",
            "janeṣu": "in men",
            "abhijñeṣu": "wise",
            "saḥ": "he",
            "eva": "indeed",
            "gaḥ": "a cow",
            "kharaḥ": "or an ass."
        },
        "translation": "One who identifies his self as the inert body composed of mucus, bile and air, who assumes his wife and family are permanently his own, who thinks an earthen image or the land of his birth is worshipable, or who sees a place of pilgrimage as merely the water there, but who never identifies himself with, feels kinship with, worships or even visits those who are wise in spiritual truth — such a person is no better than a cow or an ass.  ",
        "purport": "True intelligence is shown by one’s freedom from false identification of the self. As stated in the Bṛhaspati-saṁhitā: ajñāta-bhagavad-dharmāmantra-vijñāna-saṁvidaḥnarās te go-khara jñeyāapi bhū-pāla-vanditāḥ “Men who do not know the principles of devotional service to the Supreme Lord should be known as cows and asses, even if they are expert in technically analyzing Vedic mantras and are adored by world leaders.” An imperfect Vaiṣṇava advancing toward the second-class platform identifies himself with the sages who have established the true spiritual path, even while he still may have some inferior material attachments to body, family and so on. Such a devotee of the Lord is not a foolish cow or stubborn ass like the majority of materialists. But most excellent is the Vaiṣṇava who has gained the special mercy of the Lord and broken free from the bondage of illusory attachments altogether. According to Śrīla Viśvanātha Cakravartī, the words bhauma ijya-dhīḥ, “who thinks an image made of earth is worshipable,” refer not to the Deity form of the Supreme Lord in His temple but to deities of demigods, and the words yat-tīrtha-buddhiḥ salile, “who sees a place of pilgrimage as merely the water there,” refer not to sacred rivers like the Ganges or Yamunā but to lesser rivers."
    },
    "gpt": {
        "terms": {
            "यस्य": "Whose",
            "आत्मबुद्धिः": "intellect is focused on the self",
            "कुणपे": "in the body",
            "त्रिधातुके": "composed of the three bodily elements (Vata, Pitta, Kapha)",
            "स्वधीः": "self-discipline",
            "कलत्रादिषु": "towards one's spouse and others",
            "भौम": "worldly",
            "इज्यधीः": "desire for external rituals and offerings",
            "यत्तीर्थबुद्धिः": "intellect focused on holy places of pilgrimage",
            "सलिले": "in water",
            "न कर्हिचित्": "never, at any time",
            "जनेषु": "among people",
            "अभिज्ञेषु": "who know the essence",
            "सः एव": "that person alone",
            "गोखरः": "is a cow in a cowshed"
        },
        "meaning": " Whose intellect is focused on the self, whose self discipline is rooted in the understanding that the body is composed of the three elements, whose attitude towards their spouse and others is worldly, who desires external rituals and offerings, whose attitude towards pilgrimage places is focused on the essence rather than on physical presence, and who does not care for recognition among people who know the essence - such a person alone is like a cow in a cowshed."
    },
    "bard": {
        "terms": {
            "yasya ātma": "whose self",
            "buddhiḥ": "knowledge",
            "kuṇape": "is in the anus",
            "tri-dhātuke": "and in the three-fold body",
            "sva dhīḥ": "whose consciousness",
            "kalatra-ādiṣu": "is towards his wife",
            "bhaume": "and towards the earth",
            "ijya": "for sacrifice",
            "yat tīrtha salile": "in the waters of pilgrimage",
            "na karhicit": "not at all",
            "janeṣu": "towards men",
            "abhijñeṣu": "and towards the wise",
            "saḥ eva": "he alone",
            "gaḥ": "is a donkey",
            "kharaḥ": "and a beast"
        },
        "meaning": "One whose self, knowledge, consciousness, and so on are all in the anus, three-fold body, wife, earth, sacrifice, waters of pilgrimage, men, and the wise is a donkey and a beast."
    }
}