{
    "verse_no": "१०-८७-३०",
    "verse": "अपरिमिता ध्रुवास्तनुभृतो यदि सर्वगतास्तर्हि न शास्यतेति नियमो ध्रुव नेतरथा ।\nअजनि च यन्मयं तदविमुच्य नियन्तृ भवेत् सममनुजानतां यदमतं मतदुष्टतया ॥",
    "vedabase": {
        "terms": {
            "aparimitāḥ": "countless",
            "dhruvāḥ": "permanent",
            "tanu-bhṛtaḥ": "the embodied living entities",
            "yadi": "if",
            "sarva-gatāḥ": "omnipresent",
            "tarhi": "then",
            "na": "not",
            "śāsyatā": "sovereignty",
            "iti": "such",
            "niyamaḥ": "rule",
            "dhruva": "O unchanging one",
            "itarathā": "otherwise",
            "ajani": "was generated",
            "ca": "and",
            "yat-mayam": "from whose substance",
            "tat": "from that",
            "avimucya": "not separating itself",
            "niyantṛ": "regulator",
            "bhavet": "must be",
            "samam": "equally present",
            "anujānatām": "of those who supposedly know",
            "yat": "which",
            "amatam": "misunderstood",
            "mata": "of what is known",
            "duṣṭatayā": "because of the imperfection."
        },
        "translation": "If the countless living entities were all-pervading and possessed forms that never changed, You could not possibly be their absolute ruler, O immutable one. But since they are Your localized expansions and their forms are subject to change, You do control them. Indeed, that which supplies the ingredients for the generation of something is necessarily its controller because a product never exists apart from its ingredient cause. It is simply illusion for someone to think that he knows the Supreme Lord, who is equally present in each of His expansions, since whatever knowledge one gains by material means must be imperfect.  ",
        "purport": "Because the conditioned soul cannot directly understand the Supreme, the Vedas commonly refer to that Supreme Truth in such impersonal terms as Brahman and oṁ tat sat. If an ordinary scholar presumes to know the confidential meaning of these symbolic references, he should be rejected as an imposter. In the words of Śrī Kena Upaniṣad (2.1), yadi manyase su-vedeti dabhram evāpi nūnaṁ tvaṁ vettha brahmaṇo rūpaṁ, yad asya tvaṁ yad asya deveṣu: “If you think you know Brahman well, then your knowledge is very meager. If you think you can identify Brahman’s form from among the demigods, indeed you know but little.” And again: yasyāmataṁ tasya mataṁmataṁ yasya na veda saḥavijñātaṁ vijānatāṁvijñātam avijānatām “Whoever denies having any opinion of his own about the Supreme Truth is correct in his opinion, whereas one who has his own opinion about the Supreme does not know Him. He is unknown to those who claim to know Him, and can only be known by those who do not claim to know Him.” (Kena Upaniṣad 2.3) Ācārya Śrīdhara Svāmī gives the following explanation of this verse: Many philosophers have studied the mysteries of life from various perspectives and have formed widely differing theories. The Advaita Māyāvādīs, for example, propose that there is only one living being and one power of illusion (avidyā) that covers him, producing the appearance of plurality. But this hypothesis leads to the absurd conclusion that when any one living being becomes liberated, everyone obtains liberation. If, on the other hand, there are many avidyās to cover the one living being, each avidyā will cover only some part of him, and we would have to talk about his becoming partly liberated at particular times while his other parts remain in bondage. This is also obviously absurd. Thus the plurality of living beings is an unavoidable conclusion. Furthermore, there are other theoreticians, namely the proponents of Nyāya and Vaiśeṣika, who claim that the jīva soul is infinite in size. If souls were infinitesimal, these scholars argue, they would not pervade their own bodies, whereas if they were of medium size they would be divisible into parts and thus could not be eternal, at least according to the axioms of Nyāya-Vaiśeṣika metaphysics. But if the numerous eternal jīva souls are each infinitely large, how could they be covered by any power of bondage, whether belonging to avidyā or to the Supreme Lord Himself? According to this theory, there can be no illusion for the soul, no limitations from which to be liberated. The infinite souls must eternally remain as they are, without change. This would mean that the souls would all be equal to God, since He would have no scope for controlling these all-pervading, unchanging rivals. The Vedic śruti-mantras, which affirm unequivocally the mastery of the Lord over the individual souls, cannot be validly contradicted. A true philosopher must accept the statements of śruti as reliable authority on all matters they touch. Certainly in numerous places the Vedic literatures contrast the Supreme Lord’s perpetual, unchanging oneness with the ever-changing embodiments of living beings caught up in the cycle of birth and death. Śrīla Śrīdhara Svāmī prays: antar-yantā sarva-lokasya gītaḥśrutyā yuktyā caivam evāvaseyaḥyaḥ sarva-jñaḥ sarva-śaktir nṛṣiṁhaḥśrīmantaṁ taṁ cetasaivāvalambe “In my heart I take shelter of Him who is glorified as the inner controller of all the worlds, and whom the Vedas ascertain in truth through logical reasoning. He is Nṛsiṁha, the omniscient and omnipotent Lord of the goddess of fortune.”"
    },
    "gpt": {
        "terms": {
            "अपरिमिता": "limitless",
            "ध्रुवास्तनुभृतो": "eternal and unchanging",
            "यदि": "if",
            "सर्वगताः": "all-pervading",
            "तर्हि": "then",
            "न": "not",
            "शास्यते": "subject to",
            "इति": "thus",
            "नियमः": "rule",
            "ध्रुव": "immutable",
            "इतरथा": "otherwise",
            "अजनि": "unborn",
            "च": "and",
            "यन्मयं": "this (soul/self)",
            "तदविमुच्य": "if realizing",
            "नियन्तृ": "controller",
            "भवेत्": "becomes",
            "सममनुजानतां": "understanding equally",
            "यदमतं": "others' opinion",
            "मतदुष्टतया": "due to the evilness of one's own intellect"
        },
        "meaning": " If the limitless, eternal and all pervading soul/self is subject to rules and limitations, then the rule itself becomes contradictory and invalid. However, if one realizes that they are unborn and free from limitations, they become the controller of their own actions and perceive others' opinions equally, overcoming the bias caused by one's own corrupt intellect."
    },
    "bard": {
        "terms": {
            "aparimitāḥ": "unlimited",
            "dhruvāḥ": "steady",
            "tanu-bhṛtaḥ": "having bodies",
            "yadi": "if",
            "sarva-gatāḥ": "all-pervading",
            "tarhi": "then",
            "na": "not",
            "śāsyatā": "be controlled",
            "iti": "thus",
            "niyamaḥ": "regulation",
            "dhruva": "fixed",
            "itarathā": "otherwise",
            "ajani": "do not create",
            "ca": "and",
            "yat-mayam": "which is made of me",
            "tat": "that",
            "avimucya": "not giving up",
            "niyantṛ": "controller",
            "bhavet": "become",
            "samam": "equal",
            "anujānatām": "should be acknowledged",
            "yat": "which",
            "amatam": "immortal",
            "mata": "considered",
            "duṣṭatayā": "by the wicked"
        },
        "meaning": "If all-pervading, steady and having bodies, then why should it not be controlled? This is the fixed regulation. Otherwise, do not create and do not give up that which is made of me, which becomes the controller, and which should be acknowledged as equal, immortal and considered wicked by the wicked."
    }
}