{
    "verse_no": "११-१४-३",
    "verse": "कालेन नष्टा प्रलये वाणीयं वेदसंज्ञिता ।\nमयादौ ब्रह्मणे प्रोक्ता धर्मो यस्यां मदात्मकः ॥",
    "vedabase": {
        "terms": {
            "śrī-bhagavān uvāca": "the Supreme Personality of Godhead said",
            "kālena": "by the influence of time",
            "naṣṭā": "lost",
            "pralaye": "at the time of annihilation",
            "vāṇī": "message",
            "iyam": "this",
            "veda-saṁjñitā": "consisting of the Vedas",
            "mayā": "by Me",
            "ādau": "at the time of creation",
            "brahmaṇe": "unto Lord Brahmā",
            "proktā": "spoken",
            "dharmaḥ": "religious principles",
            "yasyām": "in which",
            "mat-ātmakaḥ": "identical with Me."
        },
        "translation": "The Supreme Personality of Godhead said: By the influence of time, the transcendental sound of Vedic knowledge was lost at the time of annihilation. Therefore, when the subsequent creation took place, I spoke the Vedic knowledge to Brahmā because I Myself am the religious principles enunciated in the Vedas.  ",
        "purport": "Lord Kṛṣṇa explains to Uddhava that although many processes and concepts of spiritual realization are described in the Vedas, the Vedas ultimately recommend devotional service to the Supreme Lord. Lord Kṛṣṇa is the reservoir of all pleasure, and His devotees directly enter into the Lord’s hlādinī, or pleasure-giving, potency. Somehow or other one must fix one’s mind in Lord Kṛṣṇa, and that is not possible without devotional service. One who has not developed his attraction to Lord Kṛṣṇa cannot restrain the senses from inferior engagements. Since other Vedic processes do not actually award Lord Kṛṣṇa to the practitioner, they cannot offer the highest benefit in life. The transcendental sound of the Vedas is itself the highest evidence, but one whose senses and mind are entangled in sense gratification and mental speculation, and whose heart is therefore covered by material dust, cannot directly receive the transcendental Vedic message. Thus one cannot appreciate the exalted position of devotional service to the Lord."
    },
    "gpt": {
        "terms": {
            "kālena": "with time",
            "naṣṭā": "lost",
            "pralaye": "during dissolution",
            "vāṇīyaṁ": "the oral tradition",
            "vedasaṁjñitā": "known as Vedas",
            "mayādau": "in the beginning from me",
            "brahmaṇe": "to Brahma (the creator)",
            "proktā": "was taught",
            "dharmo": "the duties and righteousness",
            "yasyāṁ": "in which (Vedas)",
            "madātmakaḥ": "having me as the essence"
        },
        "meaning": "कालेन नष्टा प्रलये वाणीयं वेदसंज्ञिता ।मयादौ ब्रह्मणे प्रोक्ता धर्मो यस्यां मदात्मकः ॥kālena naṣṭā pralaye vāṇīyaṁ vedasaṁjñitā ।mayādau brahmaṇe proktā dharmo yasyāṁ madātmakaḥ ॥Meaning:Breakdown:In this verse, the speaker is explaining the origin and significance of the Vedas. They mention that with the passage of time and during the dissolution of the universe, the oral tradition of the Vedas was lost. However, in the beginning, the speaker themselves taught the Vedas to Brahma, the creator. These Vedas contain the knowledge of duties and righteousness, with the speaker's essence being an integral part of them.Overall, the verse emphasizes the eternal nature of the Vedas and their connection to the divine. It suggests that the Vedas were not created by humans, but rather passed down from a divine source."
    },
    "bard": {
        "terms": {
            "śrī-bhagavān": "Śrī Bhagavān",
            "uvāca": "said",
            "kālena": "by time",
            "naṣṭā": "destroyed",
            "pralaya": "dissolution",
            "vāṇī": "speech",
            "iyam": "this",
            "veda-saṁjñitā": "known as Vedas",
            "mayā": "by me",
            "ādau": "in the beginning",
            "brahmaṇe": "to Brahmā",
            "proktā": "spoken",
            "dharmaḥ": "religion",
            "yasyām": "in which",
            "mat-ātmakaḥ": "my own self"
        },
        "meaning": ""
    }
}