{
    "verse_no": "११-१४-२४",
    "verse": "वाग् गद्गदा द्रवते यस्य चित्तं रुदत्यभीक्ष्णं हसति क्व‍‍चिच्च ।\n विलज्ज उद्गायति नृत्यते च मद्भ‍‍क्तियुक्तो भुवनं पुनाति ॥",
    "learning": {
        "पुनाति": "पुन् -> to purify"
    },
    "vedabase": {
        "terms": {
            "vāk": "speech",
            "gadgadā": "choked up",
            "dravate": "melts",
            "yasya": "of whom",
            "cittam": "the heart",
            "rudati": "cries",
            "abhīkṣṇam": "again and again",
            "hasati": "laughs",
            "kvacit": "sometimes",
            "ca": "also",
            "vilajjaḥ": "ashamed",
            "udgāyati": "sings out loudly",
            "nṛtyate": "dances",
            "mat-bhakti-yuktaḥ": "one fixed in devotional service to Me",
            "bhuvanam": "the universe",
            "punāti": "purifies."
        },
        "translation": "A devotee whose speech is sometimes choked up, whose heart melts, who cries continually and sometimes laughs, who feels ashamed and cries out loudly and then dances — a devotee thus fixed in loving service to Me purifies the entire universe.  ",
        "purport": "Vāg gadgadā refers to a highly emotional state in which the throat is choked up and one cannot express oneself. Vilajjaḥ indicates that a devotee sometimes feels embarrassment due to bodily functions and memories of past sinful activities. In this condition, a devotee loudly cries out the holy name of Kṛṣṇa and sometimes dances in ecstasy. As stated here, such a devotee purifies the three worlds. By melting of the heart, one becomes very steady in spiritual life. Normally, one whose heart easily melts is thought to be unsteady; but because Lord Kṛṣṇa is the stable foundation of all existence, one whose heart melts in love of Kṛṣṇa becomes most stable and cannot be disturbed by opposing arguments, bodily suffering, mental problems, supernatural disasters or the interference of envious persons. Because such a devotee is fixed in loving service to the Lord, he becomes the very heart of the Personality of Godhead."
    },
    "gpt": {
        "terms": {
            "वाग्": "speech",
            "गद्गदा": "choked, faltering",
            "द्रवते": "flows",
            "यस्य": "whose",
            "चित्तं": "mind",
            "रुदति": "cries",
            "अभीक्ष्णं": "occasionally, sometimes",
            "हसति": "laughs",
            "क्वचित्": "sometimes",
            "च": "and",
            "विलज्ज": "feels ashamed",
            "उद्गायति": "sings",
            "नृत्यते": "dances",
            "मद्भक्तियुक्तः": "filled with devotion",
            "भुवनं": "the world",
            "पुनाति": "purifies"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "vāk `speech'": "ga-d-ga-dā `stammering'",
            "dravate `flows'": "drav",
            "yasya `whose'": "ya",
            "cittam `mind'": "cit",
            "rudati `weeps'": "ru",
            "abhīkṣṇam `abundantly'": "abhi-kṣi",
            "hasati `laughs'": "has",
            "kvacit `sometimes'": "kva",
            "ca `and'": "ca",
            "vilajjaḥ `shamefully'": "vi-lajj",
            "udgāyati `sings'": "ud-gā",
            "nṛtyate `dances'": "nṛt",
            "mat-bhakti-yuktaḥ `with devotion to me'": "mat-bhakti-yukt",
            "bhuvanam `world'": "bhuvan",
            "punāti `purifies'": "pun",
            "": "whose speech stammers, whose mind weeps abundantly, who laughs sometimes shamefully, who sings and dances with devotion to me, purifies the world"
        },
        "meaning": "vāk gadgadā dravate yasya cittam rudati abhīkṣṇam hasati kvacit ca vilajjaḥ udgāyati nṛtyate mat-bhakti-yuktaḥ bhuvanam punāti"
    }
}