{
    "verse_no": "११-१८-४३",
    "verse": "ब्रह्मचर्यं तपः शौचं सन्तोषो भूतसौहृदम् ।\nगृहस्थस्याप्यृतौ गन्तुः सर्वेषां मदुपासनम् ॥",
    "vedabase": {
        "terms": {
            "brahma-caryam": "celibacy",
            "tapaḥ": "austerity",
            "śaucam": "purity of mind without attachment or repulsion",
            "santoṣaḥ": "full satisfaction",
            "bhūta": "toward all living entities",
            "sauhṛdam": "friendship",
            "gṛhasthasya": "of the householder",
            "api": "also",
            "ṛtau": "at the proper time",
            "gantuḥ": "approaching his wife",
            "sarveṣām": "of all human beings",
            "mat": "of Me",
            "upāsanam": "worship."
        },
        "translation": "A householder may approach his wife for sex only at the time prescribed for begetting children. Otherwise, the householder should practice celibacy, austerity, cleanliness of mind and body, satisfaction in his natural position, and friendship toward all living entities. Worship of Me is to be practiced by all human beings, regardless of social or occupational divisions.  ",
        "purport": "Sarveṣāṁ mad-upāsanam indicates that all followers of the varṇāśrama system must worship Lord Kṛṣṇa or risk falling down from their position. As stated in Śrīmad-Bhāgavatam (11.5.3), na bhajanty avajānanti sthānād bhraṣṭāḥ patanty adhaḥ: even though one may be advanced in the performance of Vedic rituals and customs, without worshiping the Supreme Lord one will certainly fall down. Those in the householder āśrama are not authorized to enjoy life like pigs and dogs, freely exercising their sexual potency. A religious householder should approach his wife at the prescribed time and place and beget a saintly child for the pleasure of the Supreme Lord. Otherwise, it is specifically mentioned here that a householder must practice celibacy along with all of the other members of advanced human civilization. The word śaucam indicates cleanliness of mind and body, or else freedom from attachment and repulsion. One who faithfully worships God as the supreme controller experiences santoṣa, full satisfaction in whatever situation the Lord arranges. By seeing Lord Kṛṣṇa within everyone, one becomes bhūta-suhṛt, the well-wishing friend of all."
    },
    "gpt": {
        "terms": {
            "ब्रह्मचर्यं": "Brahmacharyaṁ - Celibacy or the state of being morally and sexually pure",
            "तपः": "Tapaha - Austerity or self-discipline",
            "शौचं": "Śaucaṁ - Cleanliness or purity (both in body and mind)",
            "सन्तोषः": "Santoshaḥ - Contentment or satisfaction",
            "भूतसौहृदम्": "Bhūtasauhṛdam - Friendliness or compassion towards all beings",
            "गृहस्थस्यापि": "Gṛhasthasya āpi - Even for a householder (one who is married and living a worldly life)",
            "ऋतौ": "Ṛitau - In all seasons or at all times",
            "गन्तुः": "Gantuḥ - To go or perform",
            "सर्वेषां": "Sarveṣām - Of all",
            "मदुपासनम्": "Madupāsanam - Worship or devotion towards the Divine (literally, the Honeybee)"
        },
        "meaning": " This verse emphasizes the importance of certain virtues and practices in one's life, leading to the ultimate goal of spiritual progress and realization. These virtues are Brahmacharya (celibacy or purity), Tapaha (austerity or self discipline), Śauca (cleanliness or purity in body and mind), and Santosha (contentment or satisfaction). Additionally, the verse highlights the necessity of adopting these virtues not only for ascetics or monks but also for householders (people leading a worldly life)."
    },
    "bard": {
        "terms": {
            "brahmacaryam": "celibacy",
            "tapah": "austerity",
            "saucam": "purity",
            "santoṣaḥ": "contentment",
            "bhūta sauhṛdam": "friendliness towards all beings",
            "gṛhasthasya": "for householders",
            "api": "also",
            "ṛtau gantuḥ": "in all seasons",
            "sarveṣām": "of all",
            "mat upāsanam": "my worship"
        },
        "meaning": ""
    }
}