{
    "verse_no": "११-१९-२१",
    "verse": "आदरः परिचर्यायां सर्वाङ्गैरभिवन्दनम् ।\nमद्भक्तपूजाभ्यधिका सर्वभूतेषु मन्मतिः ॥",
    "vedabase": {
        "terms": {
            "ādaraḥ": "great respect",
            "paricaryāyām": "for My devotional service",
            "sarva-aṅgaiḥ": "with all the limbs of the body",
            "abhivandanam": "offering obeisances",
            "bhakta": "of the devotees",
            "pūjā": "worship",
            "abhyadhikā": "preeminent",
            "sarva-bhūteṣu": "in all living entities",
            "matiḥ": "consciousness"
        },
        "translation": "Firm faith in the blissful narrations of My pastimes, constant chanting of My glories, unwavering attachment to ceremonial worship of Me, praising Me through beautiful hymns, great respect for My devotional service, offering obeisances with the entire body, performing first-class worship of My devotees, consciousness of Me in all living entities, offering of ordinary, bodily activities in My devotional service, use of words to describe My qualities, offering the mind to Me, rejection of all material desires, giving up wealth for My devotional service, renouncing material sense gratification and happiness, and performing all desirable activities such as charity, sacrifice, chanting, vows and austerities with the purpose of achieving Me — these constitute actual religious principles, by which those human beings who have actually surrendered themselves to Me automatically develop love for Me. What other purpose or goal could remain for My devotee?  ",
        "purport": "The words mad-bhakta-pūjābhyadhikā are significant in this verse. Abhyadhikā indicates “superior quality.” The Lord is extremely satisfied with those who offer worship to His pure devotees, and He rewards them accordingly. Because of the Lord’s generous appraisal of His pure devotees, worship of the pure devotees is described as superior to worship of the Lord Himself. The words mad-artheṣv aṅga-ceṣṭā state that ordinary, bodily activities such as brushing the teeth, taking bath, eating, etc., should all be offered to the Supreme Lord as devotional service. The words vacasā mad-guṇeraṇam indicate that whether one speaks in ordinary, crude language or with learned poetic eloquence, one should describe the glories of the Personality of Godhead. The words mad-arthe ’rtha-parityāgaḥ indicate that one should spend one’s money for festivals glorifying the Personality of Godhead, such as Ratha-yātrā, Janmāṣṭamī and Gaura-pūrṇimā. Also, one is herein instructed to spend money to assist the mission of one’s spiritual master and other Vaiṣṇavas. Wealth that cannot be used properly in the Lord’s service and is thus an impediment to one’s clear consciousness should be given up entirely. The word bhogasya refers to sense gratification, headed by sex enjoyment, and sukhasya refers to sentimental material happiness, such as excessive family attachment. The words dattaṁ hutam indicate that one should offer to brāhmaṇas and Vaiṣṇavas first-class foods cooked in ghee. One should offer the vibration svāhā to Lord Viṣṇu in an authorized sacrificial fire along with grains and ghee. The word japtam indicates that one should constantly chant the holy names of the Lord."
    },
    "gpt": {
        "terms": {
            "आदरः (aadarah)": "respect, reverence",
            "परिचर्यायाम् (paricaryaayam)": "in service, through service",
            "सर्वाङ्गैरभिवन्दनम् (sarvaangairabhivandanam)": "offering salutation with all limbs",
            "मद्भक्तपूजाभ्यधिका (madbhaktapoojaabhyadhikaa)": "greater than worship of me, devotion to me",
            "सर्वभूतेषु (sarvabhooteshu)": "in all beings",
            "मन्मतिः (manmatih)": "thought, opinion, mindset"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "śraddhā": "faith",
            "amṛta": "nectar",
            "kathāyām": "in conversation",
            "me": "my",
            "śaśvat": "always",
            "mat": "my",
            "anukīrtanam": "to repeat",
            "pariniṣṭhā": "perfection",
            "ca": "and",
            "pūjāyām": "in worship",
            "stutibhiḥ": "with hymns",
            "stavanam": "praise",
            "mama": "my",
            "ādaraḥ": "respect",
            "paricaryāyām": "in service",
            "sarva-aṅgaiḥ": "with all limbs",
            "abhivandanam": "to bow down",
            "bhakta pūjā": "worship of devotee",
            "abhyadhikā": "greater",
            "sarva-bhūteṣu": "all beings",
            "matiḥ": "thought",
            "mat-artheṣu": "for my purpose",
            "aṅga-ceṣṭā": "physical actions",
            "vacasā": "with words",
            "mat-guṇa": "my qualities",
            "īraṇam": "to remember",
            "mayi": "in me",
            "arpaṇam": "to offer",
            "manasaḥ": "in the mind",
            "sarva-kāma": "all desires",
            "vivarjanam": "to renounce",
            "mat-arthe": "for my purpose",
            "artha": "wealth",
            "parityāgaḥ": "to renounce",
            "bhogasya": "enjoyment",
            "sukhasya": "happiness",
            "iṣṭam": "desired",
            "dattam": "to give",
            "hutam": "to offer",
            "japtam": "to recite",
            "mat-artham": "for my purpose",
            "yat": "that",
            "vrata": "vow",
            "tapaḥ": "austerities",
            "evam": "thus",
            "dharmaiḥ": "by virtues",
            "manuṣyānām": "of human beings",
            "uddhava": "uddhava",
            "ātma-nivedinām": "who have surrendered themselves",
            "sañjāyate": "is produced",
            "bhaktiḥ": "devotion",
            "kaḥ": "what",
            "anyaḥ": "other",
            "arthaḥ": "purpose",
            "asya": "of this",
            "avaśiṣyate": "remains",
            "Faith": "nectar in conversation with me, always."
        },
        "meaning": "Perfection and praise in worship with hymns. Respect in service with all limbs, bowed down. Greater worship of devotee in thought for my purpose. Physical actions, words, my qualities to remember, offer in me. Renunciation of all desires for my purpose, wealth, enjoyment, happiness desired. To give, offer, recite that vow for my purpose, austerities. Thus by virtues of human beings who have surrendered themselves is produced devotion. What other purpose of this remains?"
    }
}