{
    "verse_no": "११-१४-८",
    "verse": "एवं प्रकृतिवैचित्र्याद् भिद्यन्ते मतयो नृणाम् ।\nपारम्पर्येण केषाञ्चित् पाषण्डमतयोऽपरे ॥",
    "ref": [
        "रास पंचध्यायी १८०"
    ],
    "vedabase": {
        "terms": {
            "evam": "thus",
            "prakṛti": "of nature or desires",
            "vaicitryāt": "due to the great variety",
            "bhidyante": "are divided",
            "matayaḥ": "philosophies",
            "nṛṇām": "among human beings",
            "pāramparyeṇa": "by tradition or disciplic succession",
            "keṣāñcit": "among some people",
            "pāṣaṇḍa": "atheistic",
            "apare": "others."
        },
        "translation": "Thus, due to the great variety of desires and natures among human beings, there are many different theistic philosophies of life, which are handed down through tradition, custom and disciplic succession. There are other teachers who directly support atheistic viewpoints.  ",
        "purport": "The word keṣāñcit refers to those persons in various parts of the world who are ignorant of the Vedic conclusion and thus concoct many unauthorized and ultimately fruitless philosophies of life. Pāṣaṇḍa-matayaḥ refers to those who directly oppose the Vedic conclusion. Śrīla Viśvanātha Cakravartī Ṭhākura has given a most interesting example, as follows. The water of the Ganges is always pure and very sweet. On the banks of that great river, however, there are several types of poisonous trees whose roots drink up the Ganges water from the soil and use it to produce poisonous fruits. Similarly, those who are atheistic or demoniac utilize their association with Vedic knowledge to produce the poisonous fruits of atheistic or materialistic philosophy."
    },
    "gpt": {
        "terms": {
            "एवं": "इस प्रकार, इस तरह",
            "प्रकृतिवैचित्र्यात्": "प्रकृति के विविधताओं के कारण",
            "भिद्यन्ते": "विभाजित हो जाते हैं",
            "मतयः": "मत (धर्म, विचार या विश्वास)",
            "नृणाम्": "मनुष्यों के",
            "पारम्पर्येण": "पीढ़ीबद्धता से, परंपरा के माध्यम से",
            "केषाञ्चित्": "कुछ, कई",
            "पाषण्डमतयः": "हेतुधर्मविहीन धारणाओं वाले विश्वास/मत (जो तर्करहित और अनिष्टत्वकर हो सकते हैं)",
            "अपरे": "अन्य"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "evam `": "thus', prakṛti `= nature', vaicitryāt `= diversity', bhidyante `= split', matayaḥ `= opinions', nṛṇām `= of people', pāramparyeṇa `= traditionally', keṣāñcit `= some', pāṣaṇḍa `= superstition', apare `= others'"
        },
        "meaning": "Thus, opinions of people split due to the diversity of nature traditionally; some are superstition, others are not."
    }
}