{
    "verse_no": "११-१२-१४",
    "verse": "तस्मात्त्वमुद्धवोत्सृज्य चोदनां प्रतिचोदनाम् ।\nप्रवृत्तिं च निवृत्तिं च श्रोतव्यं श्रुतमेव च ॥",
    "learning": {
        "उत्सृज्य": "सृज -> छोड़ना, giving up"
    },
    "vedabase": {
        "terms": {
            "tasmāt": "therefore",
            "tvam": "you",
            "uddhava": "O Uddhava",
            "utsṛjya": "giving up",
            "codanām": "the regulations of the Vedas",
            "praticodanām": "the injunctions of supplementary Vedic literatures",
            "pravṛttim": "injunctions",
            "ca": "also",
            "nivṛttim": "prohibitions",
            "śrotavyam": "that which is to be heard",
            "śrutam": "that which has been heard",
            "eva": "actually"
        },
        "translation": "Therefore, My dear Uddhava, abandon the Vedic mantras as well as the procedures of supplementary Vedic literatures and their positive and negative injunctions. Disregard that which has been heard and that which is to be heard.   ",
        "purport": "Śrī Uddhava inquired from Lord Kṛṣṇa about the symptoms of saintly persons and liberated souls, and the Lord has replied in terms of different levels of spiritual advancement, distinguishing between those who are able to understand Lord Kṛṣṇa to be the principal goal of life and those loving devotees who accept Lord Kṛṣṇa and devotional service to Him as the only goal of life. Lord Kṛṣṇa also mentioned that He is captured by His loving devotees and even by those who sincerely associate with His loving devotees. Among all the devotees, the gopīs of Vṛndāvana were described by the Lord as having achieved such a rare state of pure devotional service that Lord Kṛṣṇa personally feels constantly indebted to them. According to Śrīla Viśvanātha Cakravartī Ṭhākura, Lord Kṛṣṇa previously kept the gopīs’ love for Him concealed in His heart because of its confidential nature and the Lord’s own gravity. Finally, however, even Lord Kṛṣṇa could not remain silent about the intense love of the gopīs, and thus in these verses the Lord reveals to Uddhava how the gopīs loved Him in Vṛndāvana and brought Him fully under their control. The Lord would relax in secret places with the loving gopīs, and by conjugal spontaneous affection the greatest love was exchanged between them. As explained by the Lord in Bhagavad-gītā, one cannot achieve the perfection of life merely by renouncing the material world or by executing ordinary, sectarian religious principles. One must actually understand the identity of the Supreme Personality of Godhead, and by associating with His pure devotees one must learn to love the Lord in His personal, original form. This love may be expressed in either the conjugal, parental, fraternal or serving rasa, or relationship. The Lord has elaborately explained to Uddhava the system of philosophical analysis of the material world, and now He clearly concludes that it is useless for Uddhava to waste time in fruitive activities or mental speculation. Actually, Lord Kṛṣṇa is hinting that Uddhava should assimilate the example of the gopīs and try to advance further in Kṛṣṇa consciousness by following in the footsteps of the cowherd damsels of Vraja. Any conditioned soul who is unsatisfied with the cruel laws of nature, which impose disease, old age and death, should understand that Lord Kṛṣṇa can deliver all living beings from the problems of material existence. There is no need to entangle oneself in unauthorized, sectarian rituals, injunctions or prohibitions. One should simply surrender to Lord Kṛṣṇa, following the example of Śrī Caitanya Mahāprabhu, who is Lord Kṛṣṇa Himself. By the authorized regulated process of bhakti-yoga, Kṛṣṇa consciousness, one easily achieves spiritual perfection."
    },
    "gpt": {
        "terms": {
            "तस्मात्": "Therefore/For that reason",
            "त्वम्": "you (singular)",
            "उद्धवोत्सृज्य": "giving up",
            "चोदनां": "advice/guidance",
            "प्रतिचोदनाम्": "counter-advice/instructions",
            "प्रवृत्तिं": "action/duty/engagement",
            "च": "and",
            "निवृत्तिं": "renunciation/withdrawal",
            "श्रोतव्यं": "should be heard",
            "श्रुतम्": "what has been heard",
            "एव": "indeed"
        },
        "meaning": " Therefore, you should give up both the advice and counter advice. You should engage in action and also practice renunciation. Both should be heard and understood."
    },
    "bard": {
        "terms": {
            "tasmāt tvam uddhava": "therefore you uddhava",
            "utsṛjya": "give up",
            "codanām praticodanām": "prohibitions and injunctions",
            "pravṛttim ca nivṛttim": "actions and cessations",
            "śrotavyam": "listen",
            "śrutam eva": "what has been heard",
            "mām": "me",
            "ekam": "only one",
            "śaraṇam": "refuge",
            "ātmānam": "self",
            "sarva-dehinām": "of all beings",
            "yāhi": "go to",
            "sarva-ātma-bhāvena": "with the attitude of the whole self",
            "mayā": "by me",
            "syāḥ hi akutaḥ-bhayaḥ": "there will be no fear."
        },
        "meaning": "Therefore, you uddhava, give up prohibitions and injunctions, actions and cessations, listen to what has been heard and take refuge in me, the only self of all beings. With the attitude of the whole self, go to me and there will be no fear."
    }
}