{
    "verse_no": "११-१४-१५",
    "verse": "न तथा मे प्रियतम आत्मयोनिर्न शङ्करः ।\nन च सङ्कर्षणो न श्रीर्नैवात्मा च यथा भवान् ॥",
    "vedabase": {
        "terms": {
            "na": "nor",
            "tathā": "in the same way",
            "me": "to Me",
            "priya-tamaḥ": "most dear",
            "ātma-yoniḥ": "Lord Brahmā, who is born from My body",
            "śaṅkaraḥ": "Lord Śiva",
            "ca": "also",
            "saṅkarṣaṇaḥ": "My direct expansion Lord Saṅkarṣaṇa",
            "śrīḥ": "the goddess of fortune",
            "eva": "certainly",
            "ātmā": "My own self as the Deity",
            "yathā": "as much as",
            "bhavān": "you."
        },
        "translation": "My dear Uddhava, neither Lord Brahmā, Lord Śiva, Lord Saṅkarṣaṇa, the goddess of fortune nor indeed My own self are as dear to Me as you are.  ",
        "purport": "The Lord has described in the previous verses the unalloyed love of His pure devotees for Him, and now the Lord describes His love for His devotees. Ātma-yoni means Lord Brahmā, who is born directly from the Lord’s body. Lord Śiva always gives great pleasure to Lord Kṛṣṇa by his constant meditation upon Him, and Saṅkarṣaṇa, or Balarāma, is the Lord’s brother in kṛṣṇa-līlā. The goddess of fortune is the Lord’s wife, and the word ātmā here indicates the Lord’s own self as the Deity. None of these personalities — even the Lord’s own self — are as dear to Him as His pure devotee Uddhava, an akiñcana devotee of the Lord. Śrīla Madhvācārya cites from Vedic literature the example that a gentleman sometimes neglects his own interest and that of his children to give charity to a poor beggar. Similarly, the Lord gives preference to a helpless devotee who depends completely on His mercy. The only way to obtain the Lord’s mercy is through His causeless love, and the Lord is most lovingly inclined toward those devotees who are most dependent on Him, just as ordinary mothers and fathers worry more about their helpless children than about those who are self-sufficient. Thus even if one lacks any material qualification, one should simply depend upon the Supreme Personality of Godhead, without any other interest, and surely one will achieve the highest perfection of life."
    },
    "gpt": {
        "terms": {
            "न (na)": "not",
            "तथा (tathā)": "in that way",
            "मे (me)": "to me",
            "प्रियतम (priyatama)": "most beloved",
            "आत्मयोनिः (ātmayoniḥ)": "self-born",
            "शङ्करः (śaṅkaraḥ)": "Shiva",
            "सङ्कर्षणः (saṅkarṣaṇaḥ)": "Sankarshana (Balarama)",
            "श्रीः (śrīḥ)": "Lakshmi",
            "एव (eva)": "indeed",
            "आत्मा (ātmā)": "self",
            "च (ca)": "and",
            "यथा (yathā)": "as",
            "भवान् (bhavān)": "you"
        },
        "meaning": " Not in that way, O beloved self born one, are you to me. In these verses, the speaker is addressing someone who is considered as the beloved and self born. The speaker asserts that the addressed person is not like any other being, including revered deities like Shiva, Sankarshana, and Lakshmi, nor even the concept of the self. The speaker emphasizes that the addressed person is unique and incomparable."
    },
    "bard": {
        "terms": {
            "na": "not",
            "tathā": "so",
            "me": "my",
            "priya-tamaḥ": "dearest",
            "ātma-yoniḥ": "source of self",
            "śaṅkaraḥ": "śiva",
            "ca": "and",
            "saṅkarṣaṇaḥ": "viṣṇu",
            "śrīḥ eva ātmā": "śrī lakṣmī is the self",
            "yathā": "as",
            "bhavān": "you"
        },
        "meaning": "not so dear to me as the source of self śiva and viṣṇu and śrī lakṣmī is the self as you"
    }
}