{
    "verse_no": "११-१९-४२",
    "verse": "मूर्खो देहाद्यहंबुद्धिः पन्था मन्निगमः स्मृतः ।\nउत्पथश्चित्तविक्षेपः स्वर्गः सत्त्वगुणोदयः ॥",
    "vedabase": {
        "terms": {
            "mūrkhaḥ": "a fool",
            "deha": "with the body",
            "ādi": "and so forth (the mind)",
            "aham-buddhiḥ": "one who identifies himself",
            "panthāḥ": "the true path",
            "mat": "to Me",
            "nigamaḥ": "leading",
            "smṛtaḥ": "is to be understood",
            "utpathaḥ": "the wrong path",
            "citta": "of consciousness",
            "vikṣepaḥ": "bewilderment",
            "svargaḥ": "heaven",
            "sattva-guṇa": "of the mode of goodness",
            "udayaḥ": "the predominance"
        },
        "translation": "Actual opulence is My own nature as the Personality of Godhead, through which I exhibit the six unlimited opulences. The supreme gain in life is devotional service to Me, and actual education is nullifying the false perception of duality within the soul. Real modesty is to be disgusted with improper activities, and beauty is to possess good qualities such as detachment. Real happiness is to transcend material happiness and unhappiness, and real misery is to be implicated in searching for sex pleasure. A wise man is one who knows the process of freedom from bondage, and a fool is one who identifies with his material body and mind. The real path in life is that which leads to Me, and the wrong path is sense gratification, by which consciousness is bewildered. Actual heaven is the predominance of the mode of goodness, whereas hell is the predominance of ignorance. I am everyone’s true friend, acting as the spiritual master of the entire universe, and one’s home is the human body. My dear friend Uddhava, one who is enriched with good qualities is actually said to be rich, and one who is unsatisfied in life is actually poor. A wretched person is one who cannot control his senses, whereas one who is not attached to sense gratification is a real controller. One who attaches himself to sense gratification is the opposite, a slave. Thus, Uddhava, I have elucidated all of the matters about which you inquired. There is no need for a more elaborate description of these good and bad qualities, since to constantly see good and bad is itself a bad quality. The best quality is to transcend material good and evil.  ",
        "purport": "The Supreme Personality of Godhead is naturally full of six opulences, namely unlimited beauty, wealth, fame, knowledge, strength and renunciation. Therefore the greatest profit in life is to achieve personal loving service to the Lord, who is naturally the reservoir of all pleasure. Real education means to give up the false idea that anything is separate from the Lord, the source of all potencies. Similarly, one should not falsely consider the individual soul to be different or separate from the Supreme Soul. Mere bashfulness does not constitute modesty. One should spontaneously withdraw in disgust from sinful activities; then one is actually modest or humble. One who is satisfied in Kṛṣṇa consciousness and thus does not seek material pleasure or suffer material unhappiness is considered to be actually situated in happiness. The most wretched person is one addicted to sex pleasure, and a wise man is one who knows the process of freedom from such material bondage. A fool is one who gives up his eternal friendship with Lord Kṛṣṇa and instead identifies himself with his own temporary material body, mind, society, community and family. The real path in life is not simply a modern interstate highway or, in more simple cultures, a footpath free of thorns and mud. It is that path that leads to Lord Kṛṣṇa. The wrong path in life is not simply a road having many thieves or tollbooths; it is that path that leads one to utter confusion in material sense gratification. A heavenly situation is that in which the mode of goodness predominates, rather than that found on the planet of Indra, where passion and ignorance sometimes disturb the celestial atmosphere. Hell is anywhere the mode of ignorance is predominant, and not merely the hellish planets, where, according to Lord Śiva, a pure devotee can think of Kṛṣṇa and remain happy. Our actual friend in life is the bona fide spiritual master, who saves us from all dangers. Among all gurus, Lord Kṛṣṇa is Himself the jagad-guru, or spiritual master of the entire universe. In material life our own material body is our immediate home, rather than some structure of bricks, cement, stone and wood. A rich man is one who possesses innumerable good qualities; he is not a neurotic fool with a large bank account. A poor man is one who is unsatisfied, which is self-explanatory. One who cannot control his senses is certainly wretched and miserable in life, whereas one who detaches himself from material life is actually a lord or controller. In modern times there are remnants of aristocracy in Europe and other countries, but such so-called lords often display the habits of lower forms of life. A real lord is one who conquers material existence by rising to the spiritual platform. A person who is attached to material life will undoubtedly manifest the opposites of all the good qualities mentioned here, and he is thus the symbol of going backward in life. The Lord concludes His analysis by stating that there is no need for further elaboration of these good and bad qualities. Indeed, the purpose of life is to transcend materially good and bad qualities and come to the liberated platform of pure Kṛṣṇa consciousness. This point will be further explained in the following chapter. Thus end the purports of the humble servants of His Divine Grace A.C. Bhaktivedanta Swami Prabhupāda to the Eleventh Canto, Nineteenth Chapter, of the Śrīmad-Bhāgavatam, entitled “The Perfection of Spiritual Knowledge.”"
    },
    "gpt": {
        "terms": {
            "मूर्खः": "A fool",
            "देहाद्यहंबुद्धिः": "Identifying oneself as the body and other external objects",
            "पन्था": "The path",
            "मन्निगमः": "The knowledge of the Self",
            "स्मृतः": "Is considered",
            "उत्पथः": "The entrance",
            "चित्तविक्षेपः": "The distraction of the mind",
            "स्वर्गः": "Heaven",
            "सत्त्वगुणोदयः": "The manifestation of the qualities of goodness"
        },
        "meaning": " This verse highlights the characteristics and consequences of ignorance. It states that a fool is someone who identifies themselves solely with the physical body and other external objects, neglecting their true nature as the eternal Self. The verse emphasizes that the path to self realization is the knowledge of the Self. However, the distraction of the mind and the attachment to worldly desires hinder this realization."
    },
    "bard": {
        "terms": {
            "bhagaḥ": "wealth = fortune",
            "me": "my",
            "aiśvaraḥ": "supreme = lordship",
            "bhāvaḥ": "nature = quality",
            "lābhaḥ": "gain = profit",
            "mat-bhaktiḥ": "devotion to me = worship",
            "uttamaḥ": "best = supreme",
            "vidyā": "knowledge = wisdom",
            "ātmani": "self = soul",
            "bhidā": "division = distinction",
            "bādhaḥ": "impediment = obstacle",
            "jugupsā": "dislike = aversion",
            "hrīḥ": "modesty = humility",
            "akarmasu": "without action = inactive",
            "śrīḥ": "beauty = glory",
            "guṇāḥ": "qualities = attributes",
            "nairapekṣya": "without attachment = indifference",
            "ādyāḥ": "first = primary",
            "sukha": "happiness = pleasure",
            "duḥkha": "sorrow = pain",
            "sukha atyayaḥ": "excess of pleasure = hedonism",
            "duḥkham": "pain = misery",
            "kāma apekṣā": "desire for enjoyment = hedonism",
            "paṇḍitaḥ": "wise = learned",
            "bandha mokṣa vit": "bondage and liberation knower = liberated",
            "mūrkhaḥ": "fool = ignorant",
            "deha ādi": "body etc = material possessions",
            "aham-buddhiḥ": "ego = self-centeredness",
            "panthāḥ": "path = way",
            "mat nigamaḥ": "my teachings = scriptures",
            "smṛtaḥ": "remembered = memorized",
            "utpathaḥ": "wrong path = erroneous thinking",
            "citta vikṣepaḥ": "mental agitation = distraction",
            "svargaḥ": "heaven = abode of peace",
            "sattva-guṇa udayaḥ": "rise of sattva = purification",
            "narakaḥ": "hell = abode of pain",
            "tamaḥ unnāhaḥ": "rise of tamas = ignorance",
            "bandhuḥ": "friend = companion",
            "guruḥ": "teacher = guide",
            "aham": "I = myself",
            "sakhe": "friend = companion",
            "gṛham": "home = body",
            "śarīram": "body = physical form",
            "mānuṣyam": "human = mortal",
            "guṇa āḍhyaḥ hi ucyate": "quality-dominated = characterized by",
            "daridraḥ": "poor = lacking in spiritual wealth",
            "yaḥ": "who",
            "tu": "but",
            "asantuṣṭaḥ": "dissatisfied = discontent",
            "kṛpaṇaḥ": "miserly = greedy",
            "ajita": "unconquered = uncontrolled",
            "indriyaḥ": "senses = passions",
            "guṇeṣu": "qualities = attributes",
            "asakta": "attached = attached",
            "dhīḥ": "intelligence = intellect",
            "īśaḥ": "lord = God",
            "saṅgaḥ": "association = company",
            "viparyayaḥ": "opposite = contrary",
            "ete": "these",
            "uddhava": "uddhava",
            "te": "your",
            "praśnāḥ": "questions = inquiries",
            "sarve": "all",
            "sādhu": "good = beneficial",
            "nirūpitāḥ": "explained = clarified",
            "kim": "what",
            "varṇitena": "to elaborate",
            "bahunā": "with many",
            "lakṣaṇam": "characteristics = features",
            "doṣayoḥ": "of faults = flaws",
            "guṇa-doṣa dṛśiḥ": "quality-defect view = dualistic perspective",
            "doṣaḥ": "fault = flaw",
            "guṇaḥ": "quality = attribute",
            "ubhaya": "both",
            "varjitaḥ": "devoid = free"
        },
        "meaning": "Bhaga is my wealth, nature is my lordship, gain is my devotion to me, best is my wisdom, self is my distinction, impediment is my dislike, modesty is my humility, inactive is my beauty, indifference is my qualities, first is my happiness, excess of pleasure is my sorrow, hedonism is my pain, desire for enjoyment is my misery, learned is my wisdom, bondage and liberation knower is my liberation, ignorant is my foolishness, body etc is my material possessions, self-centeredness is my ego, path is my teachings, scriptures is my memorized, wrong path is my erroneous thinking, mental agitation is my distraction, abode of peace is my heaven, purification is my rise of sattva, abode of pain is my hell, ignorance is my rise of tamas, friend is my companion, guide is my teacher, I myself is my friend, body is my home, physical form is my mortal body, human is my quality-dominated, poor is who is dissatisfied, miserly is who is greedy, uncontrolled senses is who is unconquered, qualities is who is attached, intellect is who is God, company is who is opposite, contrary is who is contrary, all your questions are all good explained, what to elaborate with many characteristics, quality-defect view is both flaws and qualities devoid"
    }
}