{
    "verse_no": "११-२६-१",
    "verse": "मल्ल‍क्षणमिमं कायं लब्ध्वा मद्धर्म आस्थितः ।\nआनन्दं परमात्मानमात्मस्थं समुपैति माम् ॥",
    "vedabase": {
        "terms": {
            "śrī-bhagavān uvāca": "the Supreme Personality of Godhead said",
            "mat-lakṣaṇam": "in which I can be realized",
            "imam": "this",
            "kāyam": "human body",
            "labdhvā": "having achieved",
            "mat-dharme": "in devotional service to Me",
            "āsthitaḥ": "situated",
            "ānandam": "who is pure ecstasy",
            "parama-ātmānam": "the Supreme Soul",
            "ātma-stham": "situated within the heart",
            "samapaiti": "he achieves",
            "mām": "Me."
        },
        "translation": "The Supreme Personality of Godhead said: Having achieved this human form of life, which affords one the opportunity to realize Me, and being situated in My devotional service, one can achieve Me, the reservoir of all pleasure and the Supreme Soul of all existence, residing within the heart of every living being.  ",
        "purport": "Because of bad association, even those who are spiritually liberated may fall down from self-realization. Within the material world the association of women is especially dangerous, and therefore in this chapter the Aila-gītā is spoken to prevent such a falldown. One can be saved from sex attraction by association with saintly persons, who awaken one’s real spiritual intelligence. Therefore Lord Kṛṣṇa will speak to Uddhava the amazing song of Purūravā, also known as the Aila-gītā."
    },
    "gpt": {
        "terms": {
            "मल्लक्षणमिमं कायं लब्ध्वा": "Obtaining (लब्ध्वा) this (इमं) body (कायं) with its distinguishing features (मल्लक्षणम्)",
            "मद्धर्म आस्थितः": "Being established (आस्थितः) in (मद्धर्म) my (मद्) own nature (धर्म)",
            "आनन्दं परमात्मानम्": "Supreme (परम) bliss (आनन्दं) of the divine self (परमात्मानम्)",
            "आत्मस्थं समुपैति": "Brings me closer (समुपैति) to my own self (आत्मस्थं)",
            "माम्": "Me (माम्)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "śrī-bhagavān uvāca": "śrī bhagavān said",
            "mat-lakṣaṇam imam kāyam labdhvā": "attaining my form in this body",
            "mat-dharme āsthitaḥ": "established in my dharma",
            "ānandam parama-ātmānam ātma-stham samapaiti mām": "attains the supreme bliss of the self and merges in me"
        },
        "meaning": "śrī bhagavān said: attaining my form in this body, established in my dharma, attains the supreme bliss of the self and merges in me"
    }
}