{
    "verse_no": "११-२०-६",
    "verse": "योगास्त्रयो मया प्रोक्ता नृणां श्रेयोविधित्सया ।\nज्ञानं कर्म च भक्तिश्च नोपायोऽन्योऽस्ति कुत्रचित् ॥",
    "vedabase": {
        "terms": {
            "śrī-bhagavān uvāca": "the Supreme Personality of Godhead said",
            "yogāḥ": "processes",
            "trayaḥ": "three",
            "mayā": "by Me",
            "proktāḥ": "described",
            "nṝṇām": "of human beings",
            "śreyaḥ": "perfection",
            "vidhitsayā": "desiring to bestow",
            "jñānam": "the path of philosophy",
            "karma": "the path of work",
            "ca": "also",
            "bhaktiḥ": "the path of devotion",
            "na": "no",
            "upāyaḥ": "means",
            "anyaḥ": "other",
            "asti": "exists",
            "kutracit": "whatsoever."
        },
        "translation": "The Supreme Personality of Godhead said: My dear Uddhava, because I desire that human beings may achieve perfection, I have presented three paths of advancement — the path of knowledge, the path of work and the path of devotion. Besides these three there is absolutely no other means of elevation.  ",
        "purport": "Ultimately, the goal of philosophical speculation, pious regulated work and devotional service is the same — Kṛṣṇa consciousness. As stated by the Lord in Bhagavad-gītā (4.11): ye yathā māṁ prapadyantetāṁs tathaiva bhajāmy ahammama vartmānuvartantemanuṣyāḥ pārtha sarvaśaḥ “All of them — as they surrender unto Me — I reward accordingly. Everyone follows My path in all respects, O son of Pṛthā.” Although all authorized processes of human perfection ultimately lead to Kṛṣṇa consciousness, or love of God, various performers have specific propensities and qualifications and thus gravitate to different methods of self-realization. Lord Kṛṣṇa here describes the three authorized processes together in order to emphasize that their ultimate goal is one. At the same time, philosophical speculation and regulated pious work can never be considered equal to pure love of Godhead, as the Lord has elaborately clarified in the previous chapters. The word trayaḥ, or “three,” indicates that despite their ultimate oneness of purpose, the three paths display diversity in progress and achievement. One cannot achieve the same result by mere speculation or piety that one achieves by directly surrendering to the Personality of Godhead, depending completely on His mercy and friendship. The word karma here indicates work dedicated to the Personality of Godhead. As described in Bhagavad-gītā (3.9): yajñārthāt karmaṇo ’nyatraloko ’yaṁ karma-bandhanaḥtad-arthaṁ karma kaunteyamukta-saṅgaḥ samācara “Work done as a sacrifice for Viṣṇu has to be performed; otherwise work binds one to this material world. Therefore, O son of Kuntī, perform your prescribed duties for His satisfaction, and in that way you will always remain unattached and free from bondage.” In the process of jñāna, one seeks impersonal liberation by merging into the glaring effulgence of the Personality of Godhead. Such liberation is considered hellish by the devotees, because by merging one loses all awareness of the supreme blissful feature of the Lord as Bhagavān, the supreme person. The performers of karma, or regulated work, seek the three aspects of human progress other than liberation — namely religiosity, economic development and sense gratification. The fruitive workers think that by exhausting each of their innumerable material desires they will gradually come out of the dark tunnel of material existence into the clear light of spiritual liberation. This process is very dangerous and uncertain, because not only is there virtually no limit to material desires, but even a slight flaw in the process of regulated work constitutes sin and throws one off the path of progressive life. The devotees directly aim for love of Godhead and are therefore most pleasing to the Supreme Lord. In any case, all three divisions of Vedic elevation depend completely on the mercy of Lord Kṛṣṇa. One cannot progress along any one of these paths without the blessings of the Lord. Other Vedic processes, such as austerity, charity and so forth, are included within the three primary divisions described here."
    },
    "gpt": {
        "terms": {
            "योगास्त्रयो मया प्रोक्ता": "The three paths of yoga have been described by me,",
            "नृणां श्रेयोविधित्सया": "for the benefit and welfare of mankind.",
            "ज्ञानं कर्म च भक्तिश्च": "The paths are knowledge, action, and devotion.",
            "नोपायोऽन्योऽस्ति कुत्रचित्": "There is no other means anywhere."
        },
        "meaning": " These verses emphasize that three different paths to attain spiritual realization have been delineated. The speaker claims to have expounded these paths for the well being and ultimate good of human beings. The three paths mentioned are Jnana Yoga (path of knowledge), Karma Yoga (path of selfless action), and Bhakti Yoga (path of devotion). The verse emphasizes that these three paths are the only means available for spiritual progress and fulfillment, and there is no other alternative for attaining liberation or self-realization."
    },
    "bard": {
        "terms": {
            "śrī-bhagavān": "` Śrī Bhagavān`",
            "uvāca": "` said`",
            "yogāḥ": "` yogas`",
            "trayaḥ": "` three`",
            "mayā": "` by me`",
            "proktāḥ": "` are told`",
            "nṝṇām": "` to the people`",
            "śreyaḥ": "` for the well-being`",
            "vidhitsayā": "` with the instruction`",
            "jñānam": "` knowledge`",
            "karma": "` action`",
            "ca": "` and`",
            "bhaktiḥ": "` devotion`",
            "na": "` no`",
            "upāyaḥ": "` means`",
            "anyaḥ": "` other`",
            "asti": "` there is`",
            "kutracit": "` anywhere`"
        },
        "meaning": "Śrī Bhagavān said: Three yogas are told by me to the people for their well-being with the instruction that knowledge, action and devotion are the only means to attain the goal."
    }
}