{
    "verse_no": "११-२१-३६",
    "verse": "शब्दब्रह्म सुदुर्बोधं प्राणेन्द्रियमनोमयम् ।\nअनन्तपारं गम्भीरं दुर्विगाह्यं समुद्रवत् ॥",
    "vedabase": {
        "terms": {
            "śabda-brahma": "the transcendental sound of the Vedas",
            "su-durbodham": "extremely difficult to comprehend",
            "prāṇa": "of the vital air",
            "indriya": "senses",
            "manaḥ": "and mind",
            "mayam": "manifesting on the different levels",
            "ananta-pāram": "without limit",
            "gambhīram": "deep",
            "durvigāhyam": "unfathomable",
            "samudra-vat": "like the ocean."
        },
        "translation": "The transcendental sound of the Vedas is very difficult to comprehend and manifests on different levels within the prāṇa, senses and mind. This Vedic sound is unlimited, very deep and unfathomable, just like the ocean.  ",
        "purport": "According to Vedic knowledge, the Vedic sound is divided into four phases, which can be understood only by the most intelligent brāhmaṇas. This is because three of the divisions are internally situated within the living entity and only the fourth division is externally manifested, as speech. Even this fourth phase of Vedic sound, called vaikharī, is very difficult to understand for ordinary human beings. Śrīla Viśvanātha Cakravartī Ṭhākura explains these divisions as follows. The prāṇa phase of Vedic sound, known as parā, is situated in the ādhāra-cakra; the mental phase, known as paśyantī, is situated in the area of the navel, on the maṇipūraka-cakra; the intellectual phase, known as madhyamā, is situated in the heart area, in the anāhata-cakra. Finally, the manifest sensory phase of Vedic sound is called vaikharī. Such Vedic sound is ananta-pāra because it comprehends all vital energies within the universe and beyond and is thus undivided by time or space. Actually, Vedic sound vibration is so subtle, unfathomable and deep that only the Lord Himself and His empowered followers such as Vyāsa and Nārada can understand its actual form and meaning. Ordinary human beings cannot comprehend all of the intricacies and subtleties of Vedic sound, but if one takes to Kṛṣṇa consciousness one can immediately understand the conclusion of all Vedic knowledge, namely Lord Kṛṣṇa Himself, the original source of Vedic knowledge. Foolish persons devote their vital air, senses and mind to sense gratification and thus do not understand the transcendental value of the holy name of God. Ultimately, the essence of all Vedic sound is the holy name of the Supreme Lord, which is not different from the Lord Himself. Since the Lord is unlimited, His holy name is equally unlimited. No one can understand the transcendental glories of the Lord without the Lord’s direct mercy. By offenselessly chanting the holy names Hare Kṛṣṇa, Hare Kṛṣṇa, Kṛṣṇa Kṛṣṇa, Hare Hare/ Hare Rāma, Hare Rāma, Rāma Rāma, Hare Hare, one can enter into the transcendental mysteries of Vedic sound. Otherwise the knowledge of the Vedas will remain durvigāhyam, or impossible to penetrate."
    },
    "gpt": {
        "terms": {
            "शब्दब्रह्म (śabda": "brahma) - The transcendental sound vibration that represents the Supreme Absolute Truth.",
            "सुदुर्बोधं (su": "dur-bodhaṁ) - Extremely difficult to comprehend or understand.",
            "प्राणेन्द्रियमनोमयम् (prāṇendriya": "manomayam) - Filled with life force, senses, and mind.",
            "अनन्तपारं (ananta": "pāraṁ) - Infinite and unlimited.",
            "गम्भीरं (gambhīraṁ)": "Profound and deep.",
            "दुर्विगाह्यं (dur": "vigāhyaṁ) - Impossible to fathom or explore fully.",
            "समुद्रवत् (samudra": "vat) - Like the ocean."
        },
        "meaning": " This verse describes the nature of the transcendental sound vibration, known as shabda brahma. It states that shabda-brahma is extremely difficult to comprehend or understand. It is manifested in the form of the life force, senses, and mind. Shabda-brahma is also infinite and unlimited, and its depth is profound. It is impossible to fully explore or comprehend, similar to the vastness of the ocean."
    },
    "bard": {
        "terms": {
            "śabda-brahma `": "` sound-Brahman",
            "su-durbodham `": "` very hard to understand",
            "prāṇa `": "` breath",
            "indriya `": "` sense organs",
            "manaḥ `": "` mind",
            "mayam `": "` illusion",
            "ananta-pāram `": "` limitless",
            "gambhīram `": "` deep",
            "durvigāhyam `": "` difficult to cross",
            "samudra-vat `": "` like an ocean"
        },
        "meaning": "Sound-Brahman is very hard to understand, like an ocean, it is limitless, deep, difficult to cross. It is the illusion of the mind, breath, and sense organs."
    }
}