{
    "verse_no": "११-६-४६",
    "verse": "त्वयोपभुक्तस्रग्गन्धवासोऽलङ्कारचर्चिता: ।\nउच्छिष्टभोजिनो दासास्तव मायां जयेमहि ॥",
    "vedabase": {
        "terms": {
            "tvayā": "by You",
            "upabhukta": "already enjoyed",
            "srak": "with the garlands",
            "gandha": "fragrances",
            "vāsaḥ": "garments",
            "alaṅkāra": "and ornaments",
            "carcitāḥ": "adorned",
            "ucchiṣṭa": "the remnants of Your food",
            "bhojinaḥ": "eating",
            "dāsāḥ": "Your servants",
            "tava": "Your",
            "māyām": "illusory energy",
            "jayema": "we will conquer",
            "hi": "indeed."
        },
        "translation": "Simply by decorating ourselves with the garlands, fragrant oils, clothes and ornaments that You have already enjoyed, and by eating the remnants of Your meals, we, Your servants, will indeed conquer Your illusory energy.  ",
        "purport": "It is clear from this verse that Uddhava is not approaching the Lord for liberation from the illusory energy. As a personal, confidential associate of Lord Kṛṣṇa, Uddhava was undoubtedly a completely liberated soul. He is praying to the Lord because he cannot bear the thought of living without Kṛṣṇa even for a moment. This feeling is called love of God. Uddhava is addressing the Lord as follows: “Even if Your illusory energy tries to attack us, my Lord, we will very easily conquer her by our powerful weapons, which are the remnants of Your foodstuffs, clothes, ornaments, and so on. In other words, we will easily conquer over māyā by kṛṣṇa-prasādam, and not by useless speculation and mental concoction.”"
    },
    "gpt": {
        "terms": {
            "त्वया": "by you",
            "उपभुक्तः": "enjoyed/used",
            "स्रग्गन्धवासः": "garlands and fragrant garments",
            "अलङ्कारचर्चिताः": "adorned with decorations",
            "उच्छिष्टभोजिनः": "those who partake of the remnants of food",
            "दासाः": "servants",
            "तव": "your",
            "मायां": "illusion/magic",
            "जयेमहि": "we shall conquer"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "tvai": "`by you`",
            "upabhukta": "`used`",
            "srak": "`garland`",
            "gandha": "`fragrance`",
            "vāsaḥ": "`clothing`",
            "alaṅkāra": "`ornaments`",
            "carcitāḥ": "`adorned`",
            "ucchiṣṭa": "`leftovers`",
            "bhojinaḥ": "`food`",
            "dāsāḥ": "`servants`",
            "tava": "`your`",
            "māyām": "`illusion`",
            "jayema": "`we will conquer`",
            "hi": "`indeed`"
        },
        "meaning": "By you used garland, fragrance, clothing, ornaments adorned, leftovers food servants your illusion we will conquer indeedRephrase:Your servants who wear garlands, use fragrances, wear ornaments, and eat leftovers, we will conquer your illusion indeed."
    }
}