{
    "verse_no": "११-९-२७",
    "verse": "जिह्वैकतोऽमुमपकर्षति कर्हि तर्षा शिश्न‍ोऽन्यतस्त्वगुदरं श्रवणं कुतश्चित् ।\nघ्राणोऽन्यतश्चपलद‍ृक् क्व‍ च कर्मशक्तिर्बह्व्यः सपत्न्‍य इव गेहपतिं लुनन्ति ॥",
    "meaning": "ये जीवात्मा इसको 11 इंद्रियाँ अपनी अपनी ओर खींचती हैं सब स्वार्थी हैं कहती हैं हमको ऐसी चीज़ दिखाओ जिससे आनन्द मिल जाए कौन कहता है नहीं दिखाओ मत ऐसा सुनाओ शब्द की आनंद मिल जाए नाजका कहती हैं इन दोनों की नहीं सुनो ऐसा गंध 2 की समाधि हो जाए तो क्या कहती है ऐसा स्पर्श 2 रचना कहती हैं ये सब बकवास करते हैं हमारी बात सुनो ऐसा रसीला पदार्थ 2 जिसे खा कर आनंद मग्न हो जाए सब इंद्रियां अपनी अपनी ओर खींच रही हैं 2 इंद्रियों में भी मैत्री नहीं हैं",
    "vedabase": {
        "terms": {
            "jihvā": "the tongue",
            "ekataḥ": "on one side",
            "amum": "the body or the conditioned soul who identifies with the body",
            "apakarṣati": "drags away",
            "karhi": "sometimes",
            "tarṣā": "thirst",
            "śiśnaḥ": "the genitals",
            "anyataḥ": "from another side",
            "tvak": "the sense of touch",
            "udaram": "the belly",
            "śravaṇam": "the ears",
            "kutaścit": "from somewhere else",
            "ghrāṇaḥ": "the sense of smell",
            "capala-dṛk": "the fickle eyes",
            "kva ca": "somewhere else",
            "karma-śaktiḥ": "the other active organs and limbs of the body",
            "bahvyaḥ": "many",
            "sa-patnyaḥ": "co-wives",
            "iva": "like",
            "geha-patim": "the head of the household",
            "lunanti": "pull in many directions."
        },
        "translation": "A man who has many wives is constantly harassed by them. He is responsible for their maintenance, and thus all the ladies constantly pull him in different directions, each struggling for her self-interest. Similarly, the material senses harass the conditioned soul, pulling him in many different directions at once. On one side the tongue is pulling him to arrange tasty food; then thirst drags him to get a suitable drink. Simultaneously the sex organs clamor for satisfaction, and the sense of touch demands soft, sensuous objects. The belly harasses him until it is filled, the ears demand to hear pleasing sounds, the sense of smell hankers for pleasant aromas, and the fickle eyes clamor for pleasing sights. Thus the senses, organs and limbs, all desiring satisfaction, pull the living entity in many directions.  ",
        "purport": "Śrīla Viśvanātha Cakravartī Ṭhākura mentions that after understanding this verse one should merely offer, without attachment, the bare necessities to the guru of one’s body. One should keep one’s body fit and working in the simplest possible way, and that is the sum and substance of service to this so-called guru. If one desires to faithfully serve the body, one should consider that the body pulls the consciousness of the conditioned soul in many ways at once, and thus for the servant of the body there is no possibility of understanding God or even of becoming peaceful."
    },
    "gpt": {
        "terms": {
            "जिह्वैकतः": "The tongue alone",
            "अमुम्": "this (sense objects)",
            "अपकर्षति": "attracts",
            "कर्हि तर्षा": "at any time, any desire",
            "शिश्नोऽन्यतः": "the genitals do not",
            "वगुदरं": "the belly",
            "श्रवणं": "the ears",
            "कुतश्चित्": "at any place",
            "घ्राणः अन्यतः": "the nose does not",
            "चपलदृक्": "the eyes are restless",
            "क्वचित्": "at any time",
            "कर्मशक्तिः": "the hands have the ability to work",
            "बह्व्यः": "much",
            "सपत्न्यः इव": "like a co-wife",
            "गेहपतिम् लुनन्ति": "they destroy the husband-property"
        },
        "meaning": " This verse highlights the power of the different senses. The tongue alone has the ability to attract desires towards sense objects at any given time. The genitals, on the other hand, do not have this power. The belly, ears, and nose also do not have the same level of attraction towards sense objects. The eyes are always restless and constantly seeking visual stimulation. The hands, however, have the ability to perform various actions. Just like co wives who destroy the property of their husband, these senses can destroy a person's focus and productivity."
    },
    "bard": {
        "terms": {
            "jihvā": "` tongue`",
            "ekatah": "` one`",
            "amum": "` this`",
            "apakarṣati": "` pull`",
            "karhi": "` where`",
            "tarṣā": "` thirst`",
            "śiśnaḥ": "` penis`",
            "anyataḥ": "` other`",
            "tvak": "` skin`",
            "udaram": "` belly`",
            "śravaṇam": "` ear`",
            "kutaścit": "` somewhere`",
            "ghrāṇaḥ": "` nose`",
            "capala-dṛk": "` flickering`",
            "kva ca": "` where`",
            "karma-śaktiḥ": "` power of action`",
            "bahvyaḥ": "` many`",
            "sa-patnyaḥ iva": "` like co-wives`",
            "geha-patim": "` husband of the house`",
            "lunanti": "` pull`"
        },
        "meaning": "tongue pulls one way, penis another, skin, belly, ear, nose somewhere, flickering power of action, many co-wives pull husband of the houseMany wives pull their husband of the house in different directions - tongue, penis, skin, belly, ear, nose, flickering power of action."
    }
}