{
    "verse_no": "२-२-३४",
    "verse": "भगवान् ब्रह्म कार्त्स्‍न्येन त्रिरन्वीक्ष्य मनीषया ।\nतदध्यवस्यत् कूटस्थो रतिरात्मन् यतो भवेत् ॥",
    "learnings": {
        "कूट": "unchanging, tranquil, firmly, solid"
    },
    "vedabase": {
        "terms": {
            "bhagavān": "the great personality Brahmā",
            "brahma": "the Vedas",
            "kārtsnyena": "by summarization",
            "triḥ": "three times",
            "anvīkṣya": "scrutinizingly examined",
            "manīṣayā": "with scholarly attention",
            "tat": "that",
            "adhyavasyat": "ascertained it",
            "kūṭa-sthaḥ": "with concentration of the mind",
            "ratiḥ": "attraction",
            "ātman (ātmani)": "unto the Supreme Personality of Godhead Śrī Kṛṣṇa",
            "yataḥ": "by which",
            "bhavet": "it so happens."
        },
        "translation": "The great personality Brahmā, with great attention and concentration of the mind, studied the Vedas three times, and after scrutinizingly examining them, he ascertained that attraction for the Supreme Personality of Godhead Śrī Kṛṣṇa is the highest perfection of religion.  ",
        "purport": "Śrī Śukadeva Gosvāmī is referring to the highest Vedic authority, Lord Brahmā, who is the qualitative incarnation of Godhead. The Vedas were taught to Brahmājī in the beginning of the material creation. Although Brahmājī was to hear Vedic instructions directly from the Personality of Godhead, in order to satisfy the inquisitiveness of all prospective students of the Vedas, Brahmājī, just like a scholar, studied the Vedas three times, as generally done by all scholars. He studied with great attention, concentrating on the purpose of the Vedas, and after scrutinizingly examining the whole process, he ascertained that becoming a pure, unalloyed devotee of the Supreme Personality of Godhead Śrī Kṛṣṇa is the topmost perfection of all religious principles. And this is the last instruction of the Bhagavad-gītā directly presented by the Personality of Godhead. The Vedic conclusion is thus accepted by all ācāryas, and those who are against this conclusion are only veda-vāda-ratas, as explained in the Bhagavad-gītā (2.42)."
    },
    "gpt": {
        "terms": {
            "भगवान्": "God",
            "ब्रह्म": "Brahma",
            "कार्त्स्‍न्येन": "completely",
            "त्रिरन्वीक्ष्य": "having scrutinized three times",
            "मनीषया": "with intelligence",
            "तदध्यवस्यत्": "he decided",
            "कूटस्थो": "unchangeable entity",
            "रतिरात्मन्": "pleasure in self",
            "यतो": "from which",
            "भवेत्": "it would be"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "bhagavān": "lord",
            "brahma": "brahma",
            "kārtsnyena": "completely",
            "triḥ": "three",
            "anvīkṣya": "looked",
            "manīṣayā": "mind",
            "tat": "that",
            "adhyavasyat": "fixed",
            "kūṭa-sthaḥ": "situated in the highest",
            "ratiḥ": "delight",
            "ātman (ātmani)": "self",
            "yataḥ": "from which",
            "bhavet": "arises"
        },
        "meaning": "Lord Brahma completely looked at the three worlds with his mind, fixed that in his heart, and the delight from that arises from the self situated in the highest."
    }
}