{
    "verse_no": "२-३-२०",
    "verse": "बिले बतोरुक्रमविक्रमान् ये न श‍ृण्वतः कर्णपुटे नरस्य ।\nजिह्वासती दार्दुरिकेव सूत न चोपगायत्युरुगायगाथाः ॥",
    "vedabase": {
        "terms": {
            "bile": "snake holes",
            "bata": "like",
            "urukrama": "the Lord, who acts marvelously",
            "vikramān": "prowess",
            "ye": "all these",
            "na": "never",
            "śṛṇvataḥ": "heard",
            "karṇa-puṭe": "the earholes",
            "narasya": "of the man",
            "jihvā": "tongue",
            "asatī": "useless",
            "dārdurikā": "of the frogs",
            "iva": "exactly like that",
            "sūta": "O Sūta Gosvāmī",
            "ca": "also",
            "upagāyati": "chants loudly",
            "urugāya": "worth singing",
            "gāthāḥ": "songs."
        },
        "translation": "One who has not listened to the messages about the prowess and marvelous acts of the Personality of Godhead and has not sung or chanted loudly the worthy songs about the Lord is to be considered to possess earholes like the holes of snakes and a tongue like the tongue of a frog.  ",
        "purport": "Devotional service to the Lord is rendered by all limbs or parts of the body. It is the transcendental dynamic force of the spirit soul; therefore a devotee is engaged one hundred percent in the service of the Lord. One can engage in devotional service when the senses of the body are purified in relation with the Lord, and one can render service to the Lord with the help of all the senses. As such, the senses and the action of the senses are to be considered impure or materialistic as long as they are employed only in sense gratification. The purified senses are engaged not in sense gratification but in the service of the Lord in toto. The Lord is the Supreme with all senses, and the servitor, who is part and parcel of the Lord, also has the same senses. Service to the Lord is the completely purified use of the senses, as described in the Bhagavad-gītā. The Lord imparted instructions with full senses, and Arjuna received them with full senses, and thus there was a perfect exchange of sensible and logical understanding between the master and the disciple. Spiritual understanding is nothing like an electrical charge from the master to the disciple, as foolishly claimed by some propaganda-mongers. Everything is full of sense and logic, and the exchange of views between the master and disciple is possible only when the reception is submissive and real. In the Caitanya-caritāmṛta it is said that one should receive the teaching of Lord Caitanya with intellect and full senses so that one can logically understand the great mission. In the impure state of a living being, the various senses are fully engaged in mundane affairs. If the ear is not engaged in the service of the Lord by hearing about Him from Bhagavad-gītā or Śrīmad-Bhāgavatam, certainly the holes of the ear will be filled with some rubbish. Therefore the messages of Bhagavad-gītā and Śrīmad-Bhāgavatam should be preached all over the world very loudly. That is the duty of a pure devotee who has actually heard about them from the perfect sources. Many want to speak something to others, but because they are not trained to speak on the subject matter of Vedic wisdom they are all speaking nonsense, and people are receiving them with no sense. There are hundreds and thousands of sources for distributing mundane news of the world, and people of the world are also receiving it. Similarly, the people of the world should be taught to hear the transcendental topics of the Lord, and the devotee of the Lord must speak loudly so that they can hear. The frogs loudly croak, with the result that they invite the snakes to eat them. The human tongue is especially given for chanting the Vedic hymns and not for croaking like frogs. The word asatī used in this verse is also significant. Asatī means a woman who has become a prostitute. A prostitute has no reputation for good womanly qualities. Similarly, the tongue, which is given to the human being for chanting the Vedic hymns, will be considered a prostitute when engaged in chanting some mundane nonsense."
    },
    "gpt": {
        "terms": {
            "बिले": "in a hole/crevice",
            "बतोरुक्रमविक्रमान्": "the mighty deeds of Rama (Batoru Kramavikraman)",
            "ये": "those",
            "न": "not",
            "श‍ृण्वतः": "hearing",
            "कर्णपुटे": "in their ears",
            "नरस्य": "of a person",
            "जिह्वासती": "a tongue that",
            "दार्दुरिकेव": "like a patient suffering from a disease",
            "सूत": "spins/twists",
            "चोपगायति": "sings along",
            "उरुगायगाथाः": "the praise and songs (Gatha) of Lord Vishnu (Uru-Gaya)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "bile": "`bile`",
            "bata": "`shame`",
            "urukrama": "`great-stride`",
            "vikramān": "`valorous`",
            "ye": "`who`",
            "na": "`not`",
            "śṛṇvataḥ": "`hear`",
            "karṇa-puṭe": "`in the ear-pit`",
            "narasya": "`of men`",
            "jihvā": "`tongue`",
            "asatī": "`is useless`",
            "dārdurīkā iva": "`like a toothache`",
            "sūta": "`bard`",
            "ca": "`also`",
            "upagāyati": "`recite`",
            "urugāya": "`to heroes`",
            "gāthāḥ": "`songs`"
        },
        "meaning": "Shame on those who do not hear the valorous deeds of great-stride heroes. In the ear-pit of men whose tongue is useless like a toothache, bards also recite songs to heroes."
    }
}