{
    "verse_no": "२-५-१६",
    "verse": "नारायणपरो योगो नारायणपरं तपः ।\nनारायणपरं ज्ञानं नारायणपरा गतिः ॥",
    "vedabase": {
        "terms": {
            "nārāyaṇa-paraḥ": "just to know Nārāyaṇa",
            "yogaḥ": "concentration of mind",
            "nārāyaṇa-param": "just to realize a glimpse of Nārāyaṇa",
            "tapaḥ": "austerity",
            "jñānam": "culture of transcendental knowledge",
            "nārāyaṇa-parā": "the path of salvation ends by entering the kingdom of Nārāyaṇa",
            "gatiḥ": "progressive path."
        },
        "translation": "All different types of meditation or mysticism are means for realizing Nārāyaṇa. All austerities are aimed at achieving Nārāyaṇa. Culture of transcendental knowledge is for getting a glimpse of Nārāyaṇa, and ultimately salvation is entering the kingdom of Nārāyaṇa.  ",
        "purport": "In meditation, there are two systems of yoga, namely aṣṭāṅga-yoga and sāṅkhya-yoga. Aṣṭāṅga-yoga is practice in concentrating the mind, releasing oneself from all engagements by the regulative processes of meditation, concentration, sitting postures, blocking the movements of the internal circulation of air, etc. Sāṅkhya-yoga is meant to distinguish the truth from ephemerals. But ultimately both systems are meant for realizing the impersonal Brahman, which is but a partial representation of Nārāyaṇa, the Personality of Godhead. As we have explained before, the impersonal Brahman effulgence is only a part of the Personality of Godhead. Impersonal Brahman is situated on the person of the Supreme Personality of Godhead, and, as such, Brahman is the glorification of the Personality of the Godhead. This is confirmed both in the Bhagavad-gītā and in the Matsya Purāṇa. Gati refers to the ultimate destination, or the last word in liberation. Oneness with the impersonal brahmajyoti is not ultimate liberation; superior to that is the sublime association of the Personality of Godhead in one of the innumerable spiritual planets in the Vaikuṇṭha sky. Therefore the conclusion is that Nārāyaṇa, or the Personality of Godhead, is the ultimate destination for all kinds of yoga systems as well as all kinds of liberation."
    },
    "gpt": {
        "terms": {
            "नारायणपरो योगो": "नारायण का योग पर ही स्थान है। (यहां 'नारायण' भगवान विष्णु का एक अद्वितीय नाम है, जो संसार की सृष्टि का कारण माना जाता है। 'योग' यहां ध्यान और साधना की एक विशेष प्रकार है। इस पंक्ति में बताया गया है कि नारायण ध्यान और साधना का अध्यात्मिक केन्द्र है।)",
            "नारायणपरं तपः": "नारायण परायणता ही तपस्या की परम गति है। (यहां 'तपः' आश्रम आदि में आत्मनिर्वाण के लिए आत्मसंयम या धर्मिक साधना को दर्शाता है। पंक्ति के अनुसार, नारायण की पूजा और समर्पण परायणता की उत्कृष्टतम और सच्ची तपस्या है।)",
            "नारायणपरं ज्ञानं": "नारायण के परायण ज्ञान ही है। (यहां 'ज्ञानं' ब्रह्मज्ञान या सत्यत्व ज्ञान को दर्शाता है। इस पंक्ति में दर्शाया गया है कि ज्ञान का मूल और सच्चा स्रोत नारायण की परायणता है।)",
            "नारायणपरा गतिः": "नारायण की परायणता ही आत्मा की अंतिम गति है॥ (यहां 'गतिः' आत्मा की मोक्ष प्राप्ति के लिए एकान्तिक सर्वोच्च मार्ग की संकेत करता है। पंक्ति के अनुसार, आत्मा की अचूक गति नारायण की परायणता में होती है।)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "nārāyaṇa-paraḥ yogaḥ `": "yoga is for nārāyaṇa-parah `",
            "nārāyaṇa-param tapaḥ `": "tapah is for nārāyaṇa-param `",
            "jñānam nārāyaṇa-parā gatiḥ `": "gati is for nārāyaṇa-parā jñānam `"
        },
        "meaning": "yoga is for nārāyaṇa-parahtapah is for nārāyaṇa-paramgati is for nārāyaṇa-parā jñānam"
    }
}