{
    "verse_no": "२-६-३१",
    "verse": "सृजामि तन्नियुक्तोऽहं हरो हरति तद्वशः ।\nविश्वं पुरुषरूपेण परिपाति त्रिशक्तिधृक् ॥",
    "vedabase": {
        "terms": {
            "nārāyaṇe": "unto Nārāyaṇa",
            "bhagavati": "the Personality of Godhead",
            "tat idam": "all these material manifestations",
            "viśvam": "all the universes",
            "āhitam": "situated",
            "gṛhīta": "having accepted",
            "māyā": "material energies",
            "uru-guṇaḥ": "greatly powerful",
            "sarga-ādau": "in creation, maintenance and destruction",
            "aguṇaḥ": "without affinity for the material modes",
            "svataḥ": "self-sufficiently."
        },
        "translation": "All the material manifestations of the universes are therefore situated in His powerful material energies, which He accepts self-sufficiently, although He is eternally without affinity for the material modes.  ",
        "purport": "The question put by Nārada before Brahmā concerning the sustenance of the material creation is thus answered. Material actions and reactions, as the material scientist can superficially observe, are not basically ultimate truth in regard to creation, maintenance and destruction. The material energy is a potency of the Lord which is displayed in time, accepting the three qualities of goodness, passion and ignorance in the forms of Viṣṇu, Brahmā and Śiva. The material energy thus works under the supreme spell of His Lordship, although He is always transcendental to all such material activities. A rich man constructs a big house by spending his energy in the shape of resources, and similarly he destroys a big house by his resources, but the maintenance is always under his personal care. The Lord is the richest of the rich because He is always fully complete in six opulences. Therefore He is not required to do anything personally, but everything in the material world is carried out by His wishes and direction; therefore, the entire material manifestation is situated in Nārāyaṇa, the Supreme Personality of Godhead. The impersonal conception of the supreme truth is due to lack of knowledge only, and this fact is clearly explained by Brahmājī, who is supposed to be the creator of the universal affairs. Brahmājī is the highest authority in Vedic wisdom, and his assertion in this connection is therefore the supreme information."
    },
    "gpt": {
        "terms": {
            "सृजामि": "I create",
            "तन्नियुक्तोऽहं": "as per your desire, I possess",
            "हरो हरति तद्वशः": "Lord Hari (Vishnu) destroys as per His own will",
            "विश्वं पुरुषरूपेण": "the entire universe, in the form of the Supreme Being",
            "परिपाति": "protects",
            "त्रिशक्तिधृक्": "wielding the three divine powers (creation, preservation, and destruction)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "nārāyaṇe": "nārāyaṇa in = in",
            "bhagavati": "bhagavan",
            "tat": "that",
            "idam": "this",
            "viśvam": "universe",
            "āhitam": "situated",
            "gṛhīta": "having taken",
            "māyā": "illusion",
            "uru-guṇaḥ": "great qualities",
            "sarga-ādau": "at the beginning of creation",
            "aguṇaḥ": "without qualities",
            "svataḥ": "of his own nature"
        },
        "meaning": "Nārāyaṇa in bhagavan, that this universe situated having taken illusion great qualities at the beginning of creation without qualities of his own nature.Nārāyaṇa, the Supreme Being, is the cause of the universe. He is the one who created this world and sustains it. He is without qualities of his own nature, but takes on the qualities of the world in order to create and sustain it."
    }
}