{
    "verse_no": "२-६-१५",
    "verse": "सर्वं पुरुष एवेदं भूतं भव्यं भवच्च यत् ।\nतेनेदमावृतं विश्वं वितस्तिमधितिष्ठति ॥",
    "vedabase": {
        "terms": {
            "sarvam": "everything",
            "puruṣaḥ": "the Personality of Godhead",
            "eva idam": "certainly all these",
            "bhūtam": "whatever is created",
            "bhavyam": "whatever will be created",
            "bhavat": "and whatever was created in the past",
            "yat": "whatever",
            "tena idam": "it is all by Him",
            "āvṛtam": "covered",
            "viśvam": "universally comprehending",
            "vitastim": "half a cubit",
            "adhitiṣṭhati": "situated."
        },
        "translation": "Beginning from me [Brahmā] down to you and Bhava [Śiva], all the great sages who were born before you, the demigods, the demons, the Nāgas, the human beings, the birds, the beasts, as well as the reptiles, etc., and all phenomenal manifestations of the universes, namely the planets, stars, asteroids, luminaries, lightning, thunder, and the inhabitants of the different planetary systems, namely the Gandharvas, Apsarās, Yakṣas, Rakṣas, Bhūtagaṇas, Uragas, Paśus, Pitās, Siddhas, Vidyādharas, Cāraṇas, and all other different varieties of living entities, including the birds, beasts, trees and everything that be, are all covered by the universal form of the Lord at all times, namely past, present and future, although He is transcendental to all of them, eternally existing in a form not exceeding nine inches.  ",
        "purport": "The Supreme Personality of Godhead, by His partial representation, measuring not more than nine inches as Supersoul, expands by His potency in the shape of the universal form, which includes everything manifested in different varieties of organic and inorganic materials. The manifested varieties of the universe are therefore not different from the Lord, just as golden ornaments of different shapes and forms are nondifferent from the original stock reserve of gold. In other words, the Lord is the Supreme Person who controls everything within the creation, and still He remains the supreme separate identity, distinct from all manifested material creation. In the Bhagavad-gītā (9.4-5) He is therefore said to be Yogeśvara. Everything rests on the potency of Lord Śrī Kṛṣṇa, and still the Lord is different from and transcendental to all such identities. In the Vedic Puruṣa-sūkta of the Ṛg mantra, this is also confirmed. This philosophical truth of simultaneous oneness and difference was propounded by Lord Śrī Caitanya Mahāprabhu, and it is known as acintya-bhedābheda-tattva. Brahmā, Nārada and all others are simultaneously one with the Lord and different from the Supreme Lord. We are all one with Him, just as the gold ornaments are one in quality with the stock gold, but the individual gold ornament is never equal in quantity with the stock gold. The stock gold is never exhausted even if there are innumerable ornaments emanating from the stock because the stock is pūrṇam, complete; even if pūrṇam is deducted from the pūrṇam, still the supreme pūrṇam remains the same pūrṇam. This fact is inconceivable to our present imperfect senses. Lord Caitanya therefore defined His theory of philosophy as acintya (inconceivable), and as confirmed in the Bhagavad-gītā as well as in the Bhāgavatam, Lord Caitanya’s theory of acintya-bhedābheda-tattva is the perfect philosophy of the Absolute Truth."
    },
    "gpt": {
        "terms": {
            "सर्वं (sarvam)": "everything",
            "पुरुष (purusha)": "person/entity",
            "एव (eva)": "indeed",
            "एदं (idam)": "this",
            "भूतं (bhutam)": "that which has been, past",
            "भव्यं (bhavyam)": "that which will be, future",
            "भवच्च (bhavaccha)": "and that which is happening",
            "यत् (yat)": "which/that",
            "तेन (tena)": "by that",
            "इदं (idam)": "this",
            "आवृतं (avritam)": "covered/veiled",
            "विश्वं (vishvam)": "the universe",
            "वितस्ति (vitasti)": "pervades/spreads",
            "मधितिष्ठति (madhitishthati)": "lies within"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "aham": "I",
            "bhavān": "you",
            "bhavaḥ": "he",
            "ca": "and",
            "eva": "indeed",
            "te": "those",
            "ime": "these",
            "munayaḥ": "sages",
            "agra-jāḥ": "born first",
            "sura": "gods",
            "asura": "demons",
            "narāḥ": "men",
            "nāgāḥ": "snakes",
            "khagāḥ": "birds",
            "mṛga": "deer",
            "sarīsṛpāḥ": "reptiles",
            "gandharva-apsarasaḥ": "gandharvas and apsaras",
            "yakṣāḥ": "yakshas",
            "rakṣaḥ-bhūta-gaṇa-uragāḥ": "rakshasas, ghosts, goblins, and snakes",
            "paśavaḥ": "animals",
            "pitaraḥ": "fathers",
            "siddhāḥ": "siddhas",
            "vidyādhrāḥ": "scholars",
            "cāraṇāḥ": "wandering mendicants",
            "drumāḥ": "trees",
            "anye": "others",
            "vividhāḥ": "various",
            "jīvāḥ": "beings",
            "jala": "water",
            "sthala": "land",
            "nabha-okasaḥ": "sky",
            "graha": "planets",
            "ṛkṣa": "stars",
            "ketavaḥ": "comets",
            "tārāḥ": "stars",
            "taḍitaḥ": "lightning",
            "stanayitnavaḥ": "thunder",
            "sarvam": "all",
            "puruṣaḥ": "person",
            "idam": "this",
            "bhūtam": "existent",
            "bhavyam": "becoming",
            "bhavat": "being",
            "yat": "that",
            "tena": "by which",
            "āvṛtam": "covered",
            "viśvam": "universe",
            "vitastim": "vast",
            "adhitiṣṭhati": "stands"
        },
        "meaning": ""
    }
}