{
    "verse_no": "३-१५-४८",
    "verse": "नात्यन्तिकं विगणयन्त्यपि ते प्रसादं किम्वन्यदर्पितभयं भ्रुव उन्नयैस्ते ।\nयेऽङ्ग त्वदङ्‌घ्रि शरणा भवतः कथायाः कीर्तन्यतीर्थयशसः कुशला रसज्ञाः ॥",
    "vedabase": {
        "terms": {
            "na": "not",
            "ātyantikam": "liberation",
            "vigaṇayanti": "care for",
            "api": "even",
            "te": "Your",
            "prasādam": "benedictions",
            "kim u": "what to speak",
            "anyat": "other material happinesses",
            "arpita": "given",
            "bhayam": "fearfulness",
            "bhruvaḥ": "of the eyebrows",
            "unnayaiḥ": "by the raising",
            "ye": "those devotees",
            "aṅga": "O Supreme Personality of Godhead",
            "tvat": "Your",
            "aṅghri": "lotus feet",
            "śaraṇāḥ": "who have taken shelter",
            "bhavataḥ": "Your",
            "kathāyāḥ": "narrations",
            "kīrtanya": "worth chanting",
            "tīrtha": "pure",
            "yaśasaḥ": "glories",
            "kuśalāḥ": "very expert",
            "rasa-jñāḥ": "knowers of the mellows or humors."
        },
        "translation": "Persons who are very expert and most intelligent in understanding things as they are engage in hearing narrations of the auspicious activities and pastimes of the Lord, which are worth chanting and worth hearing. Such persons do not care even for the highest material benediction, namely liberation, to say nothing of other less important benedictions like the material happiness of the heavenly kingdom.  ",
        "purport": "The transcendental bliss enjoyed by the devotees of the Lord is completely different from the material happiness enjoyed by less intelligent persons. The less intelligent persons in the material world are engaged by the four principles of benediction called dharma, artha, kāma and mokṣa. Generally they prefer to take to religious life to achieve some material benediction, the purpose of which is to satisfy the senses. When, by that process, they become confused or frustrated in fulfilling the maximum amount of sense enjoyment, they try to become one with the Supreme, which is, according to their conception, mukti, or liberation. There are five kinds of liberation, the least important of which is called sāyujya, to become one with the Supreme. Devotees don’t care for such liberation because they are actually intelligent. Nor are they inclined to accept any of the other four kinds of liberation, namely to live on the same planet as the Lord, to live with Him side by side as an associate, to have the same opulence, or to attain the same bodily features. They are concerned only with glorifying the Supreme Lord and His auspicious activities. Pure devotional service is śravaṇaṁ kīrtanam. Pure devotees, who take transcendental pleasure in hearing and chanting the glories of the Lord, do not care for any kind of liberation; even if they are offered the five liberations, they refuse to accept them, as stated in the Bhāgavatam in the Third Canto. Materialistic persons aspire for the sense enjoyment of heavenly pleasure in the heavenly kingdom, but devotees reject such material pleasure at once. The devotee does not even care for the post of Indra. A devotee knows that any pleasurable material position is subject to be annihilated at a certain point. Even if one reaches the post of Indra, Candra, or any other demigod, he must be dissolved at a certain stage. A devotee is never interested in such temporary pleasure. From Vedic scriptures it is understood that sometimes even Brahmā and Indra fall down, but a devotee in the transcendental abode of the Lord never falls. This transcendental stage of life, in which one feels transcendental pleasure in hearing the Lord’s pastimes, is also recommended by Lord Caitanya. When Lord Caitanya was talking with Rāmānanda Rāya, there were varieties of suggestions offered by Rāmānanda regarding spiritual realization, but Lord Caitanya rejected all but one — that one should hear the glories of the Lord in association with pure devotees. That is acceptable for everyone, especially in this age. One should engage himself in hearing from pure devotees about the activities of the Lord. That is considered the supreme benediction for mankind."
    },
    "gpt": {
        "terms": {
            "नात्यन्तिकं": "Not ultimate",
            "विगणयन्ति": "Ignoring",
            "अपि": "Even",
            "ते": "You",
            "प्रसादं": "Blessing",
            "किमः": "What",
            "अन्यत्": "Other",
            "दर्पितभयं": "Arrogant fear",
            "भ्रुव": "Eyebrows",
            "उन्नयैस्ते": "You lift",
            "अत्यन्तं": "Extremely",
            "नविगणयन्ति": "They not consider",
            "गणयन्तिअपि": "Counting even",
            "अनुग्रहं": "Grace",
            "अनुकूलं": "Favorable",
            "किं": "What",
            "कियन्तम्": "How much",
            "अन्यं": "Another",
            "विपरीतंच": "Opposite",
            "भिन्नं": "Distinct",
            "भयं": "Fear",
            "जानन्तिभ्रुव": "Knowing eyebrows",
            "भ्रुवो": "Of eyebrows",
            "आञ्जन्यं": "The ointment",
            "चक्षुर्भ्याम्": "With eyes",
            "उन्मुखं": "Towards",
            "भवन्तं": "Being",
            "demiये": "They who",
            "आङ्ग": "Limb",
            "त्वंत्वदङ्घ्रि": "Your foot",
            "तव": "Your's",
            "पदाङ्गुष्ठ": "Big toe",
            "आनिशरणा": "Refuge",
            "शरणागताभवतः": "Have taken refuge",
            "कथायाः": "Of the story",
            "वृत्तान्तेन": "With narrative",
            "कीर्तन्यतीर्थयशसः": "Fame of holy places",
            "प्रशंसितस्य": "Of the praised",
            "तीर्थयशसः": "Holy fame",
            "कीर्तिः": "Glory",
            "कुशला": "Efficient",
            "ज्ञानिनः": "Scholar",
            "रसज्ञाः": "Knower of essence",
            "रसानुभव": "Experience of essence",
            "*ज्ञाः": "Knows"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "na": "`not` ātyantikam =`final` vigaṇayanti =`break` api =`even` te =`you` prasādam =`grace` kim =`what` u =`and` anyat =`anything else` arpita =`offered` bhayam =`fear` bhruvaḥ =`eyebrows` unnayaiḥ =`bending` ye =`who` aṅga =`body` tvat =`your` aṅghri =`feet` śaraṇāḥ =`refuge` bhavataḥ =`of you` kathāyāḥ =`stories` kīrtanya =`singing` tīrtha =`pilgrimage` yaśasaḥ =`glory` kuśalāḥ =`skilled` rasa-jñāḥ =`knowers of essence`"
        },
        "meaning": "not even your final grace can break the fear offered by those who bend their eyebrows in reverence and take refuge at your feet; they are skilled in singing your stories and pilgrimages and glory, and they know the essence of your grace."
    }
}