{
    "verse_no": "३-१५-१४",
    "verse": "वसन्ति यत्र पुरुषाः सर्वे वैकुण्ठमूर्तयः ।\nयेऽनिमित्तनिमित्तेन धर्मेणाराधयन् हरिम् ॥",
    "vedabase": {
        "terms": {
            "vasanti": "they live",
            "yatra": "where",
            "puruṣāḥ": "persons",
            "sarve": "all",
            "vaikuṇṭha-mūrtayaḥ": "having a four-handed form similar to that of the Supreme Lord, Viṣṇu",
            "ye": "those Vaikuṇṭha persons",
            "animitta": "without desire for sense gratification",
            "nimittena": "caused by",
            "dharmeṇa": "by devotional service",
            "ārādhayan": "continuously worshiping",
            "harim": "unto the Supreme Personality of Godhead."
        },
        "translation": "In the Vaikuṇṭha planets all the residents are similar in form to the Supreme Personality of Godhead. They all engage in devotional service to the Lord without desires for sense gratification.  ",
        "purport": "The residents and the form of living in Vaikuṇṭha are described in this verse. The residents are all like the Supreme Personality of Godhead Nārāyaṇa. In the Vaikuṇṭha planets Kṛṣṇa’s plenary feature as four-handed Nārāyaṇa is the predominating Deity, and the residents of Vaikuṇṭhaloka are also four-handed, just contrary to our conception here in the material world. Nowhere in the material world do we find a human being with four hands. In Vaikuṇṭhaloka there is no occupation but the service of the Lord, and this service is not rendered with a purpose. Although every service has a particular result, the devotees never aspire for the fulfillment of their own desires; their desires are fulfilled by rendering transcendental loving service to the Lord."
    },
    "gpt": {
        "terms": {
            "वसन्ति": "They reside",
            "यत्र": "where",
            "पुरुषाः": "individuals",
            "सर्वे": "all",
            "वैकुण्ठमूर्तयः": "forms of Lord Vishnu (Vaikuntha is the abode of Lord Vishnu)",
            "ये": "those who",
            "अनिमित्तनिमित्तेन": "without any specific cause",
            "धर्मेण": "through righteousness",
            "आराधयन्": "worshiping",
            "हरिम्": "Lord Hari (another name for Lord Vishnu)"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "vasanti": "live",
            "yatra": "where",
            "puruṣāḥ": "people",
            "sarve": "all",
            "vaikunṭha-mūrtayaḥ": "like vishnu",
            "ye": "who",
            "animitta": "without cause",
            "nimittena": "with cause",
            "dharmeṇa": "in dharma",
            "ārādhayan": "worship",
            "harim": "vishnu"
        },
        "meaning": "live where people all like vishnu who worship vishnu in dharma with cause without causeAll people live where people like vishnu who worship vishnu in dharma with cause and without cause."
    }
}