{
    "verse_no": "३-६-३९",
    "verse": "अतो भगवतो माया मायिनामपि मोहिनी ।\nयत्स्वयं चात्मवर्त्मात्मा न वेद किमुतापरे ॥",
    "vedabase": {
        "terms": {
            "ataḥ": "therefore",
            "bhagavataḥ": "godly",
            "māyā": "potencies",
            "māyinām": "of the jugglers",
            "api": "even",
            "mohinī": "enchanting",
            "yat": "that which",
            "svayam": "personally",
            "ca": "also",
            "ātma-vartma": "self-sufficient",
            "ātmā": "self",
            "na": "does not",
            "veda": "know",
            "kim": "what",
            "uta": "to speak of",
            "apare": "others."
        },
        "translation": "The wonderful potency of the Supreme Personality of Godhead is bewildering even to the jugglers. That potency is unknown even to the self-sufficient Lord, so it is certainly unknown to others.  ",
        "purport": "The froggish philosophers and mundane wranglers in science and mathematical calculation may not believe in the inconceivable potency of the Supreme Personality of Godhead, but they are sometimes puzzled by the wonderful jugglery of man and nature. Such jugglers and magicians of the mundane world are actually puzzled by the jugglery of the Lord in His transcendental activities, but they try to adjust their bewilderment by saying that it is all mythology. There is, however, nothing impossible or mythological in the Supreme Omnipotent Person. The most wonderful puzzle for the mundane wranglers is that while they remain calculating the length and breadth of the unlimited potency of the Supreme Person, His faithful devotees are set free from the bondage of material encagement simply by appreciating the wonderful jugglery of the Supreme in the practical field. The devotees of the Lord see the wonderful dexterity in everything with which they come in contact in all circumstances of eating, sleeping, working, etc. A small banyan fruit contains thousands of small seeds, and each seed holds the potency of another tree, which again holds the potency of many millions of such fruits as causes and effects. So the trees and seeds engage the devotees in meditation about the activities of the Lord, while the mundane wranglers waste time in dry speculation and mental concoction, which are fruitless in both this life and the next. In spite of their pride in speculation, they can never appreciate the simple activities of the banyan tree’s potency. Such speculators are poor souls destined to remain in matter perpetually."
    },
    "gpt": {
        "terms": {
            "अतः": "Therefore",
            "भगवतः": "of the Supreme Lord",
            "माया": "the illusion",
            "मायिनाम्": "of the illusory beings",
            "अपि": "indeed",
            "मोहिनी": "enchanting",
            "यत्": "because",
            "स्वयं": "oneself",
            "च": "and",
            "आत्मवर्त्म": "the path of self-realization",
            "आत्मा": "the self",
            "न": "does not",
            "वेद": "know",
            "किम्": "what",
            "उत": "then",
            "अपरे": "others"
        },
        "meaning": " Therefore, the illusion of the Supreme Lord, which is enchanting even for illusory beings, how could they (the illusory beings) know about themselves or others on the path of self realization?"
    },
    "bard": {
        "terms": {
            "atah": "therefore",
            "bhagavataḥ": "of the bhagavan",
            "māyā": "māyā",
            "māyinām": "of the māyā-s",
            "api": "also",
            "mohinī": "deluding",
            "yat": "because",
            "svayam": "itself",
            "ca": "and",
            "ātma-vartma": "own nature",
            "ātmā": "the self",
            "na veda": "does not know",
            "kim": "what",
            "uta": "and",
            "apare": "others"
        },
        "meaning": "therefore of the bhagavan māyā of the māyā-s also deluding because itself and own nature self does not know what and othersTherefore, the māyā of the bhagavan, which even deludes the māyā-s, is so deluding because even the self does not know its own nature, and what to say of others."
    }
}