{
    "verse_no": "४-१२-३६",
    "verse": "यद् भ्राजमानं स्वरुचैव सर्वतो लोकास्त्रयो ह्यनु विभ्राजन्त एते ।\nयन्नाव्रजञ्जन्तुषु येऽननुग्रहा व्रजन्ति भद्राणि चरन्ति येऽनिशम् ॥",
    "vedabase": {
        "terms": {
            "yat": "which planet",
            "bhrājamānam": "illuminating",
            "sva-rucā": "by self-effulgence",
            "eva": "only",
            "sarvataḥ": "everywhere",
            "lokāḥ": "planetary systems",
            "trayaḥ": "three",
            "hi": "certainly",
            "anu": "thereupon",
            "vibhrājante": "give off light",
            "ete": "these",
            "na": "not",
            "avrajan": "have reached",
            "jantuṣu": "to living entities",
            "ye": "those who",
            "ananugrahāḥ": "not merciful",
            "vrajanti": "reach",
            "bhadrāṇi": "welfare activities",
            "caranti": "engage in",
            "aniśam": "constantly."
        },
        "translation": "The self-effulgent Vaikuṇṭha planets, by whose illumination alone all the illuminating planets within this material world give off reflected light, cannot be reached by those who are not merciful to other living entities. Only persons who constantly engage in welfare activities for other living entities can reach the Vaikuṇṭha planets.  ",
        "purport": "Here is a description of two aspects of the Vaikuṇṭha planets. The first is that in the Vaikuṇṭha sky there is no need of the sun and moon. This is confirmed by the Upaniṣads as well as Bhagavad-gītā (na tad bhāsayate sūryo na śaśāṅko na pāvakaḥ). In the spiritual world the Vaikuṇṭhalokas are themselves illuminated; there is therefore no need of sun, moon or electric light. It is in fact the illumination of the Vaikuṇṭhalokas which is reflected in the material sky. Only by this reflection are the suns in the material universes illuminated; after the illumination of the sun, all the stars and moons are illuminated. In other words, all the luminaries in the material sky borrow illumination from Vaikuṇṭhaloka. From this material world, however, people can be transferred to the Vaikuṇṭhaloka, if they incessantly engage in welfare activities for all other living entities. Such incessant welfare activities can really be performed only in Kṛṣṇa consciousness. There is no philanthropic work within this material world but Kṛṣṇa consciousness that can engage a person twenty-four hours a day. A Kṛṣṇa conscious being is always engaged in planning how to take all of suffering humanity back home, back to Godhead. Even if one is not successful in reclaiming all the fallen souls back to Godhead, still, because he is Kṛṣṇa conscious, his path to Vaikuṇṭhaloka is open. He personally becomes qualified to enter the Vaikuṇṭhalokas, and if anyone follows such a devotee, he also enters into Vaikuṇṭhaloka. Others, who engage in envious activities, are known as karmīs. Karmīs are envious of one another. Simply for sense gratification, they can kill thousands of innocent animals. Jñānīs are not as sinful as karmīs, but they do not try to reclaim others back to Godhead. They perform austerities for their own liberation. Yogīs are also engaged in self-aggrandizement by trying to attain mystic powers. But devotees, Vaiṣṇavas, who are servants of the Lord, come forward in the actual field of work in Kṛṣṇa consciousness to reclaim fallen souls. Only Kṛṣṇa conscious persons are eligible to enter into the spiritual world. That is clearly stated in this verse and is confirmed in Bhagavad-gītā, wherein the Lord says that there is no one dearer to Him than those who preach the gospel of Bhagavad-gītā to the world."
    },
    "gpt": {
        "terms": {
            "यद् (Yad)": "That which",
            "भ्राजमानं (Bhrajamanam)": "shines forth, radiates",
            "स्वरुचैव (Swaruchaiva)": "according to its own brilliance",
            "सर्वतो (Sarvato)": "in all directions",
            "लोकास्त्रयो (Lokastrayo)": "the three worlds",
            "ह्यनु (Hyanu)": "constantly",
            "विभ्राजन्ति (Vibhrajanti)": "illuminate",
            "एते (Et)": "these",
            "यन्नाव्रजञ्जन्तुषु (Yannavragnajantushu)": "which do not go away",
            "येऽननुग्रहाः (Ye 'nanugraha)": "which are unfavorable",
            "व्रजन्ति (Vrajanti)": "go",
            "भद्राणि (Bhadrani)": "auspicious things",
            "चरन्ति (Charanti)": "move",
            "येऽनिशम् (Ye 'nisham)": "continuously"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "yat": "that",
            "bhrājamānam": "shining",
            "sva-rucā": "with its own splendour",
            "eva": "indeed",
            "sarvataḥ": "all around",
            "lokāḥ": "worlds",
            "trayāḥ": "three",
            "hi": "indeed",
            "anu": "follow",
            "vibhrājante": "shine",
            "ete": "they",
            "na": "not",
            "avrajan": "fall",
            "jantuṣu": "on beings",
            "ye": "those",
            "ananugrahāḥ": "who are without mercy",
            "vrajanti": "go",
            "bhadrāṇi": "good things",
            "caranti": "do",
            "aniśam": "always"
        },
        "meaning": "That shining with its own splendour, indeed all around the three worlds shine following it.They do not fall on beings who are without mercy. Those who go always do good things."
    }
}