{
    "verse_no": "४-२९-४९",
    "verse": "आस्तीर्य दर्भैः प्रागग्रैः कार्त्स्‍न्येन क्षितिमण्डलम् ।\nस्तब्धो बृहद्वधान्मानी कर्म नावैषि यत्परम् ।\nतत्कर्म हरितोषं यत्सा विद्या तन्मतिर्यया ॥",
    "vedabase": {
        "terms": {
            "āstīrya": "having covered",
            "darbhaiḥ": "by kuśa grass",
            "prāk-agraiḥ": "with the points facing east",
            "kārtsnyena": "altogether",
            "kṣiti-maṇḍalam": "the surface of the world",
            "stabdhaḥ": "proud upstart",
            "bṛhat": "great",
            "vadhāt": "by killing",
            "mānī": "thinking yourself very important",
            "karma": "activity",
            "na avaiṣi": "you do not know",
            "yat": "which",
            "param": "supreme",
            "tat": "unto the Lord",
            "hari-toṣam": "satisfying the Supreme Lord",
            "sā": "that",
            "vidyā": "education",
            "matiḥ": "consciousness",
            "yayā": "by which."
        },
        "translation": "My dear King, the entire world is covered with the sharp points of kuśa grass, and on the strength of this you have become proud because you have killed various types of animals in sacrifices. Because of your foolishness, you do not know that devotional service is the only way one can please the Supreme Personality of Godhead. You cannot understand this fact. Your only activities should be those that can please the Personality of Godhead. Our education should be such that we can become elevated to Kṛṣṇa consciousness.  ",
        "purport": "In this verse the great sage Nārada Muni directly insults the King because he was engaged in performing sacrifices that entail the killing of a great number of animals. The King was thinking that he was great for having performed so many sacrifices, but the great sage Nārada directly chastises him, informing him that his animal-killing only leads to his being puffed up with false prestige. Actually, anything that is done which does not lead to Kṛṣṇa consciousness is a sinful activity, and any education that does not lead one to understand Kṛṣṇa is false education. If Kṛṣṇa consciousness is missing, one is simply engaged in false activities and false educational pursuits."
    },
    "gpt": {
        "terms": {
            "आस्तीर्य": "having covered",
            "दर्भैः": "with sacred grass",
            "प्रागग्रैः": "in the eastern (direction)",
            "कार्त्स्‍न्येन": "with a ritual act",
            "क्षितिमण्डलम्": "the entire Earth",
            "स्तब्धो": "being silent",
            "बृहद्वधान्मानी": "considering oneself as a great slayer of foes",
            "कर्म": "action",
            "नावैषि": "not indeed",
            "यत्परम्": "(emphasis) the ultimate purpose",
            "तत्कर्म": "that action",
            "हरितोषं": "pleases Vishnu",
            "यत्सा": "that action",
            "विद्या": "knowledge",
            "तन्मतिर्यया": "by way of intelligence"
        },
        "meaning": " In these verses, the emphasis is on performing actions with the right intent and purpose. One should perform rituals and actions with utmost devotion and focus, symbolized by covering the Earth with sacred grasses in the eastern direction. However, it is important to not let ego or pride overshadow these actions. One should not consider themselves as superior or indulge in self glorification while performing these actions. The true purpose of these actions should always be directed towards the ultimate goal, which is spiritual upliftment and self-realization. It is only through actions performed with the intent to please Vishnu (representing the divine) that one can attain true knowledge and understanding, guided by intelligence and wisdom."
    },
    "bard": {
        "terms": {
            "āstīrya": "to cover",
            "darbhaiḥ": "with darbha grass",
            "prāk-agraiḥ": "with the front ends",
            "kārtsnyena": "in all directions",
            "kṣiti-maṇḍalam": "the earth’s sphere",
            "stabdhaḥ": "having been fixed",
            "bṛhat": "great",
            "vadhāt": "by the vajra",
            "mānī": "proud",
            "karma": "action",
            "na": "not",
            "avaiṣi": "attain",
            "yat": "what",
            "param": "supreme",
            "tat": "that",
            "hari-toṣam": "satisfaction of Hari",
            "sā": "that",
            "vidyā": "knowledge",
            "matiḥ": "intelligence",
            "yayā": "by which"
        },
        "meaning": ""
    }
}