{
    "verse_no": "४-२९-३४",
    "verse": "नैकान्ततः प्रतीकारः कर्मणां कर्म केवलम् ।\nद्वयं ह्यविद्योपसृतं स्वप्ने स्वप्न इवानघ ॥",
    "meaning": "कर्म से कर्म का नाश नहीं हो सकता धर्म से कर्म का बंधन समाप्त नहीं हो सकता क्योंकि अनंत पाप है अनंत कल तक भोगो तो भी ख़त्म नहीं होगा, धर्म कर्म से पाप नष्ट होता है लेकिन पापी की बुद्धि शुद्ध नहीं हो सकती वो फिर पाप करेगा",
    "vedabase": {
        "terms": {
            "na": "never",
            "ekāntataḥ": "ultimately",
            "pratīkāraḥ": "counteraction",
            "karmaṇām": "of different activities",
            "karma": "another activity",
            "kevalam": "only",
            "dvayam": "both",
            "hi": "because",
            "avidyā": "due to illusion",
            "upasṛtam": "accepted",
            "svapne": "in a dream",
            "svapnaḥ": "a dream",
            "iva": "like",
            "anagha": "O you who are free from sinful activities."
        },
        "translation": "Nārada continued: O you who are free from all sinful activity! No one can counteract the effects of fruitive activity simply by manufacturing a different activity devoid of Kṛṣṇa consciousness. All such activity is due to our ignorance. When we have a troublesome dream, we cannot relieve it with a troublesome hallucination. One can counteract a dream only by awaking. Similarly, our material existence is due to our ignorance and illusion. Unless we awaken to Kṛṣṇa consciousness, we cannot be relieved of such dreams. For the ultimate solution to all problems, we must awaken to Kṛṣṇa consciousness.  ",
        "purport": "There are two kinds of fruitive activity: we can place the burden on the head, or we can place it on the shoulder. Actually, keeping the burden in either place is the same. The transferal, however, is taking place under the name of counteraction. In this connection Prahlāda Mahārāja said that fools and rascals in the material world plan so gorgeously for bodily comfort without knowing that such arrangements, even if successful, are only māyā. People are working hard day and night for the illusory happiness of the body. This is not a way to achieve happiness. One has to get out of this material entanglement and return home, back to Godhead. That is real happiness. The Vedas therefore enjoin: “Don’t remain in the darkness of this material world. Go to the light of the spiritual world.” To counteract the distress of this material body, one has to take on another distressed condition. Both situations are only illusion. There is no gain in taking on one trouble to counteract another trouble. The conclusion is that one cannot be perpetually happy as long as one exists in this material world. The only remedy is to get out of this material world altogether and return home, back to Godhead."
    },
    "gpt": {
        "terms": {
            "नैकान्ततः": "From one standpoint",
            "प्रतीकारः": "Is a reaction",
            "कर्मणां": "To actions",
            "कर्म": "Actions",
            "केवलम्": "Alone",
            "द्वयं": "Both",
            "ह्यविद्योपसृतं": "Are born of ignorance",
            "स्वप्ने": "In a dream",
            "स्वप्न": "A dream",
            "इवानघ": "Like, oh sinless one"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "na ekāntataḥ pratīkāraḥ karmaṇām": "not exclusively by renunciation of action",
            "karma kevalam": "action alone",
            "dvayam hi avidyā upasṛtam": "ignorance is its cause",
            "svapne svapnaḥ iva anagha": "as a dream within a dream"
        },
        "meaning": ""
    }
}