{
    "verse_no": "५-१०-२०",
    "verse": "स वै भवाँल्लोकनिरीक्षणार्थमव्यक्तलिङ्गो विचरत्यपिस्वित् ।\nयोगेश्वराणां गतिमन्धबुद्धिः कथं विचक्षीत गृहानुबन्धः ॥",
    "vedabase": {
        "terms": {
            "saḥ": "that Supreme Personality of Godhead or His incarnation Kapiladeva",
            "vai": "indeed",
            "bhavān": "your good self",
            "loka-nirīkṣaṇa-artham": "just to study the characteristics of the people of this world",
            "avyakta-liṅgaḥ": "without manifesting your real identity",
            "vicarati": "are traveling in this world",
            "api svit": "whether",
            "yoga-īśvarāṇām": "of all the advanced yogīs",
            "gatim": "the characteristics or actual behavior",
            "andha-buddhiḥ": "who are illusioned and have become blind to spiritual knowledge",
            "katham": "how",
            "vicakṣīta": "may know",
            "gṛha-anubandhaḥ": "I who am bound by attachment to family life, or worldly life."
        },
        "translation": "Is it not a fact that your good self is the direct representative of Kapiladeva, the incarnation of the Supreme Personality of Godhead? To examine people and see who is actually a human being and who is not, you have presented yourself to be a deaf and dumb person. Are you not moving this way upon the surface of the world? I am very attached to family life and worldly activities, and I am blind to spiritual knowledge. Nonetheless, I am now present before you and am seeking enlightenment from you. How can I advance in spiritual life?  ",
        "purport": "Although Mahārāja Rahūgaṇa was playing the part of a king, he had been informed by Jaḍa Bharata that he was not a king nor was Jaḍa Bharata deaf and dumb. Such designations were simply coverings of the spirit soul. Everyone must come to this knowledge. As confirmed in Bhagavad-gītā (2.13): dehino ’smin yathā dehe. Everyone is encased within the body. Since the body is never identical with the soul, the bodily activities are simply illusory. In the association of such a sādhu as Jaḍa Bharata, Mahārāja Rahūgaṇa came to the awareness that his activities as a royal authority were simply illusory phenomena. He therefore agreed to receive knowledge from Jaḍa Bharata, and that was the beginning of his perfection. Tad-vijñānārthaṁ sa gurum evābhigacchet. A person like Mahārāja Rahūgaṇa, who was very inquisitive to know the value of life and the spiritual science, must approach a personality like Jaḍa Bharata. Tasmād guruṁ prapadyeta jijñāsuḥ śreya uttamam (Bhāg. 11.3.21). One must approach a guru like Jaḍa Bharata, a representative of the Supreme Personality of Godhead, to inquire about the goal of human life."
    },
    "gpt": {
        "terms": {
            "स वै भवान् लोक": "निरीक्षणार्थम् अव्यक्त-लिङ्गः विचरति अपि स्वित् ।",
            "योगेश्वराणां गतिम् अन्ध": "बुद्धिः कथं विचक्षीत गृहानुबन्धः ॥",
            "The verse begins by addressing the Supreme Being, referred to here as \"sa vai bhavān\"": "\"that [Supreme Being] indeed.\" The Supreme Being is described as \"avyakta-lingaḥ,\" which means without a manifest form or subtle form. It implies that the Supreme Being does not have a physical or visible form but exists beyond the realm of perception."
        },
        "meaning": " That Supreme Being, who is without a manifest form, wanders even though self existent, for the purpose of observing the world. The verse suggests that even though the Supreme Being is self existent and all-pervading, it appears to wander. This wandering is not due to any limitation but rather for the purpose of observing the world. The Supreme Being, in its infinite wisdom, chooses to interact with the world and observe the happenings."
    },
    "bard": {
        "terms": {
            "saḥ": "he",
            "vai": "indeed",
            "bhavān": "lord",
            "loka-nirīkṣaṇa-artham": "for the sake of overseeing the worlds",
            "avyakta-liṅgaḥ": "the unmanifested form",
            "vicarati": "moves about",
            "api": "even",
            "svit": "indeed",
            "yoga-īśvarāṇām": "of the lords of yoga",
            "gatim": "the path",
            "andha-buddhiḥ": "one who is blind in intelligence",
            "katham": "how",
            "vicakṣīta": "will understand",
            "gṛha-anubandhaḥ": "one who is attached to home"
        },
        "meaning": "He indeed, the lord, moves about in the unmanifested form for the sake of overseeing the worlds. Even indeed, how will one who is blind in intelligence understand the path of the lords of yoga who are attached to home?"
    }
}