{
    "verse_no": "५-६-४",
    "verse": "नित्यं ददाति कामस्यच् छिद्रं तमनु येऽरयः ।\nयोगिनः कृतमैत्रस्य पत्युर्जायेव पुंश्चली ॥",
    "vedabase": {
        "terms": {
            "nityam": "always",
            "dadāti": "gives",
            "kāmasya": "of lust",
            "chidram": "facility",
            "tam": "that (lust)",
            "anu": "following",
            "ye": "those",
            "arayaḥ": "enemies",
            "yoginaḥ": "of the yogīs or persons trying to advance in spiritual life",
            "kṛta-maitrasya": "having put faith in the mind",
            "patyuḥ": "of the husband",
            "jāyā iva": "like the wife",
            "puṁścalī": "who is unchaste or easily carried away by other men."
        },
        "translation": "An unchaste woman is very easily carried away by paramours, and it sometimes happens that her husband is violently killed by her paramours. If the yogī gives his mind a chance and does not restrain it, his mind will give facility to enemies like lust, anger and greed, and they will doubtlessly kill the yogī.  ",
        "purport": "In this verse the word puṁścalī refers to a woman who is easily carried away by men. Such a woman is never to be trusted. Unfortunately, in the present age, women are never controlled. According to the directions of the śāstras, women are never to be given freedom. When a child, a woman must be strictly controlled by her father. When she is young, she must be strictly controlled by her husband, and when she is old, she must be controlled by her elderly sons. If she is given independence and allowed to mingle unrestrictedly with men, she will be spoiled. A spoiled woman, being manipulated by paramours, might even kill her husband. This example is given here because a yogī desiring to get free from material conditions must always keep his mind under control. Śrīla Bhaktisiddhānta Sarasvatī Ṭhākura used to say that in the morning our first business should be to beat the mind with shoes a hundred times, and, before going to bed, to beat the mind a hundred times with a broomstick. In this way one’s mind can be kept under control. An uncontrolled mind and an unchaste wife are the same. An unchaste wife can kill her husband at any time, and an uncontrolled mind, followed by lust, anger, greed, madness, envy and illusion, can certainly kill the yogī. When the yogī is controlled by the mind, he falls down into the material condition. One should be very careful of the mind, just as a husband should be careful of an unchaste wife."
    },
    "gpt": {
        "terms": {
            "अरयः (arayaḥ)": "Enemies or those who wish to harm",
            "कामस्य (kāmasya)": "For a person with desires",
            "तम् छिद्रम् (tam chidram)": "Holes or gaps in their desires",
            "नित्यं ददाति (nityam dadāti)": "Constantly provide",
            "ये अरयः (ye arayaḥ)": "Those enemies",
            "योगिनः (yoginaḥ)": "Yogis or those who are adept in spiritual practices",
            "कृतमैत्रस्य (kṛtimaitrasya)": "By having treated others with kindness",
            "पुंश्चली जाये व (puṃścalī jāye va)": "Even if she is an unchaste/divisive woman and/or wife",
            "Line": "by-line breakdown:",
            "": "जाये व (jāye va) means \"even if she becomes\" or \"even if she is.\""
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "nityam `": "` always",
            "dadāti `": "` give",
            "kāmasya `": "` of desire",
            "chidram `": "` a hole",
            "tam `": "` that",
            "anu `": "` follow",
            "ye `": "` who",
            "arāyaḥ `": "` enemy",
            "yoginaḥ `": "` yogis",
            "kṛta-maitrasya `": "` with friendship created",
            "patyuḥ `": "` of husband",
            "jāyā `": "` wife",
            "iva `": "` like",
            "puṁścalī `": "` woman"
        },
        "meaning": "Always give a hole to desire who follow those enemies like woman to husband of yogis with friendship created"
    }
}