{
    "verse_no": "६-१-५६",
    "verse": "अयं हि श्रुतसम्पन्नः शीलवृत्तगुणालयः ।\nधृतव्रतो मृदुर्दान्तः सत्यवाङ्‍मन्त्रविच्छुचिः ॥",
    "meaning": "इंद्रियों पर कंट्रोल वेदों का विद्वान ",
    "vedabase": {
        "terms": {
            "ayam": "this person (known as Ajāmila)",
            "hi": "indeed",
            "śruta-sampannaḥ": "well educated in Vedic knowledge",
            "śīla": "of good character",
            "vṛtta": "good conduct",
            "guṇa": "and good qualities",
            "ālayaḥ": "the reservoir",
            "dhṛta-vrataḥ": "fixed in the execution of the Vedic injunctions",
            "mṛduḥ": "very mild",
            "dāntaḥ": "completely controlling the mind and senses",
            "satya-vāk": "always truthful",
            "mantra-vit": "knowing how to chant the Vedic hymns",
            "śuciḥ": "always very neat and clean",
            "guru": "the spiritual master",
            "agni": "the fire-god",
            "atithi": "guests",
            "vṛddhānām": "and of the old household members",
            "śuśrūṣuḥ": "very respectfully engaged in the service",
            "anahaṅkṛtaḥ": "without pride or false prestige",
            "sarva-bhūta-suhṛt": "friendly to all living entities",
            "sādhuḥ": "well-behaved (no one could find any fault in his character)",
            "mita-vāk": "talking with great care not to speak nonsense",
            "anasūyakaḥ": "not envious."
        },
        "translation": "In the beginning this brāhmaṇa named Ajāmila studied all the Vedic literatures. He was a reservoir of good character, good conduct and good qualities. Firmly established in executing all the Vedic injunctions, he was very mild and gentle, and he kept his mind and senses under control. Furthermore, he was always truthful, he knew how to chant the Vedic mantras, and he was also very pure. Ajāmila was very respectful to his spiritual master, the fire-god, guests, and the elderly members of his household. Indeed, he was free from false prestige. He was upright, benevolent to all living entities, and well-behaved. He would never speak nonsense or envy anyone.  ",
        "purport": "The order carriers of Yamarāja, the Yamadūtas, are explaining the factual position of piety and impiety and how a living entity is entangled in this material world. Describing the history of Ajāmila’s life, the Yamadūtas relate that in the beginning he was a learned scholar of the Vedic literature. He was well-behaved, neat and clean, and very kind to everyone. In fact, he had all good qualities. In other words, he was like a perfect brāhmaṇa. A brāhmaṇa is expected to be perfectly pious, to follow all the regulative principles and to have all good qualities. The symptoms of piety are explained in these verses. Śrīla Vīrarāghava Ācārya comments that dhṛta-vrata means dhṛtaṁ vrataṁ strī-saṅga-rāhityātmaka-brahmacarya-rūpam. In other words, Ajāmila followed the rules and regulations of celibacy as a perfect brahmacārī and was very softhearted, truthful, clean and pure. How he fell down in spite of all these qualities and thus came to be threatened with punishment by Yamarāja will be described in the following verses."
    },
    "gpt": {
        "terms": {
            "अयं": "यह (व्यक्ति)",
            "हि": "निश्चयतः, तोतः",
            "श्रुतसम्पन्नः": "श्रुतिसम्पदायुक्त",
            "शीलवृत्तगुणालयः": "आचरण, वृत्ति और गुणों का आपूर्ति-स्थान",
            "धृतव्रतः": "प्रतिज्ञा धारण करने वाला",
            "मृदुः": "नरमेधा, कृपाशील, सही",
            "दान्तः": "प्रिय विषयों की नियंत्रण करनेवाला",
            "सत्यवाङ्मन्त्रविच्छुचिः": "सत्य और वाणी का शुद्ध वचन"
        },
        "meaning": " He is gentle, kind hearted, and compassionate."
    },
    "bard": {
        "terms": {
            "ayam hi": "this indeed",
            "śruta-sampannaḥ": "is endowed with learning",
            "śīla vṛtta guṇa ālayaḥ": "a storehouse of good character and virtues",
            "dhṛta-vrataḥ": "firmly adhering to vows",
            "mṛduḥ": "gentle",
            "dāntaḥ": "self-controlled",
            "satya-vāk": "truthful",
            "mantra-vit": "versed in mantras",
            "śuciḥ": "pure",
            "guru agni atithi vṛddhānām śuśrūṣuḥ": "devoted to his guru, fire, guests and elders",
            "anahaṅkṛtaḥ": "without ego",
            "sarva-bhūta-suhṛt": "friend to all beings",
            "sādhuḥ": "good",
            "mita-vāk": "of pleasant speech",
            "anasūyakaḥ": "free from malice"
        },
        "meaning": "This indeed is endowed with learning, a storehouse of good character and virtues, firmly adhering to vows, gentle, self-controlled, truthful, versed in mantras, pure, devoted to his guru, fire, guests and elders, without ego, friend to all beings, good, of pleasant speech, free from malice."
    }
}