{
    "verse_no": "६-११-२५",
    "verse": "न नाकपृष्ठं न च पारमेष्ठ्यं न सार्वभौमं न रसाधिपत्यम् ।\nन योगसिद्धीरपुनर्भवं वा समञ्जस त्वा विरहय्य काङ्‌क्षे ॥",
    "meaning": "जो भगवान के प्रपन्न हैं निष्काम भक्त ओ स्वर्ग नहीं चाहते, न पृथ्वी का साम्राज्य चाहते है न ब्रह्मा का पद चाहते हैं न रसातल का, न योग सिद्धियां न कुछ नहीं चाहते ओ मेरी सेवा चाहते",
    "vedabase": {
        "terms": {
            "na": "nor",
            "nāka-pṛṣṭham": "the heavenly planets or Dhruvaloka",
            "ca": "also",
            "pārameṣṭhyam": "the planet on which Lord Brahmā resides",
            "sārva-bhaumam": "sovereignty of the whole earthly planetary system",
            "rasā-ādhipatyam": "sovereignty of the lower planetary systems",
            "yoga-siddhīḥ": "eight kinds of mystic yogic power (aṇimā, laghimā, mahimā, etc.)",
            "apunaḥ-bhavam": "liberation from rebirth in a material body",
            "vā": "or",
            "samañjasa": "O source of all opportunities",
            "tvā": "You",
            "virahayya": "being separated from",
            "kāṅkṣe": "I desire."
        },
        "translation": "O my Lord, source of all opportunities, I do not desire to enjoy in Dhruvaloka, the heavenly planets or the planet where Lord Brahmā resides, nor do I want to be the supreme ruler of all the earthly planets or the lower planetary systems. I do not desire to be master of the powers of mystic yoga, nor do I want liberation if I have to give up Your lotus feet.  ",
        "purport": "A pure devotee never desires to gain material opportunities by rendering transcendental loving service to the Lord. A pure devotee desires only to engage in loving service to the Lord in the constant association of the Lord and His eternal associates, as stated in the previous verse (dāsānudāso bhavitāsmi). As confirmed by Narottama dāsa Ṭhākura: tāṅdera caraṇa sevi bhakta-sane vāsajaname janame haya, ei abhilāṣa To serve the Lord and the servants of His servants, in the association of devotees, is the only objective of a pure, unalloyed devotee."
    },
    "gpt": {
        "terms": {
            "न (na)": "not",
            "नाकपृष्ठं (nākapṛṣṭham)": "the celestial abode of Lord Brahma",
            "न च (na cha)": "and not",
            "पारमेष्ठ्यं (pārameṣṭhyam)": "the supreme lordship",
            "सार्वभौमं (sārvabhaumaṁ)": "the emperor of all",
            "रसाधिपत्यम् (rasādhipatyam)": "the lordship over all tastes",
            "योगसिद्धीः (yogasiddhīḥ)": "the attainment of perfection through yoga",
            "अपुनर्भवं (apunarbhavaṁ)": "the cycle of birth and death",
            "वा (vā)": "or",
            "समञ्जस (samañjasa)": "Oh beloved!",
            "त्वा (tvā)": "you",
            "विरहय्य (virahayya)": "I desire to be away from",
            "काङ्क्षे (kāṅkṣe)": "I long for"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "na": "not",
            "nāka-pṛṣṭham": "peak of the sky",
            "ca": "and",
            "pārameṣṭhyam": "supremacy",
            "sārva-bhaumam": "all-pervading",
            "rasā-ādhipatyam": "lord of taste",
            "yoga-siddhīḥ": "attainment of yoga",
            "apunaḥ-bhavam": "or return to this world",
            "vā": "or",
            "samañjasa": "with good sense",
            "tvā": "you",
            "virahayya": "without",
            "kāṅkṣe": "desire"
        },
        "meaning": "I do not desire the peak of the sky, nor supremacy, nor all-pervading, nor lordship over taste, nor attainment of yoga, nor return to this world – with good sense I desire you without desire"
    }
}