{
    "verse_no": "६-२-१७",
    "verse": "तैस्तान्यघानि पूयन्ते तपोदानव्रतादिभिः ।\nनाधर्मजं तद्‌धृदयं तदपीशाङ्‌घ्रिसेवया ॥",
    "vedabase": {
        "terms": {
            "taiḥ": "by those",
            "tāni": "all those",
            "aghāni": "sinful activities and their results",
            "pūyante": "become vanquished",
            "tapaḥ": "austerity",
            "dāna": "charity",
            "vrata-ādibhiḥ": "by vows and other such activities",
            "na": "not",
            "adharma-jam": "produced from irreligious actions",
            "tat": "that",
            "hṛdayam": "the heart",
            "api": "also",
            "īśa-aṅghri": "of the lotus feet of the Lord",
            "sevayā": "by service."
        },
        "translation": "Although one may neutralize the reactions of sinful life through austerity, charity, vows and other such methods, these pious activities cannot uproot the material desires in one’s heart. However, if one serves the lotus feet of the Personality of Godhead, he is immediately freed from all such contaminations.  ",
        "purport": "As stated in Śrīmad-Bhāgavatam (11.2.42), bhaktiḥ pareśānubhavo viraktir anyatra ca: devotional service is so powerful that one who performs devotional service is immediately freed from all sinful desires. All desires within this material world are sinful because material desire means sense gratification, which always involves action that is more or less sinful. Pure bhakti, however, is anyābhilāṣitā-śūnya; in other words, it is free from material desires, which result from karma and jñāna. One who is situated in devotional service no longer has material desires, and therefore he is beyond sinful life. Material desires should be completely stopped. Otherwise, although one’s austerities, penances and charity may free one from sin for the time being, one’s desires will reappear because his heart is impure. Thus he will act sinfully and suffer."
    },
    "gpt": {
        "terms": {
            "तैस्तानि": "By those",
            "अघानि": "sins",
            "पूयन्ते": "are purified",
            "तपोदानव्रतादिभिः": "through austerities, charity and other such practices",
            "नाधर्मजं": "not generated by unrighteousness",
            "तद्धृदयं": "that pure heart",
            "तदपीशाङ्‌घ्रिसेवया": "by the service of the feet of the Lord"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "tāni aghāni": "those sins",
            "pūyante": "are purified",
            "tapaḥ": "austerities",
            "dāna": "charity",
            "vrata-ādibhiḥ": "vows etc.",
            "na adharma-jam": "born of unrighteousness",
            "tat": "that",
            "hṛdayam": "heart",
            "api": "even",
            "īśa-aṅghri sevayā": "by service at the feet of the Lord"
        },
        "meaning": "The sins are purified by austerities, charity, vows, etc. Even the heart born of unrighteousness is purified by service at the feet of the Lord."
    }
}