{
    "verse_no": "७-७-५२",
    "verse": "न दानं न तपो नेज्या न शौचं न व्रतानि च ।\nप्रीयतेऽमलया भक्त्या हरिरन्यद् विडम्बनम् ॥",
    "vedabase": {
        "terms": {
            "na": "nor",
            "dānam": "charity",
            "na tapaḥ": "no austerity",
            "ijyā": "worship",
            "śaucam": "cleanliness",
            "na vratāni": "nor execution of great vows",
            "ca": "also",
            "prīyate": "is satisfied",
            "amalayā": "by spotless",
            "bhaktyā": "devotional service",
            "hariḥ": "the Supreme Lord",
            "anyat": "other things",
            "viḍambanam": "only show."
        },
        "translation": "My dear friends, O sons of the demons, you cannot please the Supreme Personality of Godhead by becoming perfect brāhmaṇas, demigods or great saints or by becoming perfectly good in etiquette or vast learning. None of these qualifications can awaken the pleasure of the Lord. Nor by charity, austerity, sacrifice, cleanliness or vows can one satisfy the Lord. The Lord is pleased only if one has unflinching, unalloyed devotion to Him. Without sincere devotional service, everything is simply a show.  ",
        "purport": "Prahlāda Mahārāja concludes that one can become perfect by serving the Supreme Lord sincerely by all means. Material elevation to life as a brāhmaṇa, demigod, ṛṣi and so on are not causes for developing love of Godhead, but if one sincerely engages in the service of the Lord, his Kṛṣṇa consciousness is complete. This is confirmed in Bhagavad-gītā (9.30): api cet sudurācārobhajate mām ananya-bhāksādhur eva sa mantavyaḥsamyag vyavasito hi saḥ “Even if one commits the most abominable actions, if he is engaged in devotional service he is to be considered saintly because he is properly situated.” To develop unalloyed love for Kṛṣṇa is the perfection of life. Other processes may be helpful, but if one does not develop his love for Kṛṣṇa, these other processes are simply a waste of time. dharmaḥ svanuṣṭhitaḥ puṁsāṁviṣvaksena-kathāsu yaḥnotpādayed yadi ratiṁśrama eva hi kevalam “Duties [dharma] executed by men, regardless of occupation, are only so much useless labor if they do not provoke attraction for the message of the Supreme Lord.” (Bhāg. 1.2.8) The test of perfection is one’s unalloyed devotion to the Lord."
    },
    "gpt": {
        "terms": {
            "न दानं": "Not charity",
            "न तपो": "Not penance",
            "नेज्या": "Not sacrifice",
            "न शौचं": "Not cleanliness",
            "न व्रतानि च": "Not observance of vows",
            "प्रीयते": "Is pleased",
            "अमलया": "With pure",
            "भक्त्या": "Devotion",
            "हरिः": "Lord Hari",
            "अन्यद् विडम्बनम्": "Other than pretentious behavior"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "na": "not",
            "alam": "sufficient",
            "dvijatvam": "Brahminhood",
            "devatvam": "Godhood",
            "ṛṣitvam": "Sagehood",
            "vā": "or",
            "asura-ātma-jāḥ": "born of demoniac nature",
            "prīṇanāya": "to please",
            "mukundasya": "Mukunda (Krishna)",
            "vṛttam": "actions",
            "bahu-jñatā": "wide knowledge",
            "dānam": "charity",
            "tapaḥ": "penance",
            "ijyā": "sacrifice",
            "śaucam": "purity",
            "vratāni": "vows",
            "ca": "also",
            "prīyate": "is pleasing",
            "amalayā": "pure",
            "bhaktyā": "devotion",
            "hariḥ": "Hari (Krishna)",
            "anyat": "other",
            "viḍambanam": "hypocrisy"
        },
        "meaning": "Meaning:Brahminhood, Godhood, or Sagehood, are not sufficient to please Mukunda, nor are wide knowledge, charity, penance, sacrifices, purity, and vows. Hari is pleased only by pure devotion, not by hypocrisy."
    }
}