{
    "verse_no": "७-९-१०",
    "verse": "विप्राद् द्विषड् गुण युतादरविन्द नाभोपादारविन्दविमुखात्श्वपचं वरिष्ठम् ।\nमन्ये तदर्पितमनो वचने हितार्थप्राणं पुनाति स कुलं न तु भूरिमानः ॥",
    "vedabase": {
        "terms": {
            "viprāt": "than a brāhmaṇa",
            "dvi-ṣaṭ-guṇa-yutāt": "qualified with twelve brahminical qualities*",
            "aravinda-nābha": "Lord Viṣṇu, who has a lotus growing from His navel",
            "pāda-aravinda": "to the lotus feet of the Lord",
            "vimukhāt": "not interested in devotional service",
            "śva-pacam": "one born in a low family, or a dog-eater",
            "variṣṭham": "more glorious",
            "manye": "I consider",
            "tat-arpita": "surrendered unto the lotus feet of the Lord",
            "manaḥ": "his mind",
            "vacana": "words",
            "īhita": "every endeavor",
            "artha": "wealth",
            "prāṇam": "and life",
            "punāti": "purifies",
            "saḥ": "he (the devotee)",
            "kulam": "his family",
            "na": "not",
            "tu": "but",
            "bhūrimānaḥ": "one who falsely thinks himself to be in a prestigious position."
        },
        "translation": "If a brāhmaṇa has all twelve of the brahminical qualifications [as they are stated in the book called Sanat-sujāta] but is not a devotee and is averse to the lotus feet of the Lord, he is certainly lower than a devotee who is a dog-eater but who has dedicated everything — mind, words, activities, wealth and life — to the Supreme Lord. Such a devotee is better than such a brāhmaṇa because the devotee can purify his whole family, whereas the so-called brāhmaṇa in a position of false prestige cannot purify even himself.  ",
        "purport": "Here is a statement by Prahlāda Mahārāja, one of the twelve authorities, regarding the distinction between a devotee and a brāhmaṇa expert in karma-kāṇḍa, or Vedic ritualistic ceremonies. There are four varṇas and four āśramas, which divide human society, but the central principle is to become a first-class pure devotee. It is said in the Hari-bhakti-sudhodaya: bhagavad-bhakti-hīnasyajātiḥ śāstraṁ japas tapaḥaprāṇasyaiva dehasyamaṇḍanaṁ loka-rañjanam “If one is born in a high family like that of a brāhmaṇa, kṣatriya or vaiśya but is not a devotee of the Lord, all his good qualifications as a brāhmaṇa, kṣatriya or vaiśya are null and void. Indeed, they are considered decorations of a dead body.” In this verse Prahlāda Mahārāja speaks of the vipras, the learned brāhmaṇas. The learned brāhmaṇa is considered best among the divisions of brāhmaṇa, kṣatriya, vaiśya and śūdra, but a devotee born in a low caṇḍāla family is better than such brāhmaṇas, not to speak of the kṣatriyas, vaiśyas and others. A devotee is better than anyone, for he is in the transcendental position on the Brahman platform. māṁ ca yo vyabhicāreṇabhakti-yogena sevatesa guṇān samatītyaitānbrahma-bhūyāya kalpate “One who engages in full devotional service, who does not fall down in any circumstance, at once transcends the modes of material nature and thus comes to the level of Brahman.” (Bg. 14.26) The twelve qualities of a first-class brāhmaṇa, as stated in the book called Sanat-sujāta, are as follows: jñānaṁ ca satyaṁ ca damaḥ śrutaṁ cahy amātsaryaṁ hrīs titikṣānasūyāyajñaś ca dānaṁ ca dhṛtiḥ śamaś camahā-vratā dvādaśa brāhmaṇasya The European and American devotees in the Kṛṣṇa consciousness movement are sometimes accepted as brāhmaṇas, but the so-called caste brāhmaṇas are very much envious of them. In answer to such envy, Prahlāda Mahārāja says that one who has been born in a brāhmaṇa family but is falsely proud of his prestigious position cannot even purify himself, not to speak of his family, whereas if a caṇḍāla, a lowborn person, is a devotee and has fully surrendered unto the lotus feet of the Lord, he can purify his entire family. We have had actual experience of how Americans and Europeans, because of their full Kṛṣṇa consciousness, have purified their whole families, so much so that a mother of a devotee, at the time of her death, inquired about Kṛṣṇa with her last breath. Therefore it is theoretically true and has been practically proven that a devotee can give the best service to his family, his community, his society and his nation. The foolish accuse a devotee of following the principle of escapism, but actually the fact is that a devotee is the right person to elevate his family. A devotee engages everything in the service of the Lord, and therefore he is always exalted."
    },
    "gpt": {
        "terms": {
            "विप्रात्": "from a brahmana (scholar, wise person)",
            "द्विषन्ति": "they abhor, dislike",
            "गुणयुतात्": "possessing qualities",
            "अरविन्दनाभ": "with a lotus-like navel",
            "उपादारविन्द": "विमुखात् - facing towards the lotus-like feet",
            "श्वपचं": "a dog-eater (outcast)",
            "वरिष्ठम्": "superior, distinguished",
            "मन्ये": "I believe",
            "तद्": "their",
            "अर्पितमनः": "offered mind",
            "वचने": "in speech",
            "हितार्थप्राणं": "the life dedicated to the welfare",
            "पुनाति": "purifies",
            "सः": "that person",
            "कुलम्": "lineage, family",
            "न": "not",
            "तु": "but",
            "भूरिमानः": "one who is proud"
        },
        "meaning": " A brahmana, who possesses qualities and a lotus like navel, is disliked by those who face towards the lotus-like feet of God and are considered outcasts. However, I believe that the person who dedicates their mind and speech to the welfare of others purifies their own lineage, not the one who is filled with pride."
    },
    "bard": {
        "terms": {
            "viprāt `": "` brāhman",
            "dvi-ṣaṭ-guṇa-yutāt `": "` twice six गुण =` quality` युक्त =` possessed of` =` twice six quality possessed of`",
            "aravinda-nābha": "` lotus navel`",
            "pāda-aravinda": "` lotus feet`",
            "vimukhāt": "` turned away from`",
            "śva-pacam": "` dog cooker`",
            "variṣṭham": "` best`",
            "manye": "` I consider`",
            "tat-arpita": "` that offered`",
            "manaḥ": "` mind`",
            "vacana": "` word`",
            "īhita": "` desired`",
            "artha": "` meaning`",
            "prāṇam": "` life`",
            "punāti": "` purifies`",
            "saḥ": "` he`",
            "kulam": "` family`",
            "na": "` not`",
            "tu": "` but`",
            "bhūrimānaḥ": "` wealthy`"
        },
        "meaning": "Brāhman possessed of twice six qualities, turned away from lotus navel and lotus feet, I consider the dog cooker the best. He purifies the mind, word, desired meaning and life, but not the family of wealthy."
    }
}