{
    "verse_no": "८-३-३",
    "verse": "यस्मिन्निदं यतश्चेदं येनेदं य इदं स्वयम् ।\nयोऽस्मात् परस्माच्च परस्तं प्रपद्ये स्वयम्भुवम् ॥",
    "vedabase": {
        "terms": {
            "yasmin": "the basic platform on which",
            "idam": "this material world",
            "yataḥ": "the ingredients from which",
            "ca": "and",
            "yena": "by whom",
            "yaḥ": "He who",
            "svayam": "is Himself",
            "asmāt": "from the effect (this material world)",
            "parasmāt": "from the cause",
            "paraḥ": "transcendental or different",
            "tam": "unto Him",
            "prapadye": "I surrender",
            "svayambhuvam": "unto the supreme self-sufficient."
        },
        "translation": "The Supreme Godhead is the supreme platform on which everything rests, the ingredient by which everything has been produced, and the person who has created and is the only cause of this cosmic manifestation. Nonetheless, He is different from the cause and the result. I surrender unto Him, the Supreme Personality of Godhead, who is self-sufficient in everything.  ",
        "purport": "In Bhagavad-gītā (9.4) the Lord says, mayā tatam idaṁ sarvaṁ jagad avyakta-mūrtinā: “I am the Supreme Personality of Godhead, but everything rests upon My energy, just as an earthen pot rests on the earth.” The place where an earthen pot rests is also earth. Then again, the earthen pot is manufactured by a potter, whose body is a product of earth. The potter’s wheel with which the pot is made is an expansion of earth, and the ingredients from which the pot are made are also earth. As confirmed in the śruti-mantra, yato vā imāni bhūtāni jāyante; yena jātāni jīvanti yat prayanty abhisaṁviśanti. The original cause of everything is the Supreme Personality of Godhead, and after being annihilated, everything enters into Him (prakṛtiṁ yānti māmikām). Thus the Supreme Lord, the Personality of Godhead — Lord Rāmacandra or Lord Kṛṣṇa — is the original cause of everything. īśvaraḥ paramaḥ kṛṣṇaḥsac-cid-ānanda-vigrahaḥanādir ādir govindaḥsarva-kāraṇa-kāraṇam “Kṛṣṇa, who is known as Govinda, is the supreme controller. He has an eternal, blissful, spiritual body. He is the origin of all. He has no other origin, for He is the prime cause of all causes.” (Brahma-saṁhitā 5.1) The Lord is the cause for everything, but there is no cause for Him. Sarvaṁ khalv idaṁ brahma. Mat-sthāni sarva-bhūtāni na cāhaṁ teṣv avasthitaḥ. Although He is everything, His personality is different from the cosmic manifestation."
    },
    "gpt": {
        "terms": {
            "यस्मिन्निदं (yasminnidam)": "In which",
            "यतश्चेदं (yatashchedam)": "from which and by which",
            "येनेदं (yenidam)": "by which this",
            "य इदं (ya idam)": "that which is this",
            "स्वयम् (svayam)": "Self or the Supreme Being",
            "योऽस्मात् (yo 'smat)": "from which",
            "परस्माच्च (parasmaccha)": "from another entity or source",
            "परस्तं (parastam)": "beyond that",
            "प्रपद्ये (prapadye)": "I take refuge or surrender",
            "स्वयम्भुवम् (svayambhuvam)": "the self-existing or self-born (refers to the Supreme Being)"
        },
        "meaning": " In this verse, the speaker contemplates the nature of existence. It states that from the Supreme Being or Self, everything in the universe arises and by which everything is sustained. That which is this world and all its manifestations is the essence of the Supreme Being. Realizing this, the speaker acknowledges surrender and refuge to the higher power beyond and above all that exists. The term \"svayambhuvam\" signifies the self existing or self-born nature of the Supreme Being, emphasizing its eternal and independent existence."
    },
    "bard": {
        "terms": {
            "yasmin": "in whom",
            "idam": "this",
            "yataḥ": "from whom",
            "ca": "and",
            "yena": "by whom",
            "yaḥ": "who",
            "svayam": "himself",
            "asmāt": "from us",
            "parasmāt": "from others",
            "paraḥ": "higher",
            "tam": "that",
            "prapadye": "I bow down",
            "svayambhuvam": "self-existent"
        },
        "meaning": "I bow down to that self-existent Being, from whom this world has come, by whom it is sustained and who is higher than all others."
    }
}