{
    "verse_no": "९-१९-१३",
    "verse": "यत्पृथिव्यां व्रीहियवं हिरण्यं पशवः स्त्रियः ।\n नालमेकस्य पर्याप्तम् ॥",
    "learning": {
        "अलम्": "insufficiency, अलु -> small, little, few"
    },
    "vedabase": {
        "terms": {
            "yat": "what",
            "pṛthivyām": "within this world",
            "vrīhi": "food grains, rice",
            "yavam": "barley",
            "hiraṇyam": "gold",
            "paśavaḥ": "animals",
            "striyaḥ": "wives or other women",
            "na duhyanti": "do not give",
            "manaḥ-prītim": "satisfaction of the mind",
            "puṁsaḥ": "to a person",
            "kāma-hatasya": "because of being victimized by lusty desires",
            "te": "they."
        },
        "translation": "A person who is lusty cannot satisfy his mind even if he has enough of everything in this world, including rice, barley and other food grains, gold, animals and women. Nothing can satisfy him.  ",
        "purport": "Improvement of one’s economic condition is the aim and object of a materialist, but there is no end to this material advancement, for if one cannot control his lusty desires, he will never be pleased, even if he gets all the material wealth of the world. In this age we see much material improvement, but still people are struggling to get more and more material opulence. Manaḥ ṣaṣṭhānīndriyāṇi prakṛti-sthāni karṣati. Although every living entity is a part of the Supreme Being, because of lusty desires one continuously struggles for so-called betterment of one’s economic condition. To have a satisfied mind, one must give up his heart disease of lusty desires. This can be done only when one is Kṛṣṇa conscious. bhaktiṁ parāṁ bhagavati pratilabhya kāmaṁhṛd-rogam āśv apahinoty acireṇa dhīraḥ (Bhāg. 10.33.39) If one becomes Kṛṣṇa conscious, then he can give up this heart disease; otherwise this disease of lusty desires will continue, and one cannot have peace in his mind."
    },
    "gpt": {
        "terms": {
            "यत् (yat)": "that which",
            "पृथिव्यां (pṛthivyām)": "in the world",
            "व्रीहियवं (vrīhiyavaṁ)": "rice and barley (grains)",
            "हिरण्यं (hiraṇyaṁ)": "gold",
            "पशवः (paśavaḥ)": "cattle",
            "स्त्रियः (striyaḥ)": "women",
            "न (na)": "not",
            "अलम् (alam)": "sufficient",
            "एकस्य (ekasya)": "for one (person)",
            "पर्याप्तम् (paryāptam)": "enough"
        },
        "meaning": ""
    },
    "bard": {
        "terms": {
            "yat": "that which",
            "pṛthivyām": "in the earth",
            "vrīhi": "rice",
            "yavam": "barley",
            "hiraṇyam": "gold",
            "paśavaḥ": "cattle",
            "striyaḥ": "women",
            "na duhyanti": "do not give",
            "manaḥ-prītim": "mental satisfaction",
            "puṁsaḥ": "to a man",
            "kāma-hatasya": "who is lost to lust",
            "te": "those"
        },
        "meaning": "that which in the earth rice barley gold cattle women do not give mental satisfaction to a man who is lost to lust those"
    }
}