{
    "verse_no": "१-३",
    "verse": "न तत्र चक्षुर्गच्छति न वाग्गच्छति नो मनो\nन विद्मो न विजानीमो यथैतदनुशिष्यात्।\nअन्यदेव तद्विदितादथो अविदितादधि।\nइति शुश्रुम पूर्वेषां ये नस्तद्व्याचचक्षिरे ॥",
    "terms": {
        "न तत्र चक्षुर्गच्छति": "There the eye does not go",
        "न वाग्गच्छति": "There speech does not go",
        "नो मनो": "There the mind does not go",
        "न विद्मो": "There we do not know",
        "न विजानीमो": "There we do not understand",
        "यथैतदनुशिष्यात्": "How can we then teach?",
        "अन्यदेव तद्विदितादथो अविदितादधि": "It is different from the known and also from the unknown",
        "इति शुश्रुम पूर्वेषां ये नस्तद्व्याचचक्षिरे": "Thus have we heard from the ancient sages who explained this to us"
    },
    "meaning": "The eye does not go there, nor speech, nor mind. We do not know That. We do not know how to instruct one about It. It is distinct from the known and above the unknown. We have heard it so stated by preceptors who taught us that. (3) \n\n\n For the reason that the Brahman is the ear of the ear, i.e., the Atman of all. the eye cannot go to the Brahman; for it is not possible to go to one’s own self. Similarly speech does not go there. When a word spoken by the mouth enlightens the object denoted by it, then the word is said to go to that object. But the Atman of that word and of the organ that utters it is the Brahman. So the word does not go there. Just as fire that burns and enlightens things does not either enlighten or burn itself, so the mind, which wills and determines in respect of external objects, cannot will or determine in respect of its self, because its Atman is also the Brahman. A thing is cognised by the senses and the mind. We do not, therefore, know the Brahman, because it cannot be an object of perception to these; and we do not, therefore, know what the Brahman is like, so as to allow us to enlighten the disciple about the Brahman. Whatever can be perceived by the senses, it is possible to explain to others by epithets denoting its class, its attributes and modes of activity; but the Brahman has no attributes of class, etc. It, therefore, follows that it is not possible to make the disciple believe in the Brahman by instruction. The portion of the text beginning with ‘Navidmah’ (we do not know) shows the necessity of putting forth great exertion in the matter of giving instruction and understanding it, in respect of the Brahman. Considering that the previous portion of the text leads to the conclusion that it is impossible by any means to instruct one about the Atman, the following exceptional mode is pointed out. Indeed it is true that one cannot be persuaded to believe in the Brahman by the evidence of the senses and other inodes of proof; but it is possible to make him believe by the aid of Agamas (Scriptures). Therefore the preceptor recites Agamas for the purpose of teaching about the Brahman and says: ‘It is something distinct from the known and something beyond the unknown, etc.’ ‘Anyat,’ ‘something distinct’; ‘Tat,’ ‘the present theme i.e., that which has been defined to be the ear of the ear, etc., and beyond their (ear. eye, etc.,) reach. That is certainly distinct from the known. ‘The known,’ means ‘whatever is the object of special knowledge;’ and as all such objects can be known somewhere, to some extent and by some one and so forth, the whole (manifested universe) is meant by the term ‘the known;’ the drift is, that the Brahman is distinct from this. But lest the Brahnan should be confounded with the unknown, the text says: ‘It is beyond the Unknown.’ ‘Aviditat’ means ‘something opposed to the known;’ hence, unmanitested illusion (avidya) the seed of all manifestation. ‘Adhi’ literally means ‘above’ but is here used in the derivative sense of ‘something different from for, it is well known that one thing placed above another is something distinct from that other.\n\nWhatever is known is little, mortal and full of misery and, therefore, fit to be abandoned. Therefore when it is said that Brahman is distinct from the Known, it is clear that it is not to be abandoned. Similarly, when the Brahman is said to be distinct from the Unknown it is in effect said that the Brahman is not fit to be taken. It is to produce an effect that one seeks for a cause. Therefore there can be nothing distinct from the knower, which the knower could seek for, with any benefit. Thus, by saying that the Brahman is distinct from both the Known and the Unknown and thus disproving its fitness to be abandoned or to be taken, the desire of the disciple to know anything distinct from Self (Atman) is checked. For, it is clear that none other than one’s Atman can be distinct from both the Known and the Unknown; the purport of the text is that the Atman is Brahman. The Srutis also say: “This Atman is Brahman:” “this Atman who is untouched by sin.” “This is the known and the unknown Brahman;” “This Atman is within all;” etc. The preceptor next says how this meaning of the text, that the Atman of all, marked by no distinguishing attributes, bright and intelligent, is the Brahman, has been traditionally handed down from preceptor to disciple.\n\nAnd Brahman can he known only by instruction from preceptors and not by logical disquisitions, nor by expositions, intelligence, great learning, penance or sacrifices, etc. We have beard this saying of the preceptors who clearly taught us the Brahman."
}