{
    "verse_no": "१-४",
    "verse": "यद्वाचानभ्युदितं येन वागभ्युद्यते।\nतदेव ब्रह्म त्वं विद्धि नेदं यदिदमुपासते ॥",
    "terms": {
        "यत् (yat)": "that which",
        "वाचा (vācā)": "by speech",
        "अनाभ्युदितम् (anabhuyditam)": "cannot be expressed",
        "येन (yena)": "by which",
        "वाग् (vāk)": "speech",
        "आभ्युद्यते (abhyudyate)": "is expressed",
        "तदेव (tadeva)": "that alone",
        "ब्रह्म (brahma)": "is Brahman (the ultimate reality)",
        "त्वं (tvaṃ)": "you",
        "विद्धि (viddhi)": "understand",
        "न इदं (na idam)": "not this",
        "यद् (yad)": "which",
        "इदम् (idam)": "this",
        "उपासते (upāsate)": "is worshipped"
    },
    "meaning": "What speech does not enlighten, but what enlightens speech, know that alone to be the Brahman, not this which (people) here worship\n\n\n When by the text “It is something distinct from both the known and the unknown,” the preceptor conveyed that the Atman is Brahman, the disciple doubted how the Atman could be Brahman. The Atman, as is well known, being entitled to perform Karma and worship (of the gods) and being subject to births and re-births seeks to attain Brahma or other Devas, or heaven, by means of Karma or worship. Therefore, somebody other than the Atman, such as Vishnu, Isvara, Indra or Prana, entitled to be worshipped, may well be Brahman; but the Atman, can never be; for it is contrary to popular belief. Just as logicians contend that the Atman is distinct from Isvara, so the votaries of Karma worship Devas, other than the Atman, saying: ‘Propitiate this Deva by sacrifice’ and ‘Propitiate that Deva by sacrifice.’ Therefore it is only reasonable that what is known and entitled to worship is Brahman and that the worshipper is other than that. The preceptor inferred this doubt running in the disciple’s mind either from his looks or from his words and said: ‘Do not doubt thus.’ Yat means ‘that which is intelligence itself.’ Vale is the organ presided over by Agni (Fire) occupying eight localities in the body, such as the root of the tongue, &c. The letters are intended to express the meaning to be conveyed and are subject to laws as to their number and order. The word which is produced by them is called Vak (speech.) The Sruti says “The letter a is all speech, which being produced by the use of letters, divided into sparsa, antastha and ushma becomes diverse and assumes many forms.” The Rik, Yajur, Sama and truth and falsehood are its modifications. By such speech, enclosed in words and conditioned by the organ of speech, Brahman is not illumined or explained. ‘Yena,’ ‘by the Brahman.’ Brahman by its brightness illumines speech, and its organ. It has been said here that, That (Brahman) is the speech of speech. The Vajasaneyaka says ‘Brahman is within the speech and directs it.’ Having said ‘Speech in man is the same as that in the letters and that some Brahmin knows it,’ the Upanishad, in answer to a question anticipated, says “That is speech, by which one speaks in dreams.” The speakers power of speech is eternal, and is by nature of the same essence as Intelligence. The power of speech of the speaker knows no decay. So says the Sruti. Know this Atman to be the Brahman, unsurpassable, known as Bhuma. Brahman, because it is big, all-pervading; know this through its conditions of speech, etc. The following expressions ‘speech of speech,’‘eye of the eye,’ ‘ear of the ear,’ ‘mind of the mind,’ ‘doer,’ ‘enjoyer,’ ‘knower,’ ‘controller,’ ‘governor,’ ‘Brahman is knowledge and bliss,’ etc., are used in popular language of the unspeakable Brahman, devoid of attributes, highest of all, unchangeable. Disregarding these, know the Atman itself to be the unconditioned Brahman. This is the meaning. Brahman is not what people here worship, such as Isvara, which is not the Atman, and which is conditioned and referred to as ‘this.’ Though it had been said ‘know That to be Brahman,’ still it is again said: “and not this, etc.,” thus repeating the idea that what is not Atman is not Brahman. This is either to lay down a Niyama (a rule restricting the choice to a stated alternative when several others are (possible) or for Parisankhyana (exclusion)."
}