{
    "verse_no": "१-६",
    "verse": "यच्चक्षुषा न पश्यति येन चक्षूंषि पश्यति।\nतदेव ब्रह्म त्वं विद्धि नेदं यदिदमुपासते ॥",
    "terms": {
        "yat": "which",
        "cakṣuṣā": "with the eyes",
        "na": "not",
        "paśyati": "perceive",
        "yena": "by which",
        "cakṣūṁṣi": "the eyes",
        "tad": "that",
        "eva": "indeed",
        "brahma": "Supreme Reality/Ultimate Truth/God",
        "tvam": "you",
        "viddhi": "understand",
        "idam": "this",
        "upāsate": "worship"
    },
    "meaning-gpt": "What the eyes cannot see, but by which the eyes themselves see, know that to be the Supreme Reality, and not what people worship here.Explanation:This verse is taken from the Kenopanishad. It presents a profound philosophical message. It conveys the idea that the Supreme Reality, or the Ultimate Truth, cannot be directly perceived by the physical senses, such as the eyes. The eyes can only perceive the external world, the objects and forms that are within the realm of the senses. However, it is due to a higher power or consciousness that these senses are able to function and perceive their respective objects.The verse suggests that it is through this same higher power or consciousness that we can truly understand and know the Supreme Reality. It is not something that can be worshipped or perceived like the objects of the world, but rather it is the underlying essence that makes perception possible. Therefore, the verse encourages us to transcend the limited physical realm and seek a deeper understanding of the ultimate truth that exists beyond the perception of the senses.",
    "upanishad-org": {
        "meaning": "वह' जो चक्षु के द्वारा नहीं देखता,'वह' जिसके द्वारा व्यक्ति चक्षु को देखने की क्रिया को देखता है 'उसे' ही तुम 'ब्रह्म' जानो, ना कि इसे जिसकी मनुष्य यहां उपासना करते हैं"
    },
    "wisdomlib": {
        "meaning": "What cannot be seen by the eye, but by which the eyes are able to see. That alone know thou to be the Brahman; not this which (people) here worship.",
        "Shankara’s Commentary": "‘See’ means ‘perceive as an object.’ By the light of the Atman, connected with the activities of the mind, man perceives the activity of the eye, varying with the activity of the mind."
    }
}