{
    "verse_no": "२-३",
    "verse": "यस्यामतं तस्य मतं मतं यस्य न वेद सः।\nअविज्ञातं विजानतां विज्ञातमविजानताम्‌ ॥",
    "terms": {
        "यस्यामतं": "Whose opinion",
        "तस्य": "of that person",
        "मतं": "(is) the view",
        "मतं यस्य": "(is) the view of the person",
        "न वेद": "(but) does not understand",
        "अविज्ञातं": "(what is) not known",
        "विजानतां": "to those who know",
        "विज्ञातम्‌": "(is) known",
        "अविजानताम्‌": "to those who do not know"
    },
    "meaning": "Whose opinion is the view of the person, but (that person) does not understand (the truth),What is not known to those who know (the truth) is known to those who do not know.This verse signifies that sometimes a person may hold a certain opinion or view, thinking it to be true, but in reality, that person may not truly understand the subject matter. On the other hand, those who are unaware or ignorant of certain aspects may actually possess knowledge that is unknown to the experts. It highlights the notion that true wisdom and understanding can exist in unexpected places and that we should not dismiss or underestimate the insights of others based solely on their lack of expertise or status.",
    "upanishad-org": {
        "meaning": "He by whom It is not thought out, has the thought of It; he by whom It is thought out, knows It not. It is unknown to the discernment of those who discern of It, by those who seek not to discern of It, It is discerned.",
        "hindi-meaning": "जिसके द्वारा इसको 'विचारबद्ध' नहीं किया जाता, उसके पास 'इसका' विचार है; जिसके द्वारा 'इसका' मननपूर्वक विचार किया गया है वह 'इसे' नहीं जानता। जो 'इसका' विवेचन करते हैं उनके लिए ‘यह' अविज्ञात है, जो 'इसके' विवेचन का प्रयत्न नहीं करते, उनके लिए 'यह' विज्ञात है।",
        "glossary": "यस्य - yasya - by whom | अमतम् - amatam - It is not thought out | तस्य - tasya - he | मतम् - matam - has the thought of It | यस्य - yasya - by whom | मतम् - matam - It is thought out | सः - saḥ - he | न वेद - na veda - knows It not | विजानताम् - vijānatām - (to the discernment) of those who discern of It | अविज्ञातम् - avijñātam - It is unknown | अविजानताम् - avijānatām - by those who seek not to discern of It | विज्ञातम् - vijñātam - It is discerned |"
    }
}