{
    "verse_no": "२-५",
    "verse": "इह चेदवेदीदथ सत्यमस्ति। न चेदिहावेदीन्महती विनष्टिः।\nभूतेषु भूतेषु विचित्य धीराः। प्रेत्यास्माल्लोकादमृता भवन्ति ॥",
    "terms": {
        "इह": "here, in this world",
        "चेद": "if",
        "अवेदीत्": "knows not",
        "अथ": "then",
        "सत्यमस्ति": "there is truth",
        "न": "not",
        "चेत्": "if",
        "इह": "here, in this world",
        "आवेदीन्": "knows",
        "महती": "great",
        "विनष्टिः": "loss, destruction",
        "भूतेषु": "among beings",
        "भूतेषु": "among beings",
        "विचित्य": "distinguishing, understanding",
        "धीराः": "wise, discerning",
        "प्रेत्य": "after death",
        "अस्मात्": "from this",
        "लोकात्": "world",
        "अमृता": "immortal",
        "भवन्ति": "become"
    },
    "ramanujacharya": "If one realizes Brahman in this life, then he attains true existence(worthy of existence), If one does not realize (Brahman) here (in this life) then there is great loss for him",
    "meaning": "It is, indeed, hard to suffer birth, old age, death, sickness, etc., owing to ignorance, being one of the crowd of living beings, such as Devas, men, beasts. (pretas), etc., full of the miseries of Samsara. Therefore if a man, even in this world being authorised and competent, knows the Atman as defined, in the manner already explained, then there is truth; i.e., there is in this birth as a mortal, immortality, usefulness, real existence. But if one living here and authorised does not know the Brahman, then there is long and great misery for him, i.e., rotation in Samsara—one continuous stream of births and deaths. Therefore the Brahmins who know the advantages and the disadvantages as above pointed out, perceive in all things in the universe, immoveable and moveable, the one essence of the God, i.e., the Brahman, turn away with disgust from this world, the creature of ignorance consisting in the false notion of ‘I’ and ‘mine’ and having realised the principle of unity, the oneness of the God in all, become immortal",
    "wisdomlib": {
        "meaning": "If one knows (That) here, then there is truth. If one knows not (That) here, there will be great loss. The wise, seeing the on e Atman in all created things, having turned away from this world, become immortal.",
        "Shankara’s Commentary": "It is, indeed, hard to suffer birth, old age, death, sickness, etc., owing to ignorance, being one of the crowd of living beings, such as Devas, men, beasts. (pretas), etc., full of the miseries of Samsara. Therefore if a man, even in this world being authorised and competent, knows the Atman as defined, in the manner already explained, then there is truth; i.e., there is in this birth as a mortal, immortality, usefulness, real existence. But if one living here and authorised does not know the Brahman, then there is long and great misery for him, i.e., rotation in Samsara—one continuous stream of births and deaths. Therefore the Brahmins who know the advantages and the disadvantages as above pointed out, perceive in all things in the universe, immoveable and moveable, the one essence of the Atman, i.e., the Brahman, turn away with disgust from this world, the creature of ignorance consisting in the false notion of ‘I’ and ‘mine’ and having realised the principle of unity, the oneness of the Atman in all, become immortal"
    }
}