{
  "verse_no": "३-१",
  "verse": "ब्रह्म ह देवेभ्यो विजिग्ये तस्य ह ब्रह्मणो विजये देवा अमहीयन्त।\nत ऐक्शन्तास्माकमेवायं विजयोऽस्माकमेवायं महिमेति ॥",
  "terms": {
    "ब्रह्म ह देवेभ्यो विजिग्ये:brahma ha devebhyo vijigye": "The Supreme Being (Brahman) has indeed conquered the gods",
    "तस्य ह ब्रह्मणो विजये देवा अमहीयन्त:tasya ha brahmaṇo vijaye devāmahīyanta": "In His victory, the gods attained greatness",
    "त ऐक्शन्तास्माकमेवायं विजयोऽस्माकमेवायं महिमेति:ta aikśantāsmākamevāyaṁ vijayo'smākamevāyaṁ mahimeti": "They desired that this victory be ours alone, that this greatness be ours alone"
  },
  "shankarachary-comm": {
    "meaning": "The Brahman won a victory for the Devas and in that victory of the Brahman the Devas attained glory. They thought ‘the victory is ours and this glory is ours alone.’",
    "comm": "From the passage that ‘It is not known to those who know,’ some fools may argue that whatever is, can be known by proofs, and whatever is not cannot be so known and is, therefore, non-existent, as the horns of a hare, and Brahman, being unknown, does not exist. In order that they may not fall into that error this parable is introduced; for, the subsequent passages clearly show the folly of thinking that that Brahman who is controller of all in every way, Deva, even superior to all Devas, Lord over lords, not easily known, the cause of the victory of the Devas and of the defeat of the Asuras does not exist. Or (it is related) for eulogising the knowledge of Brahman. How? By showing that it was, indeed, by the knowledge of the Brahman that Fire, etc., attained pre-eminence among the Devas; and Indra specially more than the rest. Or. it shows how difficult it is to know Brahman, because even Fire, etc, with all their great powers, and even Indra. lord of the Devas knew the Brahman only with considerable difficulty. It may be that the whole Upanishad to follow is intended to lay down an injunction (to know the Brahman) or the story may have been intended to show the fallacious nature of the notion of doer, etc., found in all living beings, by contrasting it with the knowledge of the Brahman—fallacious like the notion of the Devas that the victory was theirs. The Brahman already defined won a victory for the benefit of the Devas; the Brahman in a battle between the Devas and the Asuras defeated the Asuras, the enemies of the world and the violators of the limitations imposed by the Lord and gave the benefit of the victory to the Devas for the preservation of the world. In this victory of Brahman the Devas, Fire, etc., attained glory, and not knowing that the victory and glory belonged to the Paramatman, seated in then own Atman, the witness of all perceptions, Lord of the universe, omniscient, the dispenser of the fruits of all Karma, omnipotent, and desirous of securing the safety of the world, looked upon the victory and the glory, as achieved by themselves—the Atman enclosed within the limitations of their own forms, Fire. etc.; that the glory—their being Fire, Air, Indra and the like, resulting from the victory—was theirs and that neither the victory nor the glory belonged to the Lord, over all the Atman within them. So they cherished this false notion."
  },
  "meaning": ".This verse is from the Rigveda, a collection of ancient Hindu scriptures. It describes the victory of Brahma, the Supreme Being, over the gods. It signifies the superiority and power of Brahma over the divine beings. The gods acknowledge His triumph and attain greatness through His victory. They desire that this victory and greatness be exclusively their own, showing their admiration and respect for Brahma. It highlights the transcendence of Brahma in the Hindu pantheon."
}