{
    "verse": "किं ब्रूमस्त्वां यशोदे कति कति सुकृतक्षेत्रवृन्दानि पूर्वम्, गत्वा कीदृग् विधानैः कति कति सुकृतान्यर्जितानित्वयैव । नो शक्रो न स्वयम्भूर्न च मदनरिपुर्यस्य लेभे प्रसादम्, तत् पूर्णं ब्रह्म भूमौ विलुठति विलपत्क्रोडमारोढुकामम् ॥",
    "learning": {
        "विलपत्": "विल -> विलाप करना"
    },
    "terms": {
        "किं": "what",
        "ब्रूमः": "we say",
        "त्वां": "to you",
        "यशोदे": "Yashoda",
        "कति": "how many",
        "सुकृतक्षेत्रवृन्दानि": "fields of virtuous actions",
        "पूर्वम्": "previously",
        "गत्वा": "having gone",
        "कीदृग्": "in what way",
        "विधानैः": "by your arrangements",
        "सुकृतान्यर्जितानित्वयैव": "by the acquisition of those virtuous actions alone",
        "नः": "we",
        "शक्रः": "Indra",
        "न": "not",
        "स्वयम्भूः": "self-born (Brahma)",
        "च": "and",
        "मदनरिपुः": "the enemy of Madana/Kamadeva (Shiva)",
        "यस्य": "whose",
        "लेभे": "I obtain",
        "प्रसादम्": "grace",
        "तत्": "that",
        "पूर्णं": "complete",
        "ब्रह्म": "Brahman",
        "भूमौ": "in the earth",
        "विलुठति": "to roll, move to and fro, quiver, flicker",
        "विलपत्": "laments",
        "क्रोडमारोढुकामम्": "गोद में जाने के लिए"
    },
    "meaning": "अरे मैया यशोदा तूने कौन कौन सा पुण्य किया है ? मैंने भी सब वेद समझा है, ऐसा तो कोई वेद में कर्म नहीं लिखा है जिसका ये फल हो कि ब्रह्म गोद में आने को रोये और जीव धुतकारे, जाओ खेलो हमारे पास समय नहीं है, घर के तमाम काम करने हैं तुम्ही को गोदी में लेकर बैठे रहे । वेद तो खाली इतना बताता है कि तुमको ब्रह्म से मिला देगा बस, लेकिन ब्रह्म स्वामी बनकर रहेगा, वो आनंद ब्रह्म है ये तो रोने वाला ब्रह्म है और गोद में जाने को रो रहा है और जीव केह रहा है मेरे पास समय नहीं है । अरे जिसकी गोद में जाने को ब्रह्मा शंकर तरसते रहते हैं मदनरिपु स्वयम्भू वो तेरी गोद में आने को रो रहा है मैया और तू केहती है जा, What shall we say to you, Yashoda? How many fields of virtuous actions have you traversed in the past? By what arrangements of yours have you obtained so many and so many virtuous actions alone? Neither Indra (the ruler of heaven) nor Brahma (the creator), nor the enemy of Madana (Shiva) have I obtained grace from. Therefore, the complete Brahman finds delight in this earth, while the tree\": \"hopping bird of lamentation laments."
}