{
    "verse": "क्लेशे क्रमात् पंचविधे क्षयं गते यद् ब्रह्मसौख्यं स्वयमस्फुरत् परम्। तद् व्यर्थयन् कः पुरतो नराकृतिः श्यामोऽयमामोदभरः प्रकाशते",
    "terms": {
        "क्लेशे": "In afflictions/difficulties",
        "क्रमात्": "gradually",
        "पंचविधे": "five types",
        "क्षयं": "destruction",
        "गते": "happens",
        "यद्": "when",
        "ब्रह्मसौख्यं": "the bliss of Brahman (Supreme Reality)",
        "स्वयम्": "spontaneously",
        "अस्फुरत्": "manifests",
        "परम्": "supreme",
        "तद्": "Therefore",
        "व्यर्थयन्": "wasting",
        "कः": "who",
        "पुरतो": "in front",
        "नराकृतिः": "a human form",
        "श्यामोऽयम्": "is black (dark)",
        "आमोदभरः": "filled with joy/fragrance",
        "प्रकाशते": "shines/illuminates"
    },
    "meaning": "पंचक्लेश को पार करके जो ब्रह्मानंद मिला उसमें में डूबा रहा, उसको व्यर्थ करते हुए, उसको मिटाते हुए ये नीले रंग का बालक कहाँ से आ गया, इसको मैं जानता भी नहीं When the five types of afflictions gradually get destroyed, the bliss of Brahman spontaneously manifests in the individual. Therefore, what is the use of a human form if one is not able to experience this supreme bliss? This human form, even though it may appear black and mundane, shines and illuminates when filled with the joy of realizing the ultimate truth.Explanation: The verse emphasizes the importance of attaining liberation or union with the Supreme Reality. It states that when the five types of afflictions, namely ignorance, egoism, attachment, aversion, and fear of death, gradually diminish and ultimately get destroyed, the innate bliss of Brahman spontaneously manifests in the individual. This bliss is the ultimate goal, and attaining it leads to liberation from the cycle of birth and death.The verse then questions the purpose of a human form if one does not make efforts to realize this supreme bliss. It suggests that even though a human form may seem ordinary and mundane, if one is able to fill it with the joy of realizing the truth, it becomes radiant and illuminating.Overall, the verse highlights the importance of spiritual growth, the destruction of ignorance, and the realization of the supreme bliss of Brahman in achieving true fulfillment and liberation."
}