{
    "verse": "चयस्त्विषामित्यवधारितं पुरा ततः शरीरीति विभाविताकृतिम् । विभुर्विभक्तावयवं पुमानिति क्रमादमुं नारद इत्यबोधि सः ॥ (शिशुपालवधम् १-३)",
    "terms": {
        "चयः": "individual, jiva (soul)",
        "त्विषाम्": "of the senses",
        "इति": "thus",
        "अवधारितं": "determined, upheld",
        "पुरा": "previously, before",
        "ततः": "from that",
        "शरीरी": "the embodied being, individual soul",
        "विभावित": "conceived, assumed",
        "आकृतिम्": "form, appearance",
        "विभुः": "the Supreme Lord, Ishwara",
        "विभक्त": "differentiated, distinct",
        "अयवम्": "in different parts, limbs",
        "पुमान्": "individual soul, jiva",
        "क्रमात्": "sequentially, gradually",
        "अमुं": "unto",
        "नारद": "Oh Narada",
        "अबोधि": "taught, instructed",
        "सः": "He, Lord Krishna",
        "Similarly, it is realized that the individual soul (jiva) is also understood in the same manner": "as distinct and differentiated in various aspects. The individual soul is not limited to one form but exists in multiple bodies and experiences various states of existence.",
        "Finally, Sage Vyasa addresses Narada, saying that this sequential understanding has been taught by Lord Krishna": "indicating that it is the knowledge imparted by the divine."
    },
    "meaning": "Meaning: Previously, it was determined that the senses constitute the individual soul (jiva). From that, the concept of the embodied being (shariri) was conceived. Then, it was understood that the Supreme Lord (Ishwara) is distinct and differentiated in various parts. The individual soul (jiva) was also understood in the same manner. In this sequential understanding, Oh Narada, He, (Lord Krishna) instructed thus. (Shishupala Vadha 1.3)Explanation: In this verse from the Shishupala Vadha, Sage Vyasa explains the sequential understanding of the individual soul (jiva) and the Supreme Lord (Ishwara). Firstly, it is said that the soul (jiva) is upheld by the senses (tvisham). This means that the existence and functioning of the individual soul is dependent on the senses. Then, the concept of the embodied being (shariri) is introduced. The embodied being refers to the individual soul's association with a physical body. This indicates that the individual soul is not separate from the body but exists within it.Next, it is understood that the Supreme Lord (Ishwara) is distinct and differentiated in various parts (limbs). This implies that the Supreme Lord is not confined to a specific form but manifests in multiple forms and aspects."
}