```json
{
  "कर्मणा": "karmaṇā",
  "meaning": "by action, by deed",
  "बध्यते": "badhyate",
  "meaning": "is bound, is tied",
  "जन्तुः": "jantuḥ",
  "meaning": "being, creature",
  "विद्यया": "vidyayā",
  "meaning": "by knowledge, by wisdom",
  "च": "ca",
  "meaning": "and",
  "विमुच्यते": "vimucyate",
  "meaning": "is freed, is liberated",
  "तस्मात्": "tasmāt",
  "meaning": "therefore",
  "कर्म": "karma",
  "meaning": "action, deed",
  "न": "na",
  "meaning": "not",
  "कुर्वन्ति": "kurvanti",
  "meaning": "do, perform",
  "यतयः": "yata-yaḥ",
  "meaning": "ascetics, renunciants",
  "पारदर्शी": "pāra-darśī",
  "meaning": "seeing through, insightful"
}
```

**Overall meaning:**

"A being is bound by action, but liberated by knowledge. Therefore, insightful ascetics do not perform actions."

**Explanation:**

This verse explains the core principle of liberation within the context of the ascetic's life.

* **Bound by action (karmaṇā badhyate jantuḥ):**  The verse states that actions, or karma, bind a being to the cycle of birth and death.  This suggests that actions have consequences, creating a web of cause and effect that can lead to suffering.
* **Liberated by knowledge (vidyayā ca vimucyate):**  However, knowledge, or wisdom, can liberate a being from this cycle.  True knowledge involves understanding the nature of the Self and the illusory nature of the world. This knowledge leads to detachment from actions and their consequences. 
* **Ascetics and action (tasmāt karma na kurvanti yata-yaḥ pāra-darśī):**  Therefore, insightful ascetics (yata-yaḥ) do not perform actions.  This does not mean they are passive or inactive. It means that they act from a place of understanding and non-attachment.  Their actions are not driven by ego or desire, but by compassion and a deeper understanding of the true nature of reality.

This verse emphasizes the importance of knowledge and detachment in achieving liberation. It highlights the dangers of acting from a place of ego or desire and the power of wisdom to break free from the cycle of karma.  The life of an ascetic, guided by knowledge, is characterized by a conscious effort to live in harmony with the universe, recognizing the interconnectedness of all things and acting with compassion and understanding. 
